ItemInfo = {}

-- 小还丹
ItemInfo[0] = {
    "Ｌ物品说明：可恢复少量生命",
    "Ｎ",
    "Ｄ使用效果：+150生命",
}

-- 天香续命膏
ItemInfo[1]={
    "Ｌ物品说明：可恢复较多生命",
    "Ｎ",
    "Ｄ使用效果：+300生命",
}

-- 黑玉断续膏
ItemInfo[2]={
    "Ｌ物品说明：可恢复大量生命",
    "Ｎ",
    "Ｄ使用效果：+500生命",
}

-- 白云熊胆丸
ItemInfo[3]={
    "Ｌ物品说明：可恢复少量内力",
    "Ｎ",
    "Ｄ使用效果：+666内力",
}

-- 田七鲨胆散
ItemInfo[4]={
    "Ｌ物品说明：可恢复一些内力",
    "Ｎ",
    "Ｄ使用效果：+888内力",
}

-- 九花玉露丸
ItemInfo[5]={
    "Ｌ物品说明：可恢复较多内力",
    "Ｎ",
    "Ｄ使用效果：+1250内力，中毒-20",
}

-- 九转熊蛇丸
ItemInfo[6]={
    "Ｌ物品说明：可恢复大量内力",
    "Ｎ",
    "Ｄ使用效果：+3000内力",
}

-- 无常丹
ItemInfo[7]={
    "Ｌ物品说明：可恢复一些生命和内力",
    "Ｎ",
    "Ｄ使用效果：+300生命，+800内力",
}

-- 天王保命丹
ItemInfo[8]={
    "Ｌ物品说明：最好的药",
    "Ｎ",
    "Ｄ使用效果：+50体力，+500生命，+1200内力，解毒-25",
}

-- 黄连解毒丸
ItemInfo[9]={
    "Ｌ物品说明：可少量解毒",
    "Ｎ",
    "Ｄ使用效果：解毒-20",
}

-- 牛黄血蝎丹
ItemInfo[10]={
    "Ｌ物品说明：中等解毒药",
    "Ｎ",
    "Ｄ使用效果：解毒-50",
    "Ｄ使用效果：时序解毒1",
}

-- 六阳正气丹
ItemInfo[11]={
    "Ｌ物品说明：高等解毒药",
    "Ｎ",
    "Ｄ使用效果：解毒-80",
    "Ｄ战场抗毒+100，持续全场",
}

-- 精气丸
ItemInfo[12]={
    "Ｌ物品说明：可恢复一些体力",
    "Ｎ",
    "Ｄ使用效果：恢复体力+40",
}

-- 玉灵散
ItemInfo[13]={
    "Ｌ物品说明：可恢复大量体力",
    "Ｎ",
    "Ｄ使用效果：恢复体力+66",
}

-- 千年灵芝
ItemInfo[14]={
    "Ｌ物品说明：可增加人物体质",
    "Ｎ",
    "Ｄ使用效果：人物体质增加1点",
}

-- 大蟠桃
ItemInfo[15]={
    "Ｌ物品说明：可增加人物武学点数",
    "Ｎ",
    "Ｄ使用效果：武学点数+2",
}

-- 千年人参
ItemInfo[16]={
    "Ｌ物品说明：可增加人物属性点数",
    "Ｎ",
    "Ｄ使用效果：属性点数+1",
}

-- 天山雪莲
ItemInfo[17]={
    "Ｌ物品说明：可增加人物武学点数和实战",
    "Ｎ",
    "Ｄ使用效果：实战+2,武学点数+2",
}

-- 叫花鸡
ItemInfo[18]={
    "Ｌ物品说明：名菜",
    "Ｎ",
    "Ｄ使用效果：暂无",
}

-- 好逑汤
ItemInfo[19]={
    "Ｌ物品说明：名菜",
    "Ｎ",
    "Ｄ使用效果：暂无",
}

-- 玉笛谁家听落梅
ItemInfo[20]={
    "Ｌ物品说明：名菜，",
    "Ｎ",
    "Ｄ使用效果：暂无",
}

-- 腊八粥
ItemInfo[21]={
    "Ｌ物品说明：可增加内力最大值",
    "Ｎ",
    "Ｄ使用效果：最大内力值+500",
}

-- 梨花酒
ItemInfo[22]={
    "Ｌ物品说明：名酒",
    "Ｎ",
    "Ｄ使用效果：解除冰封50点并时序恢复1点冰封，持续100时序",
}

-- 玉露酒
ItemInfo[23]={
    "Ｌ物品说明：名酒",
    "Ｎ",
    "Ｄ使用效果：解除灼烧20点并时序恢复1点灼烧，持续100时序",
}

-- 即墨老酒
ItemInfo[24]={
    "Ｌ物品说明：名酒",
    "Ｎ",
    "Ｄ使用效果：解除流血50点并时序恢复1点流血，持续100时序",
}

-- 五宝花蜜酒
ItemInfo[25]={
    "Ｌ物品说明：名酒",
    "Ｎ",
    "Ｄ使用效果：免疫所有攻击基础异常",
}

-- 莽牯朱蛤
ItemInfo[26]={
    "Ｌ物品说明：万毒之王，百毒不侵，炼制地灵丹的材料之一",
    "Ｎ",
    "Ｄ使用效果：+100抗毒",
}

-- 通犀地龙丸
ItemInfo[27]={
    "Ｌ物品说明：西毒炼制，百毒不侵",
    "Ｎ",
    "Ｄ使用效果：+100抗毒",
}

-- 飞蝗石
ItemInfo[28]={
    "Ｌ物品说明：最普通的暗器",
    "Ｎ",
    "Ｄ使用效果：-30生命",
}

-- 飞刀
ItemInfo[29]={
    "Ｌ物品说明：飞是小李飞刀的刀",
    "Ｎ",
    "Ｄ使用效果：-50生命",
}

-- 金蛇锥
ItemInfo[30]={
    "Ｌ物品说明：金蛇郎君成名暗器",
    "Ｎ",
    "Ｄ使用效果：-80生命",
}

-- 霹雳弹
ItemInfo[31]={
    "Ｌ物品说明：一硫二硝三碳调制而成",
    "Ｎ",
    "Ｄ使用效果：-100生命",
}

-- 毒蒺藜
ItemInfo[32]={
    "Ｌ物品说明：球上有刺，刺上有毒",
    "Ｎ",
    "Ｄ使用效果：-40生命，+40中毒",
}

-- 玉蜂针
ItemInfo[33]={
    "Ｌ物品说明：古墓派含毒之暗器",
    "Ｎ",
    "Ｄ使用效果：-60生命，+60中毒",
}

-- 冰魄银针
ItemInfo[34]={
    "Ｌ物品说明：古墓派含毒之暗器",
    "Ｎ",
    "Ｄ使用效果：-70生命，+70中毒",
}

-- 黑血神针
ItemInfo[35]={
    "Ｌ物品说明：日月神教暗器，含剧毒",
    "Ｎ",
    "Ｄ使用效果：生命-80，中毒+80",
}

-- 玄铁剑
ItemInfo[36]={
    "Ｇ装备效果；玄铁剑法威力+100",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：使用玄铁剑法时，增加50%暴击率",
    "Ｗ◇LV.2：使用玄铁剑法时，增加60%暴击率",
    "Ｗ◇LV.3：使用玄铁剑法时，增加70%暴击率",
    "Ｗ◇LV.4：使用玄铁剑法时，增加80%暴击率",
    "Ｗ◇LV.5：使用玄铁剑法时，增加90%暴击率",
    "Ｗ◇LV.6（MAX）：使用玄铁剑法时，必定暴击，并可发动“破尽天下”",
}

-- 倚天剑
ItemInfo[37]={
    "Ｇ装备效果；倚天剑法威力+200",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：攻击时50%几率造成流血效果",
    "Ｗ◇LV.2：攻击时60%几率造成流血效果",
    "Ｗ◇LV.3：攻击时70%几率造成流血效果",
    "Ｗ◇LV.4：攻击时80%几率造成流血效果",
    "Ｗ◇LV.5：攻击时90%几率造成流血效果",
    "Ｗ◇LV.6（MAX）：攻击时必定造成流血效果", 
    "Ｎ",
    "Ｗ◇【倚天一出·谁于争锋】",
    "Ｗ◇御剑能力>=200，(御剑系数*0.1)%概率增加一次连击，",  
}

-- 流星剑
ItemInfo[38]={
    "Ｇ装备效果；连击率+10%",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：连击率+10%",
    "Ｗ◇LV.2：连击率+11%",
    "Ｗ◇LV.3：连击率+12%",
    "Ｗ◇LV.4：连击率+13%",
    "Ｗ◇LV.5：连击率+14%",
    "Ｗ◇LV.6（MAX）：连击率+15%",                                  --  by 飘夜
}

-- 白龙剑
ItemInfo[39]={
    "Ｇ装备效果；苗家剑法威力+100",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 金蛇剑
ItemInfo[40]={
    "Ｇ装备效果；金蛇剑法威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 凝碧剑
ItemInfo[41]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 白虹剑
ItemInfo[42]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 屠龙刀
ItemInfo[43]={
    "Ｇ装备效果；使用刀法武功攻击几率触发：",
    "Ｎ",
    "Ｗ◇【武林至尊·宝刀屠龙】",
    "Ｗ◇必定造成流血且追加气攻,追加的气攻数值等于所使用刀法的威力",
    "Ｗ◇【号令天下·莫敢不从】",
    "Ｗ◇必定造成暴击",
    "Ｗ◇屠龙刀法威力+500",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 血刀
ItemInfo[44]={
    "Ｇ装备效果；血刀刀法威力+200",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：攻击时，恢复造成伤害5%的血量",
    "Ｗ◇LV.2：攻击时，恢复造成伤害6%的血量",
    "Ｗ◇LV.3：攻击时，恢复造成伤害7%的血量",
    "Ｗ◇LV.4：攻击时，恢复造成伤害8%的血量",
    "Ｗ◇LV.5：攻击时，恢复造成伤害9%的血量",
    "Ｗ◇LV.6（MAX）：攻击时，恢复造成伤害10%的血量",
}

-- 冷月宝刀
ItemInfo[45]={
    "Ｇ装备效果；胡家刀法威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 绿波香露刀
ItemInfo[46]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 金刀
ItemInfo[47]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 雁翎刀
ItemInfo[48]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 打狗棒
ItemInfo[49]={
    "Ｇ装备效果；打狗棒法威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 伏魔杵
ItemInfo[50]={
    "Ｇ装备效果；伏魔杖法威力+100",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 金龙鞭
ItemInfo[51]={
    "Ｇ装备效果；黄沙万里鞭法威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 鳄嘴剪
ItemInfo[52]={
    "Ｇ装备效果；大剪刀威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 判官笔
ItemInfo[44]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 亮银枪
ItemInfo[54]={
    "Ｇ装备效果；破甲+10%",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 神山剑
ItemInfo[55]={
    "Ｇ装备效果；神山剑法威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 玄铁菜刀
ItemInfo[56]={
    "Ｇ装备效果；西瓜刀法威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 犽月
ItemInfo[57]={
    "Ｇ装备效果；犽月流空威力+200",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 软猬甲
ItemInfo[58]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：减伤20点，被拳指系武功攻击时，使攻击方流血10点",
    "Ｗ◇LV.2：减伤22点，被拳指系武功攻击时，使攻击方流血10点",
    "Ｗ◇LV.3：减伤24点，被拳指系武功攻击时，使攻击方流血10点",
    "Ｗ◇LV.4：减伤26点，被拳指系武功攻击时，使攻击方流血10点",
    "Ｗ◇LV.5：减伤28点，被拳指系武功攻击时，使攻击方流血10点",
    "Ｗ◇LV.6（MAX）：减伤30点，被拳指系武功攻击时，使攻击方流血10点",
}

-- 乌蚕衣
ItemInfo[59]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：被攻击时，受到的内伤减少5点",
    "Ｗ◇LV.2：被攻击时，受到的内伤减少6点",
    "Ｗ◇LV.3：被攻击时，受到的内伤减少7点",
    "Ｗ◇LV.4：被攻击时，受到的内伤减少8点",
    "Ｗ◇LV.5：被攻击时，受到的内伤减少9点",
    "Ｗ◇LV.6（MAX）：被攻击时，受到的内伤减少10点",
}

-- 金丝背心
ItemInfo[60]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：被攻击时，受到的封穴减少5点",
    "Ｗ◇LV.2：被攻击时，受到的封穴减少6点",
    "Ｗ◇LV.3：被攻击时，受到的封穴减少7点",
    "Ｗ◇LV.4：被攻击时，受到的封穴减少8点",
    "Ｗ◇LV.5：被攻击时，受到的封穴减少9点",
    "Ｗ◇LV.6（MAX）：被攻击时，受到的封穴减少10点",
}

-- 鳄皮护甲
ItemInfo[61]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：每次行动结束后解毒25点",
    "Ｗ◇LV.2：每次行动结束后解毒35点",
    "Ｗ◇LV.3：每次行动结束后解毒45点",
    "Ｗ◇LV.4：每次行动结束后解毒55点",
    "Ｗ◇LV.5：每次行动结束后解毒65点",
    "Ｗ◇LV.6（MAX）：每次行动结束后解毒75点",
}

-- 佛心甲
ItemInfo[62]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：被攻击时，受到的灼烧减少50%",
    "Ｗ◇LV.2：被攻击时，受到的灼烧减少60%",
    "Ｗ◇LV.3：被攻击时，受到的灼烧减少70%",
    "Ｗ◇LV.4：被攻击时，受到的灼烧减少80%",
    "Ｗ◇LV.5：被攻击时，受到的灼烧减少90%",
    "Ｗ◇LV.6（MAX）：被攻击时，免疫灼烧状态" 
}

-- 皮衣
ItemInfo[63]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：被攻击时，受到的冰封减少50%",
    "Ｗ◇LV.2：被攻击时，受到的冰封减少60%",
    "Ｗ◇LV.3：被攻击时，受到的冰封减少70%",
    "Ｗ◇LV.4：被攻击时，受到的冰封减少80%",
    "Ｗ◇LV.5：被攻击时，受到的冰封减少90%",
    "Ｗ◇LV.6（MAX）：被攻击时，免疫冰封状态" 
}

-- 北冥神功
ItemInfo[64]={
    "Ｌ习得内功：北冥神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇攻击时，50%几率吸取敌方7%当前内力（上限300）",
    "Ｗ◇被攻击时，50%几率发动“北冥神功.百川入海”吸取敌方200点内力并转移到",
    "Ｗ  自身",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇攻击时，30%几率吸取敌方7%当前内力（上限300）",
    "Ｗ◇被攻击时，50%几率触发“北冥真气”护体，提升800点气防（可叠加）",
    "Ｗ◇增加300点内力硬上限（与吸星大法同类效果不叠加）",
    "Ｗ *吸取内力时，提升自身内力上限",
    "Ｗ◇(15+天书数量)%机率发动“北冥.气吞山河”特效吸怒20点(限主角)",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇逍遥御风：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
    "Ｗ             *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
    "Ｗ             *当累积点数达到9点时，清空封穴",
    "Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
    "Ｗ             *单次攻击累积“逍遥御风”上限为3次",
}

-- 吸星大法
ItemInfo[65]={
    "Ｌ习得内功：吸星大法",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇攻击时，50%几率吸取敌方7%当前内力（上限300）与少量体力",
    "Ｗ◇被攻击时，50%几率发动“万物相吸.吸星大法”吸取敌方200点内力并转移到",
    "Ｗ  自身100点",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇攻击时，30%几率吸取敌方7%当前内力（上限300）与少量体力",
    "Ｗ◇增加300点内力硬上限（与北冥神功同类效果不叠加）",
    "Ｗ *吸取内力时，提升自身内力上限",
    
    "Ｎ",
    "Ｄ组合效果：天魔功 + 吸星大法",
    "Ｗ◇主运天魔功额外暴怒一次。",
}

-- 化功大法
ItemInfo[66]={
    "Ｌ习得内功：化功大法",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇攻击时，50%几率化去敌方5%当前内力（上限300，下限100），并强制上毒",
    "Ｗ  16~20点",
    "Ｗ◇被攻击时，50%几率发动“化功大法”化去敌方200点内力，并强制上毒",
    "Ｗ  10~15点",
    
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇攻击时，30%几率化去敌方5%当前内力（上限300，下限100），并强制上毒",
    "Ｗ  16~20点",
}

-- 紫霞秘笈
ItemInfo[67]={
    "Ｌ习得内功：紫霞神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇行动结束后回复20%已消耗的内力（覆盖被动效果）",
    "Ｗ◇使用剑系武功有50%的几率触发“紫霞剑气”追加1000气攻",
    "Ｗ◇剑法出招概率+20%",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇行动结束后回复10%已消耗的内力",
    "Ｗ◇蓄力必成功，且蓄力效果持续多回合（初始为2回合，每获得7本天书，持续",
    "Ｗ  回合数+1）",
    "Ｗ◇使用剑系武功有25%的几率触发“紫霞剑气”追加1000气攻",
    "Ｗ  触发紫霞蓄力时，无法同时触发蛤蟆，龙象等蓄力的效果",
    "Ｗ◇剑法出招+10%",
    "Ｗ◇太岳三清峰攻击力上升100点，使用太岳三清峰机率触发「西岳如立」",
    "Ｎ",
    "Ｄ一脉相承",
    "Ｗ◇学习五岳剑诀一脉相承",
}

-- 混元功法
ItemInfo[68]={
    "Ｌ习得内功：混元功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇每3时序回复1点体力（覆盖被动效果）",
    "Ｗ◇造成的封穴效果提高20%",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇混元一气：同时修炼混元掌/混元功",
    "Ｗ◇混元一气：攻击时追加5~15点内伤和5~15时序集气混乱",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇行动结束后回复少许内伤",
    "Ｗ◇每6时序回复1点体力",
    "Ｗ◇造成的封穴效果提高10%",
    
    "Ｎ",
    "Ｄ组合效果：混元功 + 蛤蟆功/鲸息功",
    "Ｗ◇行动后回复100点生命值200点内力值和5点体力值","Ｗ◇随机获得一种药品BUFF","Ｗ◇每回合结束怒气+10","Ｗ◇内功天赋为蛤蟆功/鲸息功/混元功时10%概率爆怒一次。",
}

-- 狮吼功法
ItemInfo[69]={
    "Ｌ习得内功：狮子吼",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇攻击时必定发动“狮子吼”，对全场内力低于自身1000点的敌人杀退",
    "Ｗ  100点集气，且追加造成5-9点内伤",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇攻击时50%几率发动“狮子吼”，对全场内力低于自身1000点的敌人杀退",
    "Ｗ  50点集气",
    "Ｎ",
    "Ｄ一脉相承：",
    "Ｗ◇金刚禅狮子吼",
    "Ｎ",
    "Ｚ特别说明：",  
    "Ｗ◇河东狮吼：女性角色发动“狮子吼”效果翻倍，消耗180点内力",
}

-- 圣火神功
ItemInfo[70]={
    "Ｌ习得内功：圣火神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇奇门招式+30%，奇门武功破防+10%",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
    "Ｗ◇攻击时60%几率，无视对方集气条位置击中其破绽",
    "Ｗ  在人物第一次行动之前是不会被击中破绽的",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇奇门招式+16%，奇门武功破防+6%",
    "Ｗ◇进入战斗时的初始集气值+200~300",
    "Ｗ◇攻击可造成‘观火’状态",
    "Ｗ◇如行动前未移动或者移动格数未消耗完，可在行动后获得一次移动机会",
    "Ｎ",
    "Ｄ奇门武功：",
    "Ｗ◇使用圣火神功攻击算奇门系数"
}

-- 神照经
ItemInfo[71]={
    "Ｌ习得内功：神照功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇复活时的回复百分比由（35+天书数量）提高至（70+天书数量×2）",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇首次被击退时，100%发动“神照功起死回生”复活，之后有6%的几率发动",
    "Ｗ◇复活时回复（35+天书数量）%的生命/耗损内力/耗损体力以及异常状态、",
    "Ｗ  集气值+500",
    "Ｎ",
    "Ｄ一脉相承：",
    "Ｗ◇长生诀",
}

-- 十八泥偶
ItemInfo[72]={
    "Ｌ习得内功：罗汉伏魔功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇行动结束后恢复10%已损失的生命值（上限200）",
    "Ｗ◇每时序额外回复1点流血",
    "Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇行动结束后恢复5%已损失的生命值（上限100）",
    "Ｗ◇本内功加力时发动“罗汉伏魔”，根据以下公式提升伤害与杀气[高优先级]",
    "Ｗ  罗汉伏魔提升伤害和杀气效果为：[(当前内力值/30000)+(武功消耗内力/2000)]%",
    "Ｗ  同时学有易筋神功+罗汉伏魔功，主运【易筋神功】攻击时必出“罗汉伏魔”",
    "Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
    "Ｎ",
    "Ｄ世尊降魔(组合特效)：",
    "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
    "Ｗ◇效果：暴击率增加50%",
    "Ｗ◇追加气功/20点伤害，暴怒追加气功/15点伤害",
    "Ｗ◇伤害低于100则伤害增加100",
    "Ｄ罗汉金身(组合特效)：",
    "Ｗ◇学会罗汉伏魔功、金刚不坏体",
    "Ｗ◇受到第一次的伤害概率减伤50%",
    
    "Ｎ",
    "Ｄ组合效果：擒龙功 + 罗汉伏魔功",
    "Ｗ◇飞龙 集气位置不会低于250，暴怒时集气速度3倍",
    "Ｗ◇潜龙 行动后几率自动防御，防御状态下集气位置不会低于500 ",
    "Ｗ◇亢龙 攻击时按照暴击计算",
    "Ｗ◇双龙 几率连击次数翻倍，如果连击被打断，伤害计算到下次攻击",
    "Ｗ◇狂龙 自身气攻越高，伤害越高",
    "Ｗ◇擒龙奥义·困龙升天 攻击时几率附加负面状态给敌人 ",
    "Ｗ◇乔峰学会擒龙功就有以上效果、洪七公学会且主运擒龙功才有以上效果",
    
    "Ｎ",
    "Ｄ组合效果：金刚不坏体 + 罗汉伏魔功",
    "Ｗ◇被攻击时减伤80点伤害,30%概率减伤150-250。20%概率减伤50%。",
    
    "Ｎ",
    "Ｄ组合效果：伏魔杖法 + 罗汉伏魔功",
    "Ｗ◇伏魔杖法·大鹏展翅 攻击触发全屏锁足",
    "Ｗ◇伏魔杖法·秦王鞭石 攻击触发5*5范围攻击，必封穴、流血、冰封、灼烧",
    "Ｗ◇伏魔杖法·罗汉护法 以自身所剩内力的50%、怒气为基础触发杀气伤害，当自身怒气大于0时，所有攻击提升20%",
    "Ｗ◇伏魔杖法·拨云见日 每次攻击增加怒气5点，怒气增长速度为双倍",
    "Ｗ◇攻击根据自身特系兵器值的1/2为附加伤害",
    "Ｗ◇以上效果达摩使用伏魔杖法即可触发效果，其他人物学会罗汉伏魔功、伏魔杖法后即可触发，无需主运",
}

-- 蛤蟆功法
ItemInfo[73]={
    "Ｌ习得内功：蛤蟆功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇蓄力必成功，并同时执行防御指令，且下回合集气+300",
    "Ｗ◇强化蓄力效果，伤害加成从25%提升至50%，气攻加成从600提升至1200",
    "Ｗ◇每时序增加1点怒气",
    "Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇无其他内功护体时，必定触发蛤蟆功护体气防提升900点",
    "Ｗ◇受攻击时触发“蛤蟆功.蓄力”，累计蓄力值",
    "Ｗ◇蓄力值满100后，下次攻击时可发动“蟾震九天”，根据蓄力值追加气攻",
    "Ｄ一脉相承：",
    "Ｗ◇鲸息功",
    
    "Ｎ",
    "Ｄ组合效果：混元功 + 蛤蟆功/鲸息功",
    "Ｗ◇行动后回复100点生命值200点内力值和5点体力值","Ｗ◇随机获得一种药品BUFF","Ｗ◇每回合结束怒气+10","Ｗ◇内功天赋为蛤蟆功/鲸息功/混元功时10%概率爆怒一次。",
}

-- 乾坤大挪移
ItemInfo[74]={
    "Ｌ习得内功：乾坤大挪移",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇内力高于对方时,被攻击75%几率触发“乾坤大挪移反弹”反弹30%伤害",
    "Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
    "Ｗ◇每时序额外回复1点流血",
    "Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇内力高于对方时,被攻击(40+天书)%几率触发“乾坤大挪移反弹”反弹20%伤害",
    "Ｎ",
    "Ｇ我方专属效果：",
    "Ｗ◇每获得一本天书，触发反弹几率+3%（包括主动及被动）",
}

-- 小无相功
ItemInfo[75]={
    "Ｌ习得内功：小无相功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇总气防提升30%",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇“无我无相”，攻击与被攻击时，兵器值判定必定不低于敌方",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇总气防提升10%",
    "Ｗ◇降低修炼武功兵器值需求10点、降低兵器装备需求兵器值10点",
    "Ｗ◇小无相功加力时，必定发动武功招式（降龙、六脉无效）",
    "Ｗ *战斗结束后获得的经验值翻倍",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇逍遥御风：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
    "Ｗ             *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
    "Ｗ             *当累积点数达到9点时，清空封穴",
    "Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
    "Ｗ             *单次攻击累积“逍遥御风”上限为3次",
    "Ｎ",
}

-- 纯阳无极功
ItemInfo[76]={
    "Ｌ习得内功：纯阳无极功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每时序回复1点中毒",
    "Ｗ◇降低武功内力消耗60%",
    "Ｗ◇每时序额外回复1点冰封",
    "Ｗ◇【男性专属】减伤气防增加20%",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇降低武功内力消耗50%",
    "Ｗ◇被攻击时，降低50%本次攻击所造成的冰封",
}

-- 先天功秘笈
ItemInfo[77]={
    "Ｌ习得内功：先天功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
    "Ｗ◇行动前发动“先天调息”，获得一次休息效果",
    "Ｗ◇被杀气到-500位置的时候，回复10%生命最大值，集气位置归零",
    "Ｗ◇“先天罡气”：攻击时清除目标的蓄力效果，",
    "Ｗ  进入战场触发先天罡气护盾 抵消500点伤害，",
    "Ｗ  护盾被击破后5个回合后概率再次生成",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇每时序回复1点生命，2点内力",
    "Ｗ◇被杀气到-500位置的时候，身上所有内伤清零",
    "Ｗ◇被杀气到-500位置的时候，回复5%生命最大值，集气位置归零",
    "Ｗ *同时学有先天功+玉女心经，每时序额外回复1点封穴",
}

-- 辟邪剑谱
ItemInfo[78]={
    "Ｌ习得外功：辟邪剑法",
    "Ｎ",
    "Ｗ武功威力：140",
    "Ｗ武功气攻：随招式变化",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：米 1+3格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇习得葵花神功后，武功威力提高至1200",
    "Ｗ◇习得葵花神功后，必定触发特效“真辟邪剑法·葵花刺目”",
    "Ｗ◇被刺目的敌人，本场战斗伤害和杀气均下降15%，攻击时有20%几率落空",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇飞燕穿柳，伤害+100，主运葵花必连击",
    "Ｗ◇花开见佛，命中目标虚弱状态50时序",
    "Ｗ◇锺馗抉目，必刺目，目标100%概率MISS",
    "Ｗ◇扫荡群魔，大范围面攻，如果有流血，则时序损失目标0.5%生命值",
    "Ｗ◇紫气东来，最小3连~最大4连击，下回合不可攻击，如果有击杀，则无负面影响",
}

-- 八荒六合功
ItemInfo[79]={
    "Ｌ习得内功：八荒六合功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇被攻击时，60%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇防御时的效果加成由25%提升至40%，气防由500提升至1000",
    "Ｗ◇免疫难5以上NPC根据伤害高低所追加的杀气及龙象的追加杀气",
    "Ｗ◇被攻击时，20%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
    "Ｗ *触发八荒六合功护体时，必定发动护体气盾减伤",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇逍遥御风：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
    "Ｗ             *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
    "Ｗ             *当累积点数达到9点时，清空封穴",
    "Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
    "Ｗ             *单次攻击累积“逍遥御风”上限为3次"
}

-- 太玄经
ItemInfo[80]={
    "Ｌ习得内功：太玄神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇攻击时，有50+（天书数*2+实战/25）%的几率发动“太玄之重”，不造成怒气",
    "Ｗ◇发动“太玄之重”时，若敌方已暴怒，则有50+（天书数*2+实战/25）%的几率",
    "Ｗ  发动“救赵挥金锤.邯郸先震惊”，使敌方怒气值降低20点",
    "Ｗ◇被攻击时，有40%的几率发动“太玄之轻”，将被杀气值转换成提升集气值",
    "Ｗ◇发动“太玄之轻”时，免疫内伤和普通中毒",
    "Ｗ◇攻击时造成的怒气降低50%",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇攻击时，体力消耗减少2点",
    "Ｗ◇高优先级提升战场五系系数40%",
    "Ｗ◇防御时触发“防御开始.太玄蓄力”，防御的同时执行蓄力指令",
}

-- 龙象般若功
ItemInfo[81]={
    "Ｌ习得内功：龙象般若功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇高优先级提升10%伤害、降低10%所承受伤害",
    "Ｗ◇人物每次行动前自动进行蓄力",
    "Ｗ◇“龙象之力”的追加气攻随自身怒气值提高而提高；暴怒时，无视敌方绝对气防",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇“龙之蓄力·象之防御”，蓄力必成功，并同时执行防御指令",
    "Ｗ◇使50%攻击伤害转化为额外杀气（需破对方气防才能生效）",
    "Ｗ◇攻击时有60%几率发动“龙象之力”，追加1000气攻",
    "Ｄ组合特效：",
    "Ｗ◇金刚般若：学会大力金刚掌、般若掌、易筋神功，破防目标30%",
    "Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
    "Ｗ◇主运易筋神功，概率对敌方附加【业力引爆】效果。",
}

-- 逆运真经
ItemInfo[82]={
    "Ｌ习得内功：逆运经脉",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
    "Ｗ◇暴击率提高50%",
    "Ｗ◇暴击的攻击效果增加20%",
    "Ｗ◇每时序回复1点中毒",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇每6时序回复1点体力",
    "Ｗ◇减少暴击伤害15%",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇免疫封穴10点",
    "Ｗ◇集气概率向前跳跃50时序，学会九阴后跳跃100时序",
    "Ｗ◇暴击率提高30%",
    "Ｗ◇暴击伤害增加10%",
    "Ｎ",
    "Ｄ特别说明：",
    "Ｗ◇学有逆运真经，进入战场后会进入「逆运走火状态」，此状态下攻击有机率",
    "Ｗ◇二连、大幅增加暴击机率，自身集气速度会在0.8~1.5倍之间跳跃。",
    "Ｗ◇逆运走火状态同时学有九阴时，取消集气跳跃，改为固定＋10。",
    "Ｗ◇若学有逆运蛤蟆组合并主运逆运，则逆运走火变为「逆运暴走状态」。",
    "Ｗ◇逆运暴走：必二连、必然大幅增加暴击率，大幅增加加力护体机率，自身集气在2~2.5倍之间跳跃。",
}

-- 九阳真经
ItemInfo[83]={
    "Ｌ习得内功：九阳神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇【阳内专属】高优先级降低30%所承受伤害（不与被动叠加）",
    "Ｗ◇【阳内专属】内力消耗降低70%",
    "Ｗ◇【阳内专属】每7时序自动解除自身封穴",
    "Ｗ◇【阳内专属】每时序回复6点内力值",
    "Ｗ◇每时序额外回复1点冰封",
    "Ｗ◇每时序回复1点中毒",
    "Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
    "Ｗ◇【氤氲紫气】伤害大于99时，如果伤害大于199减伤99点，否则减伤66点",
    "Ｗ◇【阳内专属】行动前发动“九阳.抱元守一” 清除自身所有不良状态",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇【阳内专属】高优先级降低15%所承受伤害",
    "Ｗ◇【阳内专属】灼烧系武功必出灼烧",
    "Ｗ◇【阳内专属】被攻击有（20+天书数×3）%几率，发动“九阳真气”提升",
    "Ｗ   650点气防（可叠加）",
    "Ｗ *同时学有九阳神功+九阴神功，可获得“森罗万象”的特效，免疫敌方暴击",
    "Ｗ  的额外伤害，以及会心一击的额外气攻",
    
    "Ｎ",
    "Ｄ组合特效：九阳神功 + 两个阳内内功",
    "Ｗ◇九阳护盾：自带九层九阳护盾，被攻击时一层护盾抵消一次伤害，30时序恢复一","Ｗ◇层护盾",
    "Ｗ◇生生不息：内力不会低于30%，低于30%自动恢复",
    "Ｗ◇抱元守一：休息后恢复生命、内力、体力、内伤、中毒值",
    "Ｗ◇氤氲紫气：被攻击后根据伤害恢复生命、内力、气防值",
    "Ｗ◇诸法不侵：被攻击后强制反弹封穴，自己封穴值清0",
    "Ｗ◇九阳神功反震：根据自身内力值来反弹伤害并且自身集气速度上升",
    "Ｗ◇他强由他强·清风拂山岗：被攻击时绝对气防，若受到的攻击大于150点会消耗自","Ｗ◇身500内力值来降低80%的伤害",
    "Ｗ◇他横任他横·明月照大江：被攻击时根据敌方1/4的攻击反弹给对方",
    "Ｗ◇他自狠来他自恶·我自一口真气足：被攻击强制减伤80%",
    "Ｗ◇被攻击后杀气转变为集气，攻击必灼烧，攻击后自身恢复10点内力，如果保持阳","Ｗ◇性内力所有武功伤害增加40%，时序恢复生命、内力，如果自身处于受伤状态恢复加倍",
}

-- 九阴真经
ItemInfo[84]={
    "Ｌ习得内功：九阴神功",
    "Ｄ运功效果：",
    "Ｗ◇【阴内专属】提升20%伤害",
    "Ｗ◇【阴内专属】连击率提高50%",
    "Ｗ◇【阴内专属】每时序额外回复5点生命值",
    "Ｗ◇【阴内专属】第一击必定触发,连击30%概率触发“九阴破体”无视目标20%防御",
    "Ｗ◇每时序额外回复1点灼烧",
    "Ｗ◇每6时序回复1点体力",
    "Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
    "Ｄ被动效果：",
    "Ｗ◇【阴内专属】高优先级降低10%所承受伤害",
    "Ｗ◇【阴内专属】冰封系武功必出冰封",
    "Ｗ◇【阴内专属】被攻击有（20+天书数×3）%几率，发动“九阴真气”提升",
    "Ｗ   650点气防（可叠加）",
    "Ｗ◇【阴内专属】攻击时概率触发“飞絮劲”附加100点伤害 + 必命中",
    "Ｗ  同时学有九阴神功+九阳神功，可获得“森罗万象”的特效，免疫敌方暴击",
    "Ｗ  的额外伤害，以及会心一击的额外气攻",
    "Ｄ组合特效1：",
    "Ｗ◇主运九阴神功使用九阴白骨爪必触发九阴神爪极意",
    "Ｗ◇九阴神爪极意：必连击，增加1500点伤害杀气，范围为7*7",
    "Ｗ  (黄衫女与黄赏有连击次数增加，具体看人物天赋)",
    "Ｄ组合特效2：九阴三阴（主运九阴，学有两个额外阴内内功）",
    "Ｗ◇【九阴破体真气】：初始自带9层真气，每道真气增加伤害100点",
    "Ｗ   攻击一次减少一道，30时序恢复一道，20%几率触发必中",
    "Ｗ◇【九阴飞絮劲】：攻击时几率触发13道飞絮劲",
    "Ｗ   1～4道：气攻增加2500点",
    "Ｗ      5～8道：攻击后自身加怒气15点",
    "Ｗ      9～12道：攻击后敌人昏迷状态",
    "Ｗ      13道：以自身现有内力的1/20作为附加伤害",
    "Ｗ◇【螺旋九影】：蓄力必成功且自身集气上升，攻击时以拳系数附加伤害及内伤",
    "Ｗ◇【九阴摄魂】：机率使敌人下回合攻击必定偏移",
    "Ｗ◇【摧坚神爪·无坚不摧】：自身所有攻击增加40%，无视敌人防御50%",
    "Ｗ◇【九阴极阴真气】：修炼者保持阴性内力伤害增加30%",
    "Ｗ◇【九阴奥义·蛇形狸翻】：被攻击后，免疫杀气并打断连击，恢复100点生命",
    "Ｗ◇【天之道】：休息后自身恢复血内体、内伤、中毒，机率清除异常",
    "Ｗ◇攻击必触发封穴、流血、灼烧、冰封",
    "Ｗ◇自身有内伤会根据内伤的5倍效果恢复生命，并时序清空内伤",
    
    
    "Ｎ",
    "Ｄ组合特效：九阴神功 + 九阴白骨爪",
    "Ｗ◇摧坚神爪·五指发劲 攻击敌人时进入蓄力状态",
    "Ｗ◇摧坚神爪·无坚不破 敌人处于封印、点燃、麻痹状态",
    "Ｗ◇摧坚神爪·摧敌首脑 敌人攻击必偏移",
    "Ｗ◇摧坚神爪·如穿腐土 敌人处于混乱、昏迷状态",
    "Ｗ◇攻击根据使用者拳、指双系叠加伤害",
    "Ｗ◇攻击无视敌人50%防御",
    "Ｗ◇以上效果黄裳无条件触发，其他人物学会九阴白骨爪，主运九阴后即可触发",
}

-- 易筋经
ItemInfo[85]={
    "Ｌ习得内功：易筋神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇被攻击时，40%几率触发“易筋真谛”绝对气防",
    "Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
    "Ｗ◇每时序回复1点中毒",
    "Ｗ◇同时学有易筋神功+罗汉伏魔功，攻击时必出“罗汉伏魔”特效",
    "Ｗ *此状态触发的“罗汉伏魔”，且有1.1倍效果",
    "Ｗ◇同时学有易筋神功+金刚不坏体，被攻击必出“金刚不坏”特效",
    "Ｗ◇少林武功威力+200",
    "Ｗ◇每时序回复6点内力值",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇战场三围增加30%",
    "Ｗ◇每时序额外回复1点封穴",
    "Ｗ◇使用罗汉掌，60%几率触发“般若掌”伤害+50",
    "Ｗ◇使用大力金刚掌，40%几率触发“达摩掌”伤害+100",
    "Ｗ◇被攻击有（20+天书数×3）%几率，发动“易筋真气”提升650点气防（可叠加）",
}

-- 降龙十八掌
ItemInfo[86]={
    "Ｌ习得外功：降龙十八掌",
    "Ｎ",
    "Ｗ武功威力：750",
    "Ｗ武功气攻：1500",
    "Ｗ内力消耗：490",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ招式特效：（实际拳掌系数/14，最大25%；拳主和乔峰/10，最大35%）",
    "Ｗ◇双龙取水：攻击两次",
    "Ｗ◇亢龙有悔：无视目标防御30%",
    "Ｗ◇潜龙勿用：行动后自动防御",
    "Ｗ◇震惊百里：对目标造成昏迷",
    "Ｗ◇飞龙在天：下回合速度增加50%",
    "Ｗ◇见龙在田：必中，造成的伤害增加200",
    "Ｗ◇时乘六龙：连击加1",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇盖世无双：需同时修炼降龙十八掌与打狗棒法到极",
    "Ｗ◇盖世无双：被攻击时，有50%几率绝对气防",
    "Ｗ◇降龙十八掌·极意：限拳系主角、萧峰、郭靖、洪七公",
    "Ｗ◇降龙十八掌·极意：攻击范围变成面攻，无误伤，气攻提升至2300",
    "Ｗ◇降龙十八掌·三叠浪：限拳系主角、萧峰，降龙十八掌几率三连击",
    "Ｗ◇降龙十八掌·三叠浪：拳系主角暴怒是几率触发（资质/4+25%）",
    "Ｗ◇降龙十八掌·三叠浪：萧峰几率触发，暴怒必定触发",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇出招式攻击范围变大",                       --飘夜
    "Ｗ◇习得打狗棒法后，再学习降龙十八掌的需求降低40点",
    "Ｗ◇有余不尽：拳系大于200后使用降龙攻击几率触发6连击，暴怒必出",
    "Ｗ◇亢龙有悔：拳系大于200后使用降龙攻击几率是敌人处于昏迷状态，暴怒必出",
}

-- 黯然销魂掌
ItemInfo[87]={
    "Ｌ习得外功：黯然销魂掌",
    "Ｎ",
    "Ｗ武功威力：750",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：490",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ招式特效：（实际拳掌系数/28，最大15%；拳主和杨过/20，最大21%）",
    "Ｗ根据损失生命值额外提升出招概率，最大50%",
    "Ｗ◇行尸走肉：封印敌人攻击能力一回合",
    "Ｗ◇无中生有：自身回合结束后再次行动",
    "Ｗ◇六神不安：敌人集气混乱20时序，行动混乱一回合",
    "Ｗ◇倒行逆施：攻击时敌人按负系数计算",
    "Ｗ◇穷途末路：追加自身损失生命值20%的伤害",
    "Ｗ◇饮恨吞声：下回合敌人攻击时会损失伤害同等的生命",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 须弥山神掌
ItemInfo[88]={
    "Ｌ习得外功：须弥山神掌",
    "Ｎ",
    "Ｗ武功威力：550",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：420",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带灼烧", 
    "Ｗ◇对生命值低于50%的目标概率附加目标最大生命值8%的伤害 对生命值低于10%的目标概率直接斩杀",
}

-- 七伤拳谱
ItemInfo[89]={
    "Ｌ习得外功：七伤拳",
    "Ｎ",
    "Ｗ武功威力：540",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：■ 5+5×5",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇一震七伤:无视敌方气防追加17点内伤",
    "Ｗ◇使用七伤拳攻击，几率触发（暴怒必触发）",
    "Ｗ◇自身内力<5000时，每个目标都会反伤自己内伤+7",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 大力金刚掌
ItemInfo[90]={
    "Ｌ习得外功：大力金刚掌",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇达摩掌：同时修炼易筋神功后，使用大力金刚掌40%几率触发",
    "Ｗ◇达摩掌：提高100伤害",
    "Ｄ组合特效：",
    "Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
    "Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
    "Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带灼烧", 
    "Ｚ一脉相承：",
    "Ｗ◇学会罗汉拳，满足条件可一脉相承大力金刚掌",
}

-- 玄冥神掌
ItemInfo[91]={
    "Ｌ习得外功：玄冥神掌",
    "Ｎ",
    "Ｗ武功威力：550",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇玄冥·极意：主角攻击时有40%几率触发，暴怒必定触发",
    "Ｗ◇玄冥·极意：攻击范围变为面攻，攻击无误伤，并追加1500气攻",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带冰封、中毒（30）",                                --飘夜
    "Ｄ组合特效：",
    "Ｗ◇紫气天罗：同时学有寒冰绵掌+化骨绵掌or玄冥神掌",
    "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
    "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
    "Ｗ◇紫气天罗：寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
}

-- 龙爪手
ItemInfo[92]={
    "Ｌ习得外功：龙爪手",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：米 5格",
    
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高几率流血",                                         --飘夜
    
    "Ｎ",
    "Ｄ组合特效：学有龙爪手，成为星宿派掌门",
    "Ｗ◇1. ：爪影重重：攻击时机率打出大极意范围",
    "Ｗ◇2. ：星宿派的淬毒手效果独立判定触发机率，并可与门派效果叠加。",
    "Ｗ◇3. ：攻击时机率为对手附加「九死毒劲」，此毒有以下效果：",
    "Ｄ◇a. 敌方中毒上限为300",
    "Ｄ◇b. 每攻击一次，毒劲增加一道，并根据毒劲数有以下效果：",
    "Ｗ◇1-3道：机率打空。",
    "Ｗ◇4-6道：打空机率上升，且打空时给自己附加蛊毒、剧毒效果",
    "Ｗ◇7-9道：打空机率不变，但打空时会根据自身中毒量扣减自身血量，并且对全场敌方","Ｗ◇附加剧毒、毒击以及杀气效果。",
    "Ｄ◇c. 插件：",
    "Ｗ◇i. 学有鹰爪功，集气速度恒增加10点。被攻击时有10%机率闪避。",
    "Ｗ◇ii. 学有九阴白骨爪，则机率对敌方附加「撕裂」和等同于中毒值的流血值。",
    "Ｗ◇iii. 三爪齐全并练有化功大法：必定三连击。",
    "Ｗ◇若敌方中毒程度超过100，指系数低于我方时，机率将对方的内力打空并上满中毒。","Ｗ◇若敌方血量低于20%，低机率秒杀。",
    "Ｗ◇4. 必定触发化功大法，并强化上毒效果。    ",
}

-- 葵花宝典
ItemInfo[93]={
    "Ｌ习得内功：葵花神功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇每5时序回复1点体力",
    "Ｗ◇基础集气速度提升20%",
    "Ｗ◇被攻击，30%的几率发动“葵花移形”，降低30%的所受伤害和杀气",
    "Ｗ◇攻击50%机率触发“葵花诀·六合”：给敌增加1~2层减速BUFF", 
    "Ｗ◇每层减敌集气2%，上限10层", 
    "Ｗ◇攻击20%机率触发“葵花刺目”：给敌添加肓目BUFF，20%机率攻击MISS", 
    "Ｗ◇攻击60%机率触发“葵花点穴手”：增加气攻1000必封穴",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇集气速度+3",
    "Ｗ◇体力消耗-2",
    "Ｗ◇习得葵花神功后，辟邪剑法可发挥出真实威力",
    
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇正常人需自宫后方可修炼",
    "Ｗ◇标主剑神可无视条件修炼",
    "Ｗ◇笑傲线打赢葵花尊者后可修炼到葵花奥义【空蝉】：被攻击概率闪现到攻击范围外"
}

-- 幻阴指法
ItemInfo[94]={
    "Ｌ习得外功：幻阴指",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：315",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带冰封、中毒（40）",
}

-- 弹指神通
ItemInfo[95]={
    "Ｌ习得外功：弹指神通",
    "Ｎ",
    "Ｗ武功威力：550",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：米 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
    "Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
    "Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
    "Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
    "Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
    "Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
    "Ｗ◇弹指神通·无影神石：使用弹指神通攻击发动",
    "Ｗ◇弹指神通·无影神石：追加1000气攻，追加高几率流血，提高60%暴击率",
    "Ｗ◇弹指神通·无影神石：黄药师、谢烟客发动时必定暴击",
    "Ｗ◇弹指神通·无影神石：*必须学会桃花绝技",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇高几率封穴",
}

-- 一阳指法
ItemInfo[96]={
    "Ｌ习得外功：一阳指",
    "Ｎ",
    "Ｗ武功威力：560",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：245",
    "Ｗ武功范围：▽ 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇一指破蟾：一阳指可以克制蛤蟆功",
    "Ｗ◇一指破蟾：可以清除对方身上50%蛤蟆功蓄力值",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇六脉神剑招式几率提升至60%",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带灼烧、高封穴",                                         --飘夜
    
    "Ｎ",
    "Ｄ组合特效：六脉神剑 + 一阳指",
    "Ｗ◇少商剑 必冰封，根据攻击者指法系数的33%附加伤害，每次攻击触发内伤25点",
    "Ｗ◇商阳剑 必灼烧，根据被攻击者的2被内伤附加伤害，6倍内伤削减内力",
    "Ｗ◇中冲剑 根据内力和生命值之差附加流血值和伤害，在根据自身最大生命值增加杀气",
    "Ｗ◇关冲剑 根据敌人的冰封、灼烧的6倍总和增加伤害",
    "Ｗ◇少冲剑 攻击翻倍，封印1回合，利刃寒锋10时序",
    "Ｗ◇少泽剑 攻击翻倍，点燃、沉睡1回合",
    "Ｗ◇六脉剑气 攻击时触发全体敌人减6点体力，封穴附加30-50点",
    "Ｗ◇攻击必连击，30%三连击，攻击时敌人的的防御按0计算",
    "Ｗ◇以上效果段誉学会六脉即可触发，其他人物学会六脉、一阳后用六脉攻击时即可触发",
}

-- 太极拳经
ItemInfo[97]={
    "Ｌ习得外功：太极拳",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：十 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇太极奥义：同时修炼太极拳和太极剑法到极",
    "Ｗ◇太极奥义：被攻击时有（资质/4+45）%的几率触发，降低35%所受到的杀气",
    "Ｗ◇太极奥义：触发太极奥义时，有35%的几率触发“太极真义·四两拨千斤”",
    "Ｗ            完全绝对气防",
    "Ｗ◇太空卸劲：同时修炼太极拳和空明拳到极",
    "Ｗ◇太空卸劲：被攻击时35%几率减伤1/3，并降低攻击方行动后的集气位置120",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｚ◇<开太极>",
    "Ｗ◇主运太极神功，使用太极拳法或太极剑法",
    "Ｗ◇蓄力值超过500且暴怒触发",
    "Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",
}

-- 空明拳谱
ItemInfo[98]={
    "Ｌ习得外功：空明拳",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇太空卸劲：同时修炼太极拳和空明拳到极",
    "Ｗ◇太空卸劲：被攻击时35%几率减伤1/3，并降低攻击方行动后的集气位置120",
    "Ｎ",
    "Ｚ特别说明：无",  
    "Ｗ◇增加连击率",
}

-- 天山折梅手
ItemInfo[99]={
    "Ｌ习得外功：天山折梅手",
    "Ｎ",
    "Ｗ武功威力：550",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：▽ 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇天山折梅：天山折梅手修炼到极后，每多一个其他武功到极：",
    "Ｗ◇天山折梅：气攻增加100（对所有人有效，此处有具体提示）",
    "Ｗ◇天山折梅：威力增加50（仅对虚竹/无崖子/天山童姥/李秋水有效）",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 铁掌
ItemInfo[100]={
    "Ｌ习得外功：铁掌",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫",
    "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
    "Ｎ",
    "Ｚ特别说明：", 
    "Ｗ◇强上内伤：使用铁掌攻击，几率触发",
    "Ｗ◇强上内伤：无视对方气防追加12-15点内伤",
}

-- 落英神剑掌
ItemInfo[101]={
    "Ｌ习得外功：落英神剑掌",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：十 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
    "Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
    "Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
    "Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
    "Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
    "Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇高几率封穴",
}

-- 九阴白骨爪
ItemInfo[102]={
    "Ｌ习得外功：九阴白骨爪",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇主运九阴神功使用九阴白骨爪必触发九阴神爪极意",
    "Ｗ◇九阴神爪极意：必连击，增加1500点伤害杀气，范围为7*7",
    "Ｗ  (黄衫女与黄赏有连击次数增加，具体看人物天赋)",
    "Ｚ特别说明：无",
}

-- 百花错拳
ItemInfo[103]={
    "Ｌ习得外功：百花错拳",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：■ 5+7×7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：无",
    "Ｗ◇增加连击率",
}

-- 灵蛇拳
ItemInfo[104]={
    "Ｌ习得外功：灵蛇拳",
    "Ｎ",
    "Ｗ武功威力：250",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带冰封、中毒(10)",
}

-- 天山六阳掌
ItemInfo[105]={
    "Ｌ习得外功：天山六阳掌",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带灼烧",
}

-- 绵掌掌谱
ItemInfo[106]={
    "Ｌ习得外功：绵掌",
    "Ｎ",
    "Ｗ武功威力：200",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：28",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
}

-- 美女拳法
ItemInfo[107]={
    "Ｌ习得外功：美女拳法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：■ 4+7×7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 寒冰绵掌
ItemInfo[108]={
    "Ｌ习得外功：寒冰绵掌",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带冰封、中毒(10)",                                         --飘夜
    "Ｄ组合特效：",
    "Ｗ◇紫气天罗：同时学有寒冰绵掌+化骨绵掌or玄冥神掌",
    "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
    "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
    "Ｗ◇紫气天罗：寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
}

-- 鹰爪功法
ItemInfo[109]={
    "Ｌ习得外功：鹰爪功",
    "Ｎ",
    "Ｗ武功威力：375",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：米 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高几率流血",
}

-- 五毒秘传
ItemInfo[110]={
    "Ｌ习得外功：五毒神掌",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：21",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带冰封、中毒(20)", 
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌or千蛛万毒手/连环腐尸毒/五毒神功",
    "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
    "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

-- 逍遥游
ItemInfo[111]={
    "Ｌ习得轻功：逍遥游",
    "Ｄ主运效果：",
    "Ｗ◇基础：被连击、爆击减伤30%",
    "Ｗ◇进阶：进一步降低连击伤害，当敌方四连或以上则机率闪避，连击越多机率越大",
    "Ｗ◇高阶：包裹里有任意酒时，每15时序喝酒并触发一次以下效果之一：",
    "Ｗ    逍遥醉步 命：十时序的持续回血状态，可与天香续命等效果叠加",
    "Ｗ    逍遥醉步 气：十时序的持续回内状态，可与其他时序回内效果叠加",
    "Ｗ    逍遥醉步 速：到下一次出手前集气速度上升",
    "Ｗ◇触发醉步时，给自己叠加「微醺」状态，攻击伤害上升但低机率打空",
    "Ｗ◇叠加到八层微醺后，再触发逍遥醉步，就会开启「醉八仙」状态，持续三回合",
    "Ｗ◇【醉八仙】拳特系武功伤害大增，被拳、特系攻击必然闪避",
    "Ｗ◇【醉八仙】被其他三系攻击，免疫普通杀气并减伤",
    "Ｗ◇门派：使用物品的效果翻倍。降低逍遥醉步的时序要求",
    "Ｗ◇天轻：被集气速度低于自己的敌人攻击时机率免疫杀气",
    "Ｗ◇特殊人物：",
    "Ｗ    萧峰：【万水千山纵横】所有集气速度低于自己的敌人，被其攻击时受双倍伤害",
    "Ｗ    洪七公：【九指神丐】当偷到的东西是食、药时，立刻享受该药品的效果",
    "Ｗ◇【特殊福利】满足高阶条件，装备酒神秘籍，战斗后增加酿酒的数量",
    "Ｎ",
}

-- 罗汉拳谱
ItemInfo[112]={
    "Ｌ习得外功：罗汉拳",
    "Ｎ",
    "Ｗ武功威力：140",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：米 3格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇般若掌：同时修炼易筋神功，使用罗汉拳60%几率触发",
    "Ｗ◇般若掌：伤害提高50点",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",  
    "Ｚ一脉相承：",
    "Ｗ◇学会罗汉拳，满足条件可一脉相承大力金刚掌",
}

-- 六脉神剑
ItemInfo[113]={
    "Ｌ习得外功：六脉神剑",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：2000",
    "Ｗ内力消耗：700",
    "Ｗ武功范围：《 9格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇剑气碧烟横：使用六脉神剑攻击50%几率触发",
    "Ｗ◇剑气碧烟横：本次攻击敌方的指法系数按50%计算",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇中冲剑,剑逆天光--无视敌方气防 且必破防50%。",
    "Ｗ◇关冲剑,剑煌镜影--增加一次连击 附带灼烧效果。",
    "Ｗ◇少冲剑,南柯万剑--必暴击,且暴击攻击加成提升至200％。",
    "Ｗ◇少泽剑,皇玺剑印--对目标造成随机造成眩晕/虚弱/定身。"  ,
}

-- 独孤九剑
ItemInfo[114]={
    "Ｌ习得外功：独孤九剑",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：1600",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米 7格",
    "Ｗ无视闪避、刺目必造成伤害，自带九层独孤剑气，每道剑气伤害为200，参考九阴破体真气","Ｗ◇并且根据自身实战触发额外伤害",
    "Ｗ奥义·总决式 攻击随机触发1-9级剑气，必封穴、流血、冰封、灼烧，自我恢复状态",
    "Ｗ奥义·破剑式 攻击时造成流血效果，流血不会恢复",
    "Ｗ奥义·破刀式 昏迷、点燃1回合",
    "Ｗ奥义·破枪式 敌人集气速度降低，行动后初始集气降低，我方增加集气",
    "Ｗ奥义·破鞭式 附加扣血伤害，被攻击的2-9格根据内力扣除敌人生命",
    "Ｗ奥义·破索式 对敌人下一回锁足",
    "Ｗ奥义·破掌式 攻击暴怒目标时使敌人怒气减半",
    "Ｗ奥义·破箭式 攻击敌人使其致盲并降低集气追加内伤",
    "Ｗ奥义·破气式 一次性秒掉所有敌人当前所剩内力",
    "Ｗ九剑奥义·破尽天下 每次攻击减掉敌人所有兵器值1点，最低下限为15点",
    "Ｗ以上效果修炼独孤九剑达到500剑系后几率触发，独孤无条件触发",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇九剑真传：华山论剑打败风清扬奖励，需已学会独孤九剑",
    "Ｗ◇九剑真传：用独孤九剑攻击70%几率触发四种招式：",
    "Ｗ◇九剑真传：离剑式：伤害不随距离递减",
    "Ｗ◇九剑真传：倒剑式：敌方集气强制倒退200点",
    "Ｗ◇九剑真传：撩剑式：伤害提高30%",
    "Ｗ◇九剑真传：荡剑式：攻击后回气+200点",
    "Ｗ◇九剑真传：被攻击时，有70%几率减伤20%，并降低攻击方下回合集气位置200",
    "Ｗ◇剑胆琴心：同时修炼独孤九剑和持瑶琴到极",
    "Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
    "Ｗ            *持续整场战斗有效，系数加成后的总和不会超过320",
    "Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",                                         --飘夜
    "Ｗ◇习得持瑶琴后，再学习独孤九剑的需求降低40点",
}

-- 太极剑法
ItemInfo[115]={
    "Ｌ习得外功：太极剑法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：280",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇太极奥义：同时修炼太极拳和太极剑法到极",
    "Ｗ◇太极奥义：被攻击时有（资质/4+45）%的几率触发，降低35%所受到的杀气",
    "Ｗ◇太极奥义：触发太极奥义时，有35%的几率触发“太极真义·四两拨千斤”",
    "Ｗ            完全绝对气防",
    "Ｗ◇以柔克刚：同时修炼柔云剑法和太极剑法到极",
    "Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",
    "Ｎ",
    "Ｚ组合特效：",
    "Ｚ◇<开太极>",
    "Ｗ◇主运太极神功，使用太极拳法或太极剑法",
    "Ｗ◇蓄力值超过500且暴怒触发",
    "Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",
    "Ｗ◇触发将消耗自己10%当前体力值+10%当前内力值",
}

-- 玄铁剑法
ItemInfo[116]={
    "Ｌ习得外功：玄铁剑法",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：1500",
    "Ｗ内力消耗：420",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ重剑真传：",
    "Ｗ◇玄铁极意：剑主、杨过有概率加成，基础20%概率(暴怒概率翻倍)攻击范围变为面攻，气攻1800",
    "Ｗ◇重剑真传·浪如山涌剑如虹：暴怒触发大范围伤害",
    "Ｎ",
    "Ｚ重剑无锋：",                                        --飘夜
    "Ｗ◇重剑无锋·破尽天下：需装备玄铁剑才能触发",
    "Ｗ◇重剑无锋·破尽天下：无视一切必定破气防，且追加1000气攻",
    "Ｗ◇重剑无锋·破尽天下：暴击概率为40+装备等级*10",
    
    "Ｎ",   
    "Ｄ组合效果：怒涛海潮功 + 玄铁剑法",
    "Ｗ◇玄铁重剑·逆挑 根据敌我内力值之差进行杀气，并附加20点内伤",
    "Ｗ◇玄铁重剑·顺刺 根据敌我内力值之差来增加伤害",
    "Ｗ◇玄铁重剑·横削 根据敌方内力和我方御剑能力之和来杀内",
    "Ｗ◇玄铁重剑·倒劈 -强制杀气500点",
    "Ｗ◇重剑奥义·一力降十会 主运怒涛后使用玄铁剑攻击强制减去被攻击者生命、","Ｗ◇内力、攻击力、防御力、轻功的上限值",
    "Ｗ◇真·重剑无锋 大巧不工 攻击时触发9*9范围攻击，暴击大幅度增加，无视敌","Ｗ◇人一半的防御，根据自身剑系、内力增加伤害，伤害加倍，强制封穴10点，且敌","Ｗ◇人处于锁足状态",
}

-- 苗家剑法
ItemInfo[117]={
    "Ｌ习得外功：苗家剑法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：《 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法到极，",
    "Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
    "Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇习得胡家刀法后，再学习苗家剑法的需求降低40点"
}

-- 斗转星移
ItemInfo[118]={
    "Ｌ习得秘技：斗转星移",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇斗转星移无法主动攻击，但受到攻击（资质-30）几率以同样的武功反击回去",
    "Ｗ◇北斗移辰：总兵器值<240，以50%的威力斗转反击",
    "Ｗ◇斗转星移：240≤总兵器值<360，以60%的威力斗转反击",
    "Ｗ◇离合参商：360≤总兵器值<520，以70%的威力斗转反击",
    "Ｗ◇幻梦星辰：总兵器值≥520，以80%的威力斗转反击",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇30%几率转移攻击于敌人",
    "Ｎ",
    "Ｚ特别说明：",    
    "Ｗ◇需资质大于79",                                  --飘夜
    "Ｎ",
    "Ｄ进阶方式：限定天邪，获得天龙天书，队伍中有慕容复，对话扫地僧书架，战胜扫地",
    
    "Ｎ",
    "Ｄ组合效果：斗转星移 + 参合指",
    "Ｗ◇慕·玄指为先 敌全体减集气200点，附加30-50点流血值，流血值附加内伤",
    "Ｗ◇容·混气柔刚 以自身指法系数的50%附加伤害",
    "Ｗ◇参·海运洞显 以自身现有内力值的1.5倍量削减敌内力值，伤害增加1.5倍",
    "Ｗ◇合·日月济世 以自身30%最大内力值附加伤害",
    "Ｗ◇以上效果慕容博学会参合指后即可触发，其他人物主运斗转即可触发",
}

-- 玉女剑法
ItemInfo[119]={
    "Ｌ习得外功：玉女剑法",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：280",
    "Ｗ武功范围：《 5格",
    "Ｎ",
    "Ｄ组合特效：双剑合璧",
    "Ｗ同时学会武功全真剑法、玉女剑法、左右互搏",
    "Ｗ连击率+30%",
    "Ｗ使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
    "Ｗ防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
    "Ｗ使用玉女剑/全真剑法攻击范围+1",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",
}

-- 倚天剑谱
ItemInfo[120]={
    "Ｌ习得外功：倚天剑法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带灼烧",
}

-- 金蛇剑法
ItemInfo[121]={
    "Ｌ习得外功：金蛇剑法",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：米 6格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带灼烧",
}

-- 七星剑谱
ItemInfo[122]={
    "Ｌ习得外功：全真剑法",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：双剑合璧",
    "Ｗ同时学会武功全真剑法、玉女剑法、左右互搏",
    "Ｗ连击率+30%",
    "Ｗ使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
    "Ｗ防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
    "Ｗ使用玉女剑/全真剑法攻击范围+1",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    
    "Ｎ",
    "Ｄ组合效果：全真剑法 + 先天功",
    "Ｗ◇全真剑气 自带7道全真剑气，每道剑气伤害300，杀气1250点，40时序恢复1道",
    "Ｗ◇全真剑法·明河共影 自身剑系1/3为附加伤害，点燃状态",
    "Ｗ◇全真剑法·兰烬蕉暗 敌方剑系1/3为附加伤害，昏迷状态",
    "Ｗ◇全真剑法·胡霜千里 以自身所剩余内力的1/30为附加伤害，封印状态",
    "Ｗ◇以上效果王重阳学会全真剑法即可触发，其他人物主运先天功即可触发",
}

-- 玉箫剑法
ItemInfo[123]={
    "Ｌ习得外功：玉箫剑法",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：《 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
    "Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
    "Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
    "Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
    "Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
    "Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 两仪剑谱
ItemInfo[124]={
    "Ｌ习得外功：两仪剑法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇两仪守护：同时练有两仪剑法和反两仪刀法到极，",
    "Ｗ◇两仪守护：被攻击时50%几率减伤32点，并降低地方320气攻",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
}

-- 柔云剑谱
ItemInfo[125]={
    "Ｌ习得外功：柔云剑法",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇以柔克刚：同时修炼柔云剑法和太极剑法到极",
    "Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 雪山剑谱
ItemInfo[126]={
    "Ｌ习得外功：雪山剑法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：49",
    "Ｗ武功范围：米 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带冰封",            
    "Ｗ◇天外连击时随机增加0.5-3倍原武功威力",
}

-- 太岳三青峰
ItemInfo[127]={
    "Ｌ习得外功：太岳三青峰",
    "Ｎ",
    "Ｗ武功威力：200",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：49",
    "Ｗ武功范围：《 6",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
    "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
    "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
    "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
    "Ｗ◇五岳剑法：暴怒必定发动",
    "Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
}

-- 万岳朝宗
ItemInfo[128]={
    "Ｌ习得外功：万岳朝宗",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：《 6",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
    "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
    "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
    "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
    "Ｗ◇五岳剑法：暴怒必定发动",
    "Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高暴击",
    "Ｗ◇附带冰封",
}

-- 云雾十三式
ItemInfo[129]={
    "Ｌ习得外功：云雾十三式",
    "Ｎ",
    "Ｗ武功威力：250",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：《 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
    "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
    "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
    "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
    "Ｗ◇五岳剑法：暴怒必定发动",
    "Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 泰山十八盘
ItemInfo[130]={
    "Ｌ习得外功：泰山十八盘",
    "Ｎ",
    "Ｗ武功威力：250",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：米 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
    "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
    "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
    "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
    "Ｗ◇五岳剑法：暴怒必定发动",
    "Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",
}

-- 万花剑法
ItemInfo[131]={
    "Ｌ习得外功：万花剑法",
    "Ｎ",
    "Ｗ武功威力：200",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：■ 6+7×7",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
    "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
    "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
    "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
    "Ｗ◇五岳剑法：暴怒必定发动",
    "Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 三分剑术
ItemInfo[132]={
    "Ｌ习得外功：三分剑法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇素质三连：同时修炼三分剑法/连城剑法",
    "Ｗ◇素质三连：暴怒时使用剑法必定三连击",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
}

-- 雷震剑法
ItemInfo[133]={
    "Ｌ习得外功：雷震剑法",
    "Ｎ",
    "Ｗ武功威力：110",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：《 6格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高暴击",
}

-- 松风剑法
ItemInfo[134]={
    "Ｌ习得外功：松风剑法",
    "Ｎ",
    "Ｗ武功威力：140",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：4",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 火焰刀法
ItemInfo[135]={
    "Ｌ习得外功：火焰刀法",
    "Ｎ",
    "Ｗ武功威力：650",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：△ 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
    "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
    "Ｗ            *引燃状态下，每时序损失2%当前血量",
    "Ｎ",
    "Ｚ特别说明：",                                        --飘夜
    "Ｗ◇大轮密宗·火焰刀：使用火焰刀法攻击30%几率触发（鸠摩智100%触发）",
    "Ｗ◇大轮密宗·火焰刀：全场敌方受到内伤30点，且追加1000气攻",
    "Ｗ◇大轮密宗·火焰刀：*刀主有二次判定",
    "Ｗ◇附带灼烧",
    
    "Ｎ",
    "Ｚ组合特效：龙象般若功 + 火焰刀法",
    "Ｗ◇火焰刀·凝集 强制杀气200或500点不等，并强制封穴30或60点不等",
    "Ｗ◇火焰刀·虚无缥缈 根据自身内力值和最大内力值总和强制杀气",
    "Ｗ◇火焰刀·虚劲伤人 攻击后出会触发9*9范围伤害，敌人处于锁足状态",
    "Ｗ◇ 以上效果必须主运龙象般若功",
    
    "Ｎ",
    "Ｄ组合特效：小无相功 + 火焰刀法",
    "Ｗ◇根据资质触发火焰刀气，每道火焰刀伤害100",
    "Ｗ◇攻击敌人后会给敌人种下火焰刀气劲，效果同龙象气劲",
    "Ｗ◇以上效果无需主运小无相功，学会小无相功即可",
}

-- 胡家刀法
ItemInfo[136]={
    "Ｌ习得外功：胡家刀法",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：井 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法到极，",
    "Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
    "Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
    "Ｗ◇胡刀刀法·极意：限主角与胡斐胡一刀，用胡家刀法攻击时几率触发",
    "Ｗ◇胡刀刀法·极意：攻击无误伤，攻击范围变为9*9，气攻提升至1500",
    "Ｗ◇胡刀刀法·极意：暴怒时必触发",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇习得苗家剑法后，再学习胡家刀法的需求降低40点"
}

-- 燃木刀法
ItemInfo[137]={
    "Ｌ习得外功：燃木刀法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：175",
    "Ｗ武功范围：△ 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
    "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
    "Ｗ            *引燃状态下，每时序损失2%当前血量",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇据当前加力内功提升攻击效果",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带灼烧",
}

-- 玄虚刀法
ItemInfo[138]={
    "Ｌ习得外功：玄虚刀法",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：175",
    "Ｗ武功范围：井 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇炼神还虚：同时修炼神门十三剑/玄虚刀法",
    "Ｗ◇炼神还虚：玄虚刀法必封穴，神门十三剑必冰封灼烧",
    "Ｗ◇炼神还虚：受到攻击30%几率使用双倍内力抵消一半伤害",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 血刀经
ItemInfo[139]={
    "Ｌ习得外功：血刀刀法",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：井 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：", 
    "Ｗ◇修炼后生命上限降低200",
}

-- 夫妻刀法
ItemInfo[140]={
    "Ｌ习得外功：夫妻刀法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：△ 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇天衣无缝：同时修炼鸳鸯刀法和夫妻刀法到极",
    "Ｗ◇天衣无缝：使用任意刀系武功增加30%连击率",
    "Ｎ",
    "Ｚ特别说明：无",                                        --飘夜
    "Ｗ◇连击时伤害、气攻不会减少",
    "Ｎ",
    "Ｄ组合效果：冰火阴阳诀 + 夫妻刀法",
    "Ｗ◇女貌郎才珠万斛 天教艳质为眷属 破气防、无视敌人20%防御",
    "Ｗ◇清风引佩下瑶台 明月照妆成金屋 必冰封、根据敌人刀系的1/2恢复生命、内力",
    "Ｗ◇刀光掩映孔雀屏 喜结丝萝在乔木 必灼烧、根据自身刀系的1/3增加伤害和削减内力",
    "Ｗ◇英雄无双风流婿 却扇洞房燃花烛 额外攻击加200，每次攻击附加5点内伤值","Ｗ◇如果内伤大于50点触发昏迷状态",
    "Ｗ◇碧箫声里双鸣凤 今朝有女颜如玉 额外攻击加200，敌人身上流血值大于50点触发点燃效果",
    "Ｗ◇千金一刻庆良宵 占断人间天上福 根据敌我攻击力总和的1/6增加伤害",
    "Ｗ◇以上效果学会冰火阴阳诀、夫妻刀法后即可触发效果，无需主运",
}

-- 金乌刀法
ItemInfo[141]={
    "Ｌ习得外功：金乌刀法",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：△ 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
    "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
    "Ｗ            *引燃状态下，每时序损失2%当前血量",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带灼烧",
    
    "Ｎ",
    "Ｄ组合效果：太玄神功 + 金乌刀法",
    "Ｗ◇烈阳·开门揖盗 以自身所剩余内力的1/3增加杀气",
    "Ｗ◇烈阳·梅雪逢夏 蓄力攻击时伤害提升100%",
    "Ｗ◇烈阳·千钧压驼 追加杀气300点",
    "Ｗ◇烈阳·大海沉沙 以自身内力值的35%附加伤害，敌人处于流血状态",
    "Ｗ◇烈阳·赤日炎炎 以自身刀系的1/3附加伤害，根据敌人攻击力削减内力","Ｗ◇并附加15点内伤值，当敌人内伤值达到100点后直接按150点计算",
    "Ｗ◇金乌烈阳 攻击时几率自身进入蓄力状态",
    "Ｗ◇以上效果石破天学会金乌刀法即可触发，其他人物学会太玄、金乌后主运太玄即可触发效果",
}

-- 反两仪刀法
ItemInfo[142]={
    "Ｌ习得外功：反两仪刀法",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：井 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇两仪守护：同时练有两仪剑法和反两仪刀法到极，",
    "Ｗ◇两仪守护：被攻击时50%几率减伤32点，并降低地方320气攻",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",
}

-- 五虎断门刀
ItemInfo[143]={
    "Ｌ习得外功：五虎断门刀",
    "Ｎ",
    "Ｗ武功威力：250",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：井 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇五虎闹东京：同时修炼五虎断门刀和五虎棍法",
    "Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
    "Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
    "Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
    "Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
    "Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高暴击",
}
    
-- 飞狐外传
ItemInfo[144]={
    "Ｌ物品说明：十四天书之一",  
}

-- 雪山飞狐
ItemInfo[145]={
    "Ｌ物品说明：十四天书之一",    
}

-- 连城诀
ItemInfo[146]={
    "Ｌ物品说明：十四天书之一",  
}

-- 天龙八部
ItemInfo[147]={
    "Ｌ物品说明：十四天书之一",  
}

-- 射雕英雄传
ItemInfo[148]={
    "Ｌ物品说明：十四天书之一",  
}

-- 白马啸西风
ItemInfo[149]={
    "Ｌ物品说明：十四天书之一",  
}

-- 鹿鼎记
ItemInfo[150]={
    "Ｌ物品说明：十四天书之一",  
}

-- 笑傲江湖
ItemInfo[151]={
    "Ｌ物品说明：十四天书之一",  
}

-- 书剑恩仇录
ItemInfo[152]={
    "Ｌ物品说明：十四天书之一",  
}

-- 神雕侠侣
ItemInfo[153]={
    "Ｌ物品说明：十四天书之一",  
}

-- 侠客行
ItemInfo[154]={
    "Ｌ物品说明：十四天书之一",  
}

-- 倚天屠龙记
ItemInfo[155]={
    "Ｌ物品说明：十四天书之一",  
}

-- 碧血剑
ItemInfo[156]={
    "Ｌ物品说明：十四天书之一",  
}

-- 鸳鸯刀
ItemInfo[157]={
    "Ｌ物品说明：十四天书之一",  
}

-- 修罗刀谱
ItemInfo[158]={
    "Ｌ习得外功：修罗刀",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：△ 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀到极",
    "Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
    "Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高暴击",
    "Ｗ◇附带冰封" ,                                        --飘夜
    
    "Ｎ",
    "Ｄ组合效果：修罗刀法 + 紫霞神功",
    "Ｗ◇集气速度增加10点",
    "Ｗ◇根据怒气值来增加杀气量",
    "Ｗ◇根据怒气值来提升伤害，攻击人物越多怒气越高，闪避或者不","Ｗ◇破防的情况下无法增加怒气",
    "Ｗ◇根据自身最大生命值和所剩生命值总和的1/20来增加伤害",
    "Ｗ◇所有人物学会紫霞、修罗刀法后即可触发效果，无需主运",
}

-- 奇门三才刀
ItemInfo[159]={
    "Ｌ习得外功：奇门三才刀",
    "Ｎ",
    "Ｗ武功威力：200",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：井 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
}

-- 慈悲刀法
ItemInfo[160]={
    "Ｌ习得外功：慈悲刀法",
    "Ｎ",
    "Ｗ武功威力：200",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：△ 7格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇慈悲为怀：同时修炼慈悲刀法和大慈大悲手",
    "Ｗ◇慈悲为怀：道德高于60时，如果伤害大于120减伤（道德-60）点",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
}

-- 狂风刀法
ItemInfo[161]={
    "Ｌ习得外功：狂风刀法",
    "Ｎ",
    "Ｗ武功威力：250",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：21",
    "Ｗ武功范围：米 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇你是风儿我是沙：同时修炼狂风刀法和黄沙万里鞭到极",
    "Ｗ◇你是风儿我是沙：使用狂风刀法/黄沙万里鞭必双击，伤害提升30%",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",                                         --飘夜
    
    "Ｎ",
    "Ｄ组合效果：混元功 + 狂风刀法",
    "Ｗ◇狂风刀法·风雨交加 攻击触发6*6范围攻击，气功加1000点，在根据自身刀系的3被附加杀气",
    "Ｗ◇狂风刀法·斩 攻击破防，根据敌我内力差来增加杀气量，额外增加内伤20点","Ｗ◇流血20时序，如果流血值超过30点以50点计算",
    "Ｗ◇狂风刀法·破 根据自身内力来增加杀气",
    "Ｗ◇攻击根据这身刀系的1/30增加伤害",
    "Ｗ◇每次攻击附加内伤20，生命减75，内力减100，体力减1",
    "Ｗ◇田伯光学会狂风刀法后即可触发效果，其他人物学会狂风刀、混元功后即可触发效果",
}

-- 鸳鸯刀法
ItemInfo[162]={
    "Ｌ习得外功：鸳鸯刀法",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：21",
    "Ｗ武功范围：井 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇天衣无缝：同时修炼鸳鸯刀法和夫妻刀法到极",
    "Ｗ◇天衣无缝：使用任意刀系武功增加30%连击率",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",
}

-- 南山刀谱
ItemInfo[163]={
    "Ｌ习得外功：南山刀法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：△ 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 鬼头刀法
ItemInfo[164]={
    "Ｌ习得外功：鬼头刀法",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：井 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 万劫刀法
ItemInfo[165]={
    "Ｌ习得外功：万劫刀法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：△ 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：无", 
}

-- 柴刀十八路
ItemInfo[166]={
    "Ｌ习得外功：柴刀十八路",
    "Ｎ",
    "Ｗ武功威力：140",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：井 6格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 打狗棒法
ItemInfo[167]={
    "Ｌ习得外功：打狗棒法",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：1400",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：米 3格",
    "Ｎ",
    "Ｄ招式特效：（实际奇门系数/14，最大25%；奇门主和洪七/10，最大35%）",
    "Ｗ◇绊字决：造成锁足",
    "Ｗ◇封字决：敌方下回合无法攻击",
    "Ｗ◇转字决：连击加1",
    "Ｗ◇缠字决：造成迟缓20时序",
    "Ｗ◇挑字决：无视敌方30%防御",
    "Ｗ◇戳字决：必定封穴，封穴+10，40%概率造成刺目",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇盖世无双：需同时修炼降龙十八掌与打狗棒法到极",
    "Ｗ◇盖世无双：被攻击时，有50%几率绝对气防",
    "Ｗ◇天下无狗：使用打狗棒法40%几率发动，暴怒必定发动",
    "Ｗ◇天下无狗：攻击无误伤，攻击范围变为面攻，气攻提升至2400",
    
    
    "Ｎ",
    "Ｄ组合效果：擒龙功 + 打狗棒法",
    "Ｗ◇打狗棒法·挑字诀：强制封穴10点",
    "Ｗ◇打狗棒法·封字诀：伤害倍增，额外增加杀气值，根据敌方所剩体力值附加内伤值",
    "Ｗ◇打狗棒法·戳字诀：被攻击后敌人处于刺目状态",
    "Ｗ◇打狗棒法·引字诀：强制杀气150点，300点，450点",
    "Ｗ◇打狗棒法·绊字诀：被攻击后敌人处于锁足状态",
    "Ｗ◇劈字诀·天下无狗：空挥敌全体生命-80，内力-100，可直接致死",
    "Ｗ◇以上效果必须主运擒龙功",
    
    "Ｎ",
    "Ｚ特别说明：无",                      --飘夜
    "Ｗ◇习得降龙十八掌后，再学习打狗棒法的需求降低40点",
}

-- 伏魔杖法
ItemInfo[168]={
    "Ｌ习得外功：伏魔杖法",
    "Ｎ",
    "Ｗ武功威力：550",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：田 5格",
    "Ｎ",
    "Ｄ世尊降魔(组合特效)：",
    "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
    "Ｗ◇效果：暴击率增加50%",
    "Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
    "Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
    "Ｚ特别说明：无",
}

-- 倚天屠龙功
ItemInfo[169]={
    "Ｌ习得外功：倚天屠龙功",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：63",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
    "Ｗ◇琴棋书画·秉笔直书：攻击必定造成封穴，",
    "Ｗ◇琴棋书画·秉笔直书：且伤害提升20%几率发动",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 无上大力杵
ItemInfo[170]={
    "Ｌ习得外功：无上大力杵",
    "Ｎ",
    "Ｗ武功威力：550",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：■ 5+5×5",
    "Ｎ",
    "Ｄ世尊降魔(组合特效)：",
    "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
    "Ｗ◇效果：暴击率增加50%",
    "Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
    "Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
    "Ｎ",
    "Ｚ特别说明：", 
    "Ｗ◇附带灼烧",
}

-- 金刚伏魔圈
ItemInfo[171]={
    "Ｌ习得外功：金刚伏魔圈",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：56",
    "Ｗ武功范围：田 3格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇金刚伏魔阵：战场上队伍里同时修炼金刚伏魔圈2人以上",
    "Ｗ◇金刚伏魔圈护体：2人，提升15%防御且气防+500",
    "Ｗ◇真·金刚伏魔圈护体：2+人，提升30%防御且气防+1000",
    "Ｎ",
    "Ｄ世尊降魔(组合特效)：",
    "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
    "Ｗ◇效果：暴击率增加50%",
    "Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
    "Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带灼烧",
}

-- 妙笔丹青
ItemInfo[172]={
    "Ｌ习得外功：妙笔丹青",
    "Ｎ",
    "Ｗ武功威力：444",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：56",
    "Ｗ武功范围：◇ 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
    "Ｗ◇琴棋书画·画地为牢：使妙笔丹青攻击附带冰封，高几率发动",
    "Ｗ◇琴棋书画·江山如画：大幅提升妙笔丹青冰封效果，几率发动",
    "Ｎ",
    "Ｚ特别说明：无" 
}

-- 黄沙万里鞭
ItemInfo[173]={
    "Ｌ习得外功：黄沙万里鞭",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：49",
    "Ｗ武功范围：田 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇你是风儿我是沙：同时修炼狂风刀法和黄沙万里鞭到极",
    "Ｗ◇你是风儿我是沙：狂风刀法/黄沙万里鞭必双击，伤害提升30%",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带灼烧",
}

-- 银两
ItemInfo[174]={
    "Ｌ物品说明：有钱能使鬼推磨", 
}

-- 银索金铃
ItemInfo[175]={
    "Ｌ习得外功：银铃金锁",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：49",
    "Ｗ武功范围：■ 4+5×5",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率", 
    "Ｚ组合：",
    "Ｗ◇学会海叟钓法和银铃金锁。",                                      
    "Ｗ◇自身范围内一格15%概率不受到伤害。",
}

-- 阴阳倒乱刃
ItemInfo[176]={
    "Ｌ习得外功：阴阳倒乱刃",
    "Ｎ",
    "Ｗ武功威力：450",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：36",
    "Ｗ武功范围：◇ 3格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
}

-- 渔叟钓法
ItemInfo[177]={
    "Ｌ习得外功：海叟钓法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：42",
    "Ｗ武功范围：田 6格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",  
    "Ｚ组合：",
    "Ｗ◇学会海叟钓法和银铃金锁。",                                      
    "Ｗ◇自身范围内一格15%概率不受到伤害。",
}

-- 大剪刀刀法
ItemInfo[178]={
    "Ｌ习得外功：大剪刀",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：0",
    "Ｗ武功范围：田 3格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高暴击",
}

-- 鹤蛇八打
ItemInfo[179]={
    "Ｌ习得外功：鹤蛇八打",
    "Ｎ",
    "Ｗ武功威力：250",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带冰封、中毒（20）",
}

-- 持瑶琴
ItemInfo[180]={
    "Ｌ习得外功：持瑶琴",
    "Ｎ",
    "Ｗ武功威力：333",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：28",
    "Ｗ武功范围：■ 5+9×9",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
    "Ｗ◇琴棋书画·琴音悦耳：攻击不造成怒气，100%发动",
    "Ｗ◇琴棋书画·菩提清心：使敌方怒气减半，几率发动",
    "Ｗ◇剑胆琴心：同时修炼独孤九剑和持瑶琴到极",
    "Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
    "Ｗ            *持续整场战斗有效，系数加成后的总和不会超过320",
    "Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",
    "Ｎ",
    "Ｚ特别说明：",                                         --飘夜
    "Ｗ◇习得独孤九剑后，再学习持瑶琴的需求降低40点"
}

-- 棋盘招式
ItemInfo[181]={
    "Ｌ习得外功：棋盘招式",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：28",
    "Ｗ武功范围：田 3格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
    "Ｗ◇琴棋书画·棋高一着：追加1200气攻，100%发动",
    "Ｗ◇琴棋书画·星罗棋布：额外提升1000气攻，几率发动",
    "Ｎ",
    "Ｚ特别说明：无",
}

-- 罗盘
ItemInfo[182]={
    "Ｌ物品说明：显示坐标", 
}

-- 裴将军帖
ItemInfo[183]={
    "Ｌ习得外功：裴将军帖",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：米 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带冰封",
}

-- 中平枪法
ItemInfo[184]={
    "Ｌ习得外功：中平枪法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：田 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇高连击",
    "Ｗ◇附带灼烧",
}

-- 毒龙鞭法
ItemInfo[185]={
    "Ｌ习得外功：毒龙鞭法",
    "Ｎ",
    "Ｗ武功威力：150",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇附带冰封、中毒（10）",
}

-- 杨家枪
ItemInfo[186]={
    "Ｌ习得外功：杨家枪法",
    "Ｎ",
    "Ｗ武功威力：140",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：田 6格",
    "Ｎ",
    "Ｚ特别说明：",                      
    "Ｚ一脉相承：",
    "Ｗ◇学会杨家枪法，满足条件可一脉相承岳家枪法",      
    "Ｗ◇增加暴连击率",
}

-- 子午针灸经
ItemInfo[187]={
    "Ｌ消耗药材获得药品：九转熊蛇丸",
}

-- 华佗内昭图
ItemInfo[188]={
    "Ｌ消耗药材获得药品：无常丹、九花玉露丸",
}

-- 胡青牛医书
ItemInfo[189]={
    "Ｌ消耗药材获得药品：黑玉断续膏",
}

-- 千金方
ItemInfo[190]={
    "Ｌ消耗药材获得药品：小还丹、白云熊胆丸",
}

-- 黄帝内经
ItemInfo[191]={
    "Ｌ消耗药材获得药品：天香续命膏、田七鲨胆散", 
}

-- 毒经
ItemInfo[192]={
    "Ｌ消耗药材获得药品：无",
}

-- 药王神篇
ItemInfo[193]={
    "Ｌ消耗药材获得药品：黄连解毒丸、牛黄血竭丹、六阳正气丹",
}

-- 翡翠杯
ItemInfo[194]={
    "Ｌ物品说明：喝酒的杯子",
}

-- 铁铲
ItemInfo[195]={
    "Ｌ物品说明：用于挖土",
}

-- 大燕传国玉玺
ItemInfo[196]={
    "Ｌ物品说明：大燕传国玉玺",
}

-- 大燕皇帝世系谱表
ItemInfo[197]={
    "Ｌ物品说明：大燕皇帝世系谱表",
}

-- 赏善罚恶令
ItemInfo[198]={
    "Ｌ物品说明：得此令者，请赴侠客岛",
}

-- 两页刀法
ItemInfo[199]={
    "Ｌ物品说明：胡家刀法中的两页纸",
}

-- 七宝指环
ItemInfo[200]={
    "Ｌ物品说明：逍遥派掌门信物", 
    "Ｇ装备效果；逍遥派武功威力+100",
    
    "Ｄ装备等级：",
    "Ｗ◇LV.1：逍遥派武学时，50%概率追加封穴5点",
    "Ｗ◇LV.2：逍遥派武学时，60%概率追加封穴5点",
    "Ｗ◇LV.3：逍遥派武学时，70%概率追加封穴5点",
    "Ｗ◇LV.4：逍遥派武学时，80%概率追加封穴5点",
    "Ｗ◇LV.5：逍遥派武学时，90%概率追加封穴5点",
    "Ｗ◇LV.6（MAX）：必封穴，并50%发动“七宝琉璃”", 
    "Ｄ【七宝琉璃】：",
    "Ｗ◇减少敌方气防值50%",
}

-- 断肠草
ItemInfo[201]={
    "Ｌ物品说明：有剧毒",
}

-- 闯王军刀
ItemInfo[202]={
    "Ｇ装备效果；胡家刀法威力+100",
    "Ｎ",
    "Ｄ装备等级：无",
}

-- 玄冰碧火酒
ItemInfo[203]={
    "Ｌ物品说明：内力中和的药酒",
}

-- 苗人凤眼毒解药
ItemInfo[204]={
    "Ｌ物品说明：苗人凤眼毒解药",
}

-- 神杖
ItemInfo[205]={
    "Ｌ物品说明：武林盟主之杖",
}

-- 唐诗选集
ItemInfo[206]={
    "Ｌ物品说明：唐诗选集",
}

-- 七心海棠
ItemInfo[207]={
    "Ｌ物品说明：剧毒之物",
}

-- 信
ItemInfo[208]={
    "Ｌ物品说明：只是一封信",
}

-- 药材
ItemInfo[209]={
    "Ｌ物品说明：用于炼药",
}

-- 食材
ItemInfo[210]={
    "Ｌ物品说明：用于做饭或酿酒",
}

-- 一撮金毛
ItemInfo[211]={
    "Ｌ物品说明：金毛狮王谢逊的头发",
}

-- 广陵散琴曲
ItemInfo[212]={
    "Ｌ物品说明：失传已久的琴谱",
}

-- 刘仲甫呕血棋谱
ItemInfo[213]={
    "Ｌ物品说明：失传已久的棋谱",
}

-- 张旭率意帖
ItemInfo[214]={
    "Ｌ物品说明：草圣张旭的字帖",
}

-- 溪山行旅图
ItemInfo[215]={
    "Ｌ物品说明：北宋名画",
}

-- 带头大哥书信
ItemInfo[216]={
    "Ｌ物品说明：信中记载了乔峰的身世",
}

-- 鸳刀
ItemInfo[217]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：使用夫妻刀法时，必定连击",
    "Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
    "Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",
}

-- 鸯刀
ItemInfo[218]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：使用夫妻刀法时，必定连击",
    "Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
    "Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",
}

-- 一颗头颅
ItemInfo[219]={
    "Ｌ物品说明：成昆的项上人头",
}

-- 食神秘籍
ItemInfo[220]={
    "Ｌ消耗食材获得食物：叫花鸡、好逑汤、玉笛谁家听落梅、腊八粥",  
    "Ｎ",
    "Ｗ◇萧中慧、黄蓉修炼必得：玉笛谁家听落梅（15食材）",
    "Ｗ◇人厨子修炼必得：腊八粥（25食材）",
}

-- 酒神秘籍
ItemInfo[221]={
    "Ｌ消耗食材获得酒：梨花酒、玉露酒、即墨老酒",
}

-- 韦陀棍法
ItemInfo[222]={
    "Ｌ习得武功：韦陀棍法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 普渡杖法
ItemInfo[223]={
    "Ｌ习得武功：普渡杖法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 手帕
ItemInfo[224]={
    "Ｌ物品说明：（80,212）",
}

-- 闯王藏宝图
ItemInfo[225]={
    "Ｌ物品说明：（64,51）",
}

-- 闯王藏宝图
ItemInfo[226]={
    "Ｌ物品说明：（24,16）",
}

-- 闯王藏宝图
ItemInfo[227]={
    "Ｌ物品说明：（45,34）",
}

-- 半部四十二章经
ItemInfo[228]={
    "Ｌ物品说明：还需要另外半部",
}

-- 四十二章经
ItemInfo[229]={
    "Ｌ物品说明：藏有满清龙脉的秘密",
}

-- 白马
ItemInfo[230]={
    "Ｇ装备效果；无",
    "Ｎ",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：集气速度增加2点",
    "Ｗ◇LV.3：集气速度增加3点",
    "Ｗ◇LV.5：集气速度增加4点",
}

-- 火蟾
ItemInfo[231]={
    "Ｌ物品说明：具有抵抗寒毒的功效",
}

-- 太白三英的书信
ItemInfo[232]={
    "Ｌ物品说明：太白三英通敌卖国的证据",
}

-- 金娃娃
ItemInfo[233]={
    "Ｌ物品说明：金色的娃娃鱼",
}

-- 介绍信
ItemInfo[234]={
    "Ｌ物品说明：南贤给的介绍信",
}

-- 左右互搏之术
ItemInfo[235]={
    "Ｌ习得奇术：左右互搏术",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇左右互搏几率：（71-资质）%",
    "Ｎ",
    "Ｚ特别说明：",                                         --飘夜
    "Ｗ◇需资质低于31",
}

-- 真武剑
ItemInfo[239]={
    "Ｇ装备效果；无",
    
    "Ｄ装备等级：无",
}

-- 连城剑诀
ItemInfo[237]={
    "Ｌ习得武功：连城剑法",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：《 6格",
    
    "Ｄ组合特效：素质三连",
    "Ｗ必定三连击，学有三分剑法和连城剑法并使用任何剑系武功即可，不需主运三分或连城",
}

-- 祖传护身符
ItemInfo[238]={
    "Ｌ物品说明：祖上宝物，佩戴很舒心",
}

-- 金丝手套
ItemInfo[239]={
    "Ｇ装备效果；无",
    
    "Ｄ装备等级：无",
}

-- 玄铁匕首
ItemInfo[240]={
    "Ｇ装备效果；无",
    
    "Ｄ装备等级：无",
}

-- 君子剑
ItemInfo[241]={
    "Ｇ装备效果；全真剑法威力+100",
    
    "Ｄ装备等级：无",
}

-- 淑女剑
ItemInfo[242]={
    "Ｇ装备效果；玉女剑法威力+100",
    
    "Ｄ装备等级：无",
}

-- 金刀黑剑
ItemInfo[243]={
    "Ｇ装备效果；阴阳倒乱刃威力+200",
    
    "Ｄ装备等级：无",
}

-- 西毒蛇杖
ItemInfo[244]={
    "Ｇ装备效果；灵蛇杖法威力+200",
    
    "Ｄ装备等级：",
    "Ｗ◇LV.1：攻击时无视敌方毒抗强制上毒10点",
    "Ｗ◇LV.2：攻击时无视敌方毒抗强制上毒15点",
    "Ｗ◇LV.3：攻击时无视敌方毒抗强制上毒20点",
    "Ｗ◇LV.4：攻击时无视敌方毒抗强制上毒25点",
    "Ｗ◇LV.5：攻击时无视敌方毒抗强制上毒30点",
    "Ｗ◇LV.6（MAX）：攻击时无视敌方毒抗强制上毒35点",
}

-- 达摩剑谱
ItemInfo[245]={
    "Ｌ习得武功：达摩剑法",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米 5格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：无",
}

-- 百胜刀法
ItemInfo[246]={
    "Ｌ习得武功：百胜刀法",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：△ 6格",
    
    "Ｗ学会八卦刀法，修炼百胜刀法一脉相承",
}

-- 灵蛇杖法
ItemInfo[247]={
    "Ｌ习得武功：灵蛇杖法",
    
    "Ｗ武功威力：1400",
    "Ｗ武功气攻：1400",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：田 5格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：",
    "Ｗ◇攻击附带中毒",                                         --飘夜
    "Ｗ学会三蜈五蟆烟，修炼灵蛇杖法一脉相承",
}

-- 三花聚顶掌
ItemInfo[248]={
    "Ｌ习得武功：三花聚顶掌",
    
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：米 6格",
    "Ｗ学会三花聚顶掌，修炼空明拳一脉相承",
}

-- 铁指诀
ItemInfo[249]={
    "Ｌ习得武功：铁指诀",
    
    "Ｗ武功威力：250",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：▽ 7格",
    
    "Ｄ组合特效：",
    
    "Ｚ特别说明：",
    "Ｗ◇增加暴击率",
    "Ｗ◇附带中毒",                                         --飘夜
    "Ｗ◇学会铁指诀，修炼一阳指一脉相承",
}

-- 天竺佛指
ItemInfo[250]={
    "Ｌ习得武功：天竺佛指",
    
    "Ｗ武功威力：300",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：▽ 4格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：",
    "Ｗ◇高暴击",                                         --飘夜
    "Ｗ◇学会天竺佛指，修炼无相劫指一脉相承",
}

-- 夺魄指
ItemInfo[251]={
    "Ｌ习得武功：夺魄指",
    
    "Ｗ武功威力：350",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：▽ 7格",
    
    "Ｗ学会夺魄指，修炼参合指一脉相承",
}

-- 凌波微步
ItemInfo[252]={
    "Ｌ习得轻功：凌波微步",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
    "Ｗ◇被攻击20%的几率完全闪避攻击,并使之后5时序闪避几率翻倍",
    "Ｗ◇没闪避时，有20%的几率触发凌波微步减伤，降低40%的伤害及杀气"
}

-- 去烦恼指
ItemInfo[253]={
    "Ｌ习得武功：去烦恼指",
    
    "Ｗ武功威力：400",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：175",
    "Ｗ武功范围：▽ 6格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",                                         --飘夜
    "Ｗ学会去烦恼指，修炼多罗叶指一脉相承",
}

-- 袖中指
ItemInfo[254]={
    "Ｌ习得武功：袖中指",
    
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：▽ 6格",
    "Ｗ学会袖中指，修炼拈花指一脉相承",
}

-- 兰花拂穴手
ItemInfo[255]={
    "Ｌ习得武功：兰花拂穴手",
    
    "Ｗ武功威力：500",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米 5格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：",
    "Ｗ◇高几率封穴",                                         --飘夜
    "Ｗ学会兰花拂穴手，修炼弹指神通一脉相承",
}

-- 透骨打穴
ItemInfo[256]={
    "Ｌ习得武功：透骨打穴",
    
    "Ｗ武功威力：600",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米 5格",
    
    "Ｄ组合特效：",
    
    "Ｚ特别说明：",
    "Ｗ◇高几率封穴",
}

-- 旋风扫叶腿
ItemInfo[257]={
    "Ｌ习得武功：旋风扫叶腿",
    
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：▽ 7格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：无",
}

-- 玄天指
ItemInfo[258]={
    "Ｌ习得武功：玄天指",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：▽ 6格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：",
    "Ｗ◇高暴击",
    "Ｗ◇附带冰封",                                         --飘夜
    "Ｗ学会玄天指，修炼幻阴指一脉相承",
}

-- 黑风指法
ItemInfo[259]={
    "Ｌ习得武功：黑风指",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：150",
    "Ｗ武功范围：▽ 6格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",
    "Ｗ◇附带冰封",                                         --飘夜
    "Ｗ学会黑风指，修炼九阴白骨爪一脉相承",
}

-- 大智无定指
ItemInfo[260]={
    "Ｌ习得武功：大智无定指",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：▽ 6格",
    
    "Ｄ组合特效：",
    "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
    "Ｗ◇除却四相：被攻击50%几率触发，使用多罗叶指/大智无定指/无相劫指/拈花指必触发",
    "Ｗ◇除却四相：修炼一门或以上到极激活——无我相：随机免疫本次攻击造成的内伤/封穴/冰封/灼烧/流血/中毒之一",
    "Ｗ◇除却四相：修炼二门或以上到极激活——无人相：集气条前进100",
    "Ｗ◇除却四相：修炼三门或以上到极激活——无众生相：无视敌方气攻",
    "Ｗ◇除却四相：修炼四门到极激活——无寿者相：恢复100点生命",
    "Ｗ学会一指禅，修炼大智无定指一脉相承",
}

-- 凝血神爪
ItemInfo[261]={
    "Ｌ习得武功：凝血神爪",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：米 5格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：无",
}

-- 汗血宝马
ItemInfo[262]={
    "Ｇ装备效果；集气+8，时序回复流血值2点",
}

-- 天外玄铁
ItemInfo[263]={
    "Ｇ物品说明；稀世罕有的材料",
}

-- 飞云骓
ItemInfo[264]={
    "Ｇ装备效果；集气+10",
}

-- 金刚不坏体
ItemInfo[265]={
    "Ｌ习得内功：金刚不坏体",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇被攻击时60%几率发动“金刚不坏”，高优先级降低30%所承受伤害及杀气",
    "Ｗ *同时学有易筋神功+金刚不坏体，主运【易筋神功】被攻击必出“金刚不坏”",
    
    "Ｄ罗汉金身(组合特效)：",
    "Ｗ◇学会罗汉伏魔功、金刚不坏体",
    "Ｗ◇运功会罗汉伏魔功、金刚不坏体或易筋经",
    "Ｗ◇受到第一次的伤害概率减伤50%",
}

-- 四象步法
ItemInfo[266]={
    "Ｌ习得轻功：飞天神行",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
    "Ｗ◇集气速度+10",
    "Ｗ◇行动结束后，下回合集气+200（可与其他效果叠加）"
}

-- 神行百变
ItemInfo[267]={
    "Ｌ习得轻功：神行百变",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+2（提升移动能力需下回合生效）",
    "Ｗ◇被攻击12%的几率完全闪避攻击,并使之后5时序闪避几率翻倍",
    "Ｗ◇没闪避时，有25%的几率触发神行百变减伤，降低30%的伤害及杀气"
}

-- 拈花指法
ItemInfo[268]={
    "Ｌ习得武功：拈花指",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：180",
    "Ｗ武功范围：米 6格",
    
    "Ｄ组合特效：",
    "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
    "Ｗ◇除却四相：被攻击50%几率触发，使用多罗叶指/大智无定指/无相劫指/拈花指必触发",
    "Ｗ◇除却四相：修炼一门或以上到极激活——无我相：随机免疫本次攻击造成的内伤/封穴/冰封/灼烧/流血/中毒之一",
    "Ｗ◇除却四相：修炼二门或以上到极激活——无人相：集气条前进100",
    "Ｗ◇除却四相：修炼三门或以上到极激活——无众生相：无视敌方气攻",
    "Ｗ◇除却四相：修炼四门到极激活——无寿者相：恢复100点生命",
    "Ｗ◇学会袖中指，修炼拈花指一脉相承",
}

-- 无相劫指法
ItemInfo[269]={
    "Ｌ习得武功：无相劫指",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：240",
    "Ｗ武功范围：▽ 7格",
    
    "Ｄ组合特效：",
    "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
    "Ｗ◇除却四相：被攻击50%几率触发，使用多罗叶指/大智无定指/无相劫指/拈花指必触发",
    "Ｗ◇除却四相：修炼一门或以上到极激活——无我相：随机免疫本次攻击造成的内伤/封穴/冰封/灼烧/流血/中毒之一",
    "Ｗ◇除却四相：修炼二门或以上到极激活——无人相：集气条前进100",
    "Ｗ◇除却四相：修炼三门或以上到极激活——无众生相：无视敌方气攻",
    "Ｗ◇除却四相：修炼四门到极激活——无寿者相：恢复100点生命",
    "Ｗ◇学会天竺佛指，修炼无相劫指一脉相承",
}

-- 参合指法
ItemInfo[270]={
    "Ｌ习得武功：参合指",
    
    "Ｗ武功威力：1400",
    "Ｗ武功气攻：1500",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：▽ 8格",
    
    "Ｄ组合特效：无",
    
    "Ｚ特别说明：参合状态，增己伤10%-30%，减敌伤15%-30%",
    "Ｗ特别说明：学有参合指并使用任何指系武功即可，不需主运参合指",
    "Ｗ学会夺魄指，修炼参合指一脉相承",
}

-- 沧溟刀法
ItemInfo[271]={
    "Ｌ习得武功：沧溟刀法",
    
    "Ｗ武功威力：1300",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：△ 7格",
    
    "Ｄ组合特效：",
    "Ｗ◇利刃寒锋：需同时学习修罗+阴风+沧溟，需内力为阴或天罡",
    "Ｗ◇任何刀系武功50%几率触发，添加3-5层冰冻状态",
    "Ｗ◇使用修罗/阴风/沧溟必出且冰冻时长加倍",
    
    "Ｚ特别说明：",
    "Ｗ◇颠动沧溟：使用沧溟刀法攻击30%几率触发",
    "Ｗ◇颠动沧溟：额外杀气，且必定造成流血",
    "Ｗ◇颠动沧溟：刀主有二次判定",                                        --飘夜
    "Ｗ◇附带冰封", 
    "Ｗ学会南山刀法，修炼沧溟刀法一脉相承",
}

-- 茯苓花雕猪
ItemInfo[272]={
    "Ｌ物品说明：稀有的猪，名贵的猪", 
}

-- 皇宫通行令
ItemInfo[273]={
    "Ｌ物品说明：进出皇宫，通行无阻",
}

-- 一指禅
ItemInfo[274]={
    "Ｌ习得武功：一指禅",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：▽ 7格",
    
    "Ｄ组合特效：无",
    "Ｗ学会一指禅，修炼大智无定指一脉相承",
}

-- 化骨绵掌
ItemInfo[275]={
    "Ｌ习得武功：化骨绵掌",
    
    "Ｗ武功威力：700",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：米 5格",
    
    "Ｚ特别说明：",
    "Ｗ◇附带冰封、中毒(30)",                                         --飘夜
    "Ｄ组合特效：",
    "Ｗ◇紫气天罗：同时学有灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
    "Ｗ◇紫气天罗：攻击随机附加3~5层“冰冻状态”，每层减缓1%集气速度，上限30层",
    "Ｗ◇紫气天罗：使用任何拳系武功50%几率触发，使用灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌必出且冰冻层数加倍",
    "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
}

-- 火枪
ItemInfo[276]={
    "Ｇ装备效果：火枪要术威力+3000",
}

-- 多罗叶指
ItemInfo[277]={
    "Ｌ习得武功：多罗叶指",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：150",
    "Ｗ武功范围：▽ 6格",
    
    "Ｄ组合特效：",
    "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
    "Ｗ◇除却四相：被攻击50%几率触发，使用多罗叶指/大智无定指/无相劫指/拈花指必触发",
    "Ｗ◇除却四相：修炼一门或以上到极激活——无我相：随机免疫本次攻击造成的内伤/封穴/冰封/灼烧/流血/中毒之一",
    "Ｗ◇除却四相：修炼二门或以上到极激活——无人相：集气条前进100",
    "Ｗ◇除却四相：修炼三门或以上到极激活——无众生相：无视敌方气攻",
    "Ｗ◇除却四相：修炼四门到极激活——无寿者相：恢复100点生命",
    "Ｗ学会去烦恼指，修炼多罗叶指一脉相承",
}

-- 越女剑法
ItemInfo[278]={
    "Ｌ习得武功：越女剑法",
    
    "Ｗ武功威力：1400",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：7",
    "Ｗ武功范围：■ 10+9X9",
    
    "Ｗ学会猿公剑法，修炼越女剑法一脉相承",
}

-- 毛驴
ItemInfo[279]={
    "Ｇ装备效果；集气速度+5",
    
    "Ｄ装备等级：无",
}

-- 玉女心经
ItemInfo[280]={
    "Ｌ习得内功：玉女心经",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇连击时有（30+天书数×2）%的几率触发“夭矫空碧”特效，此次连击伤害、",
    "Ｗ  杀气不减",
    "Ｗ◇攻击的第一击有（天书数×2）%几率触发“进趋如风”特效，追加一次连击",
    "Ｗ *主角使用时几率增加5%，且爆豆时在每回合的第一次出手必发动",
    "Ｗ◇被攻击时，降低50%本次攻击所造成的灼烧",
    "Ｗ 【女性专属】气攻伤害增加20%",
    
    "Ｄ组合特效：",
    "Ｗ *同时学有玉女心经+先天功，每时序额外回复1点封穴",
    "Ｗ学会古墓心法，修炼玉女心经一脉相承",
}

-- 商会令牌
ItemInfo[281]={
    "Ｌ物品说明：可在大商家处兑换一万银两",
}

-- 天罗地网
ItemInfo[282]={
    "Ｌ习得轻功：天罗地网",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
    "Ｗ◇攻击时无视敌方的闪避效果强制命中，且自身攻击范围+1",
    "Ｗ◇击中的敌方下回合移动格数-1",
    "Ｗ *强制命中可针对敌方真葵花移行、凌波微步、神行百变等特效",
    "Ｗ *强制命中还可无视我方被刺目等状态"
}

-- 五轮大法
ItemInfo[283]={
    "Ｌ习得武功：五轮大法",
    
    "Ｗ武功威力：1300",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：180",
    "Ｗ武功范围：田 6格",
    
    "Ｗ学会阴阳倒乱刃，修炼五轮大转一脉相承",
}

-- 瘦黄马
ItemInfo[284]={
    "Ｇ装备效果；血量越低，集气速度越快",
    
    "Ｄ装备等级：无",
}

-- 血河神鉴
ItemInfo[285]={
    "Ｌ习得内功：血河神鉴",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇高优先级提升10%伤害",
    "Ｗ◇攻击时必定造成流血",
    "Ｗ◇攻击时，恢复造成伤害10%的血量（单次攻击上限100点）",
    "Ｗ◇学会血刀心法，修炼血河神鉴时可以一脉相承",
    "Ｗ◇学会血河神鉴，修炼天魔功时可以一脉相承",
}

-- 九阴真经上卷
ItemInfo[286]={
    "Ｌ物品说明：上卷，下卷合起来有用。这是上卷",
}

-- 九阴真经下卷
ItemInfo[287]={
    "Ｌ物品说明：上卷，下卷合起来有用。这是下卷",
}

-- 断裂的倚天剑
ItemInfo[288]={
    "Ｌ物品说明：断剑，不能用了，要用天外玄铁修补",
}

-- 断裂的屠龙刀
ItemInfo[289]={
    "Ｌ物品说明：断刀，不能用了，要用天外玄铁修补",
}

-- 白蟒鞭法
ItemInfo[290]={
    "Ｌ习得武功：白蟒鞭法",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：？？",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：田 5格",
    
    "Ｗ学会大剪刀，修炼金刚伏魔圈一脉相承",
}

-- 大力金刚指
ItemInfo[291]={
    "Ｌ习得武功：大力金刚指",
    
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：245",
    "Ｗ武功范围：▽ 7格",
    
    "Ｄ组合特效：无",
    "Ｚ特别说明：无",
}

-- 呼延枪法
ItemInfo[292]={
    "Ｌ习得武功：呼延枪法",
    
    "Ｗ武功威力：400",
    "Ｗ武功气攻：-",
    "Ｗ内力消耗：14",
    "Ｗ武功范围：米 4格",
    
    "Ｄ组合特效：",
    "Ｗ◇寸长寸强：同时修炼呼延枪法和呼延鞭法到极",
    "Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加5%",
    "Ｚ特别说明：无",
}

-- 楞伽经
ItemInfo[293]={
    "Ｌ物品说明：佛教经典",
}

-- 瑜伽密乘
ItemInfo[294]={
    "Ｌ习得内功：瑜伽密乘",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇免疫破绽",
    "Ｗ◇被攻击时，集气不会被杀至300以下",
    "Ｗ◇被连击时，受到的攻击效果/气攻降低40%",
    "Ｚ组合特效：",
    "Ｗ◇梵我合一：学会神足经、瑜伽密乘主运其中一个",
    "Ｗ◇梵我合一：受到会暴击或连击的攻击时，20%几率终止敌方行动",
}

-- 太极神功
ItemInfo[295]={
    "Ｌ习得内功：太极神功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇被攻击时，有60%几率获得“太极之形”（可累积，上限10个）",
    "Ｗ◇每个“太极之形”可提高自身集气1点",
    "Ｗ◇主动攻击时，可释放累积的“太极之形”，增加连击数",
    "Ｗ （每个5太极之形增加一次连击）",
    "Ｗ◇被攻击储存蓄力值，使用太极拳/剑跟据蓄力值增加效果",
    "Ｗ◇太极拳/剑蓄力值300～600，攻击范围+2",
    "Ｗ◇太极拳/剑蓄力值超过600，攻击范围变为可移动面攻，且必定连击",
    "Ｗ◇根据蓄力值增加防御跟减伤",
    "Ｗ◇太极拳太极剑法威力+200",
    "Ｗ◇触发太极奥义时，必定触发“太极真义·四两拨千斤”",
    "Ｗ◇触发太极奥义时，降低10%所承受伤害",
    "Ｗ◇行动后自动执行防御防御指令",
    "Ｄ太极特效：",
    "Ｚ◇<转阴阳>",
    "Ｗ◇被攻击时30%概率反弹自身所有异常",
    "Ｄ太极特效：",
    "Ｚ◇<开太极>",
    "Ｗ◇主运太极神功，使用太极拳法或太极剑法",
    "Ｗ◇蓄力值超过500且暴怒触发",
    "Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命比例越低、内力比例越高伤害越高",
    "Ｗ◇学会武当心法，修炼太极神功一脉相承",
}

-- 梯云纵横
ItemInfo[296]={
    "Ｌ习得轻功：梯云纵横",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
    "Ｗ◇攻击伤害不随距离递减",
    "Ｗ◇被攻击时，有50%的几率触发梯云纵横，降低50%的杀气"
}

-- 瞬息千里
ItemInfo[297]={
    "Ｌ习得轻功：瞬息千里",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+2（提升移动能力需下回合生效）",
    "Ｗ◇暴怒时集气速度提升至3倍",
    "Ｗ◇暴怒时免疫封穴"
}

-- 阴风刀
ItemInfo[298]={
    "Ｌ习得武功：阴风刀",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：《 7格",
    
    "Ｄ组合特效：",
    "Ｗ◇利刃寒锋：需同时学习修罗+阴风+沧溟，需内力为阴或天罡",
    "Ｗ◇任何刀系武功50%几率触发，添加3-5层冰冻状态",
    "Ｗ◇使用修罗/阴风/沧溟必出且冰冻时长加倍",
    "Ｗ学会五虎断门刀，修炼阴风刀一脉相承",
}

-- 五岳剑诀
ItemInfo[299]={
    "Ｌ习得内功：五岳剑诀",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇被攻击时如未触发真气护体，则发动“以剑御气”降低50%气攻",
    "Ｗ◇五岳剑法威力+200",
    "Ｗ◇使用五岳剑法，必出“气贯五岳”，追加气攻提高至1500",
    "Ｗ◇五岳剑法分别获得如下的强化效果：",
    "Ｗ  *太岳：连击时变为三连击",
    "Ｗ  *云雾：对于血量低于一半的敌人伤害加倍",
    "Ｗ  *万花：杀伤范围+1格",
    "Ｗ  *泰山：攻击后20时序内有30%几率闪避",
    "Ｗ  *万岳：对敌方造成伤害同时扣除对其伤害量的内力",
    "Ｗ◇可从紫霞神功一脉继承",
}

-- 音箱
ItemInfo[300]={
    "Ｇ装备效果；50%机率触发“降龙四叠浪”，增加降龙三叠浪机率。",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：增加降龙三叠浪机率5%",
    "Ｗ◇LV.2：增加降龙三叠浪机率10%",
    "Ｗ◇LV.3：增加降龙三叠浪机率15%",
    "Ｗ◇LV.4：增加降龙三叠浪机率20%",
    "Ｗ◇LV.5：增加降龙三叠浪机率25%",
    "Ｗ◇LV.6（MAX）：增加降龙三叠浪机率30%",
    "Ｄ装备特效：",
    "Ｚ特别说明："
}

-- 十方步
ItemInfo[301]={
    "Ｌ习得轻功：十方步",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
}

-- 三分归元气
ItemInfo[302]={
    "Ｌ习得武功：三分归元气",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇免疫冰封/冰冻、灼烧/点燃。",
    "Ｗ◇每3时序回1内伤",
    "Ｗ◇集气不受异常影响。受攻击概率触发特效“归元”：集气增加100，一回合触发次数不超过5次。",
    "Ｗ◇行动结束回复损失生命的20%。",
    "Ｗ◇五十时序则触发一次“神元”：回复损失的50%（生命、内力、体力）的。且50%概率创造一个继承一半的属性的分身。一场战斗最多创造两个分身。",
}

-- 排云掌
ItemInfo[303]={
    "Ｌ习得武功：排云掌",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｚ特别说明：无"
}

-- 风神腿
ItemInfo[304]={
    "Ｌ习得武功：风神腿",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｚ特别说明：无"
}

-- 火枪要术
ItemInfo[305]={
    "Ｌ习得武功：火枪要术",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｚ特别说明：无"
}

-- 黄金包袱
ItemInfo[306]={
    "Ｌ物品说明：黄人凤的包袱",
}

-- 灵鳌步
ItemInfo[307]={
    "Ｌ习得轻功：灵鳌步",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
}

-- 鲸息功
ItemInfo[308]={
    "Ｌ习得内功：鲸息功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇时序回血5，回内10，解毒1",
    "Ｗ◇时序增加1怒气,入白驼山时序增加3怒气，与蛤蟆不叠加",
    "Ｗ◇3时序回内伤1",
    "Ｗ◇30%几率触发“神鲸歌”混乱5-10时序，触发后刷新不叠加",
    "Ｗ◇鲸息蓄力初始300，每受攻击一次增加150（受攻击不需要伤血）",
    "Ｗ◇鲸息蓄力过500后必暴击",
    "Ｗ◇鲸息蓄力满1000后释放，攻击增加1000气攻/真伤",
    "Ｗ◇鲸息蓄力增加当前蓄力值点气防",
    "Ｗ◇鲸息蓄力释放后不清零只减半",
    "Ｗ◇蓄力攻击加法增伤25%",
    "Ｗ◇使用碧海惊涛掌攻击概率触发六大奇劲：",
    "Ｗ◇陷空力：忽视绝对气防+破防50%",    
    "Ｗ◇滔天炁：触发大范围伤害",    
    "Ｗ◇生灭道：攻击后触发霸体一回合",
    "Ｗ◇漩涡劲：增加一次连击",        
    "Ｗ◇阴阳流：必冰封必灼烧",    
    "Ｗ◇滴水劲：附加气攻值5%伤害",
    "Ｗ◇学会蛤蟆功，学习鲸息功时可以一脉相承",
}

-- 小李飞刀
ItemInfo[309]={
    "Ｌ习得武功：无",
    "Ｄ组合特效：",
    "Ｚ特别说明：李寻欢专属"
}

-- 碧海惊涛掌
ItemInfo[310]={
    "Ｌ习得武功：碧海惊涛掌",
    
    "Ｗ武功威力：1400",
    "Ｗ武功气攻：1400",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米字 4格",
    
    "Ｄ组合特效：(梁萧专属)学会“鲸息功”使用碧海惊涛掌可触发六大奇劲",
    "Ｗ陷空力：忽视绝对气防+破防40%",    
    "Ｗ滔天炁：触发大范围伤害",    
    "Ｗ生灭道：攻击后触发霸体一回合",
    "Ｗ漩涡劲：增加一次连击，最多增加两次",        
    "Ｗ阴阳流：必冰封必灼烧",    
    "Ｗ滴水劲：附加气攻值5%伤害",
    "Ｚ特别说明：无"
}

-- 太虚剑意
ItemInfo[311]={
    "Ｌ习得内功：太虚剑意",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回1内伤",
    "Ｗ◇每时序回2点气血",
    "Ｗ◇ “坐忘无我 韬光养晦”：被攻击时，受到气攻大于1500发动，吸收气攻值为自身的气防",
    "Ｗ◇ “三环套月”：使用剑法时太虚剑意加力50%机率三连击",
    "Ｗ◇ “万剑归宗”：使用剑法时太虚剑意加力高概率造成封穴，追加气攻值1500点",
}

-- 神秘护符
ItemInfo[312]={
    "Ｚ特别说明：神秘护符"
}

-- 斩流剑术
ItemInfo[313]={
    "Ｌ习得武功：斩流剑术",
    
    "Ｗ武功威力：1400",
    "Ｗ武功气攻：1600",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：线型 8格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：无"
}

-- 千年冰蚕
ItemInfo[314]={
    "Ｌ物品说明：千年冰蚕，炼制地灵丹的药材之一",
    "Ｄ使用效果：+100抗毒", 
}

-- 神木王鼎
ItemInfo[315]={
    "Ｌ物品说明：星宿派至宝，可炼制药品",
    "Ｄ使用效果：无",
}

-- 地灵丹
ItemInfo[316]={
    "Ｌ物品说明：增加武常50点", 
}

-- 不老长春功
ItemInfo[317]={
    "Ｌ习得内功：不老长春功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇时序回复(5+天书数量)的生命值",
    "Ｗ◇时序回复(5+天书数量)的内力值",
    "Ｗ◇血量百分比高于内力百分比时",
    "Ｗ◇时序回复百分之一内力",
    "Ｗ◇血量百分比低于内力百分比时",
    "Ｗ◇时序回复百分之一生命",
    "Ｗ◇学习不老长春功时可以一脉相承。",
}

-- 阳春白雪曲
ItemInfo[318]={
    "Ｌ习得武功：阳春白雪曲",
    
    "Ｗ武功威力：1300",
    "Ｗ武功气攻：1400",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：面 4格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：无",
}

-- 一苇渡江
ItemInfo[319]={
    "Ｌ习得轻功：一苇渡江",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇无视ZOC限制移动，且移动格数+2（提升移动能力需下回合生效）",
    "Ｗ◇受到封穴减少50%",
    "Ｗ◇初始集气位置+500，",
    "Ｗ◇30%概率减伤30%",
    "Ｄ被动效果：",
    "Ｗ◇集气速度不受异常影响",
}

-- 狼牙
ItemInfo[320]={
    "Ｇ装备效果；攻击时50%几率造成流血",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：攻击时50%几率造成流血",
    "Ｗ◇LV.2：攻击时60%几率造成流血",
    "Ｗ◇LV.3：攻击时70%几率造成流血",
    "Ｗ◇LV.4：攻击时80%几率造成流血",
    "Ｗ◇LV.5：攻击时90%几率造成流血",
    "Ｗ◇LV.6（MAX）：攻击时必造成流血，50%机率发动“天狼啸月”",
    "Ｄ装备特效：",
     "Ｗ◇“天狼啸月”：造成敌全体集气-100"
}

-- 井月八法
ItemInfo[321]={
    "Ｌ习得武功：井月八法",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：井字 6格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：无",                                        
    "Ｗ◇暴击率提升5%"
}

-- 擒龙手
ItemInfo[322]={
    "Ｌ习得武功：擒龙手",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米字 5格",
    
    "Ｚ组合特效：",
    "Ｗ◇虎鹤双形：学会擒龙手、虎爪绝户手。",
    "Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
    "Ｗ◇虎啸：周身六格内目标概率混乱", 
    "Ｗ◇龙吟：被击的目标击集气位置倒退300。",
}

-- 伏魔禅杖
ItemInfo[323]={
    "Ｇ装备效果；伏魔杖法威力+200，增加世尊降魔触发机率(装备等级*2)",
    "Ｄ装备等级：无",
}

-- 般若掌
ItemInfo[324]={
    "Ｌ习得武功：般若掌",
    
    "Ｗ武功威力：1300",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米字 4格",
    
    "Ｄ组合特效：",
    "Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
    "Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
    "Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",
    "Ｚ特别说明：",
}

-- 猿公剑法
ItemInfo[325]={
    "Ｌ习得武功：猿公剑法",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：35",
    "Ｗ武功范围：线 8格",
    
    "Ｗ学会猿公剑法，修炼越女剑法一脉相承",
}

-- 白猿
ItemInfo[326]={
    "Ｇ装备效果；猿公剑法/越女剑法威力+200",
    "Ｄ装备等级：无",
}

-- 天魔功
ItemInfo[327]={
    "Ｌ习得内功：天魔功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇吸血20%",
    "Ｗ◇攻击必暴击",
    "Ｗ◇无视目标30%防御",
    "Ｗ◇行动后增加10点怒气值",
    "Ｗ◇“天魔大法”：暴怒时30%几率入魔",
    "Ｗ◇“天魔大法”：免疫封穴杀气，额外吸血20%，必连击概率三连击",
    "Ｗ◇“天魔大法”：暴怒结束入魔结束",
    "Ｗ◇“天魔金身”：受攻击时如自身生命值低于一半，免疫攻击10时序，CD200时序",
    "Ｗ◇学会血河神鉴，修炼天魔功时可以一脉相承",
}

-- 庄子
ItemInfo[328]={
    "Ｌ习得内功：大周天功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每5时序回复1点内伤",
    "Ｗ◇封穴减少50%",
    "Ｗ◇“至人无己”：攻击10%概率触发，目标集气倒走1~3时序。",
    "Ｗ◇“神人无功”：攻击30%概率触发，提升我方100点集气位置。",
    "Ｗ◇“圣人无名”：攻击50%概率触发，降低20%受到的伤害。",
    "Ｗ◇免疫反击反伤",
    "Ｗ学会小周天功，修炼大周天功一脉相承",
}

-- 奔雷手
ItemInfo[329]={
    "Ｌ习得武功：奔雷手",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米字 5格",
    "Ｗ学会奔雷手，使用任何拳掌系武功攻击50%几率给敌人添加雷音debuff，三层雷音后昏迷，不需主运奔雷手",
    "Ｗ学会百花错拳，修炼奔雷手一脉相承",
}

-- 追魂夺命剑谱
ItemInfo[330]={
    "Ｌ习得武功：追魂夺命剑法",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：线 8格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",
}

-- 庖丁解牛刀
ItemInfo[332]={
    "Ｌ习得武功：庖丁解牛刀",
    
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",
    "Ｗ学会柴刀十八路，修炼庖丁解牛一脉相承",
}

-- 袈裟伏魔功
ItemInfo[332]={
    "Ｌ习得武功：袈裟伏魔功",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：面 3格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",
}

-- 迷踪连环腿
ItemInfo[333]={
    "Ｌ习得武功：迷踪连环腿",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：50",
    "Ｗ武功范围：十字 5格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",
}

-- 无极玄功拳
ItemInfo[334]={
    "Ｌ习得武功：无极玄功拳",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：米字 4格",
    "Ｗ学会无极玄功拳，修炼大伏魔拳一脉相承",
}

-- 青冥剑
ItemInfo[335]={
    "Ｇ装备效果；剑法攻击范围+1",
    "Ｄ装备等级：无",
}

-- 武穆遗书
ItemInfo[336]={
    "Ｌ习得特技：武穆遗书",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇根据（实战数值/2）增加战场攻击力",
    "Ｗ◇根据（实战数值/2）增加战场防御力",
    "Ｗ我方全体攻击增加（实战数值/25）%",
    "Ｄ组合特效：",
    "Ｗ◇血战沙场：同时修炼岳家枪法/岳王散手/武穆遗书",
    "Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
    "Ｗ            根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
    "Ｚ特别说明：", 
    "Ｗ威力等于750+实战数值",
}

-- 岳王散手
ItemInfo[337]={
    "Ｌ习得武功：岳王散手",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：米字 4格",
    "Ｗ学会岳王散手，使用任何指系武功60%几率附加敌人最大生命值5%的真伤，不需主运岳王散手",
}

-- 冰蚕毒掌
ItemInfo[338]={
    "Ｌ习得武功：冰蚕毒掌",
    "Ｎ",
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米字 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇毒布武林：主运五毒神功，修炼五毒神掌/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
    "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
    "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

-- 青驴
ItemInfo[339]={
    "Ｇ装备效果；集气速度增加5点，体力消耗减2点",
}

-- 寒袖拂穴
ItemInfo[340]={
    "Ｌ习得武功：寒袖拂穴",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：面攻 4格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",     
    "Ｗ◇必定封穴",
}

-- 白虹掌力
ItemInfo[341]={
    "Ｌ习得武功：白虹掌力",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米字 4格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",
}

-- 长生诀
ItemInfo[342]={
    "Ｌ习得内功：长生诀",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇免疫内伤",
    "Ｗ◇减少30%受到的气攻",
    "Ｗ◇重生回复满血并立即行动",
    "Ｗ◇时序回点3点气血",
    "Ｗ◇顾道长生：被攻击时25%概率触发，5时序内每时序恢复最大生命内力1%",
    "Ｗ◇阴阳相生：攻击造成灼烧时必定造成冰封，造成冰封时必定造成灼烧",
    "Ｗ◇学会神照功，修炼长生诀时可以一脉相承",
}

-- 四大山皮肤
ItemInfo[346]={
    "Ｌ四大山皮肤",
    "Ｌ至尊江湖，至尊江湖，绿色国产单机武侠，至尊江湖倒闭了。",
    "Ｌ王八蛋老板四大山,吃喝嫖赌欠下了3.5个亿，带着他的小姨子跑了。",
    "Ｌ我们没有没有办法，拿着皮肤抵工资。",
    "Ｌ原价都是三百多、二百多、一百多的皮肤，通通二十块，通通二十块！",
}

-- 易水寒诀
ItemInfo[348]={
    "Ｌ习得武功：易水寒诀",  
    "Ｗ武功威力：1300",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：400",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇免疫中毒",
    "Ｗ◇攻击必冰封，根据敌方冰封值追加双倍真实伤害",
    "Ｗ◇行动后获得5层易水寒诀BUFF，被攻击获得5层易水寒诀BUFF",
    "Ｗ◇易水寒诀大于30，暴击率+30%，暴击伤害+30%。",
    "Ｗ◇易水寒诀大于60，60%无视敌方闪避强制命中。",
    "Ｗ◇易水寒诀大于90，90%概率触发“图穷匕见”强制扣除敌方全体集气位置90点",
    "Ｗ◇易水寒诀等于100，暴怒立即出手，易水寒诀BUFF减半",
}

-- 绣花针
ItemInfo[349]={
    "Ｇ装备效果；进战集气增加900，必流血，破防5%",
    "Ｄ装备等级：",
    "Ｗ◇LV.1：破防5%",
    "Ｗ◇LV.2：破防10%",
    "Ｗ◇LV.3：破防15%",
    "Ｗ◇LV.4：破防25%",
    "Ｗ◇LV.5：破防25%",
    "Ｗ◇LV.6（MAX）：破防30%，必破气防",
}

-- 玉女素心剑法
ItemInfo[350]={
    "Ｌ习得武功：玉女素心剑法",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：400",
    "Ｗ武功范围：《 8格",
    
    "Ｚ特别说明：",
    "Ｗ◇增加连击率",                                         --飘夜
    "Ｗ学会玉女剑法，修炼玉女素心剑法时可以一脉相承",
    "Ｄ组合特效：双剑合璧",
    "Ｗ同时学会武功全真剑法、玉女素心剑法、左右互搏，不必主运玉女/全真，使用任何剑系武功触发",
    "Ｗ必连击，增加三连概率30%，攻击必中敌破绽，杀气不会低于100，增加剑法范围1，气攻+800，主运玉女/全真时威力+300",
    "Ｗ学会玉女剑法，修炼玉女素心剑法时可以一脉相承",
}

-- 擒龙功
ItemInfo[351]={
    "Ｌ习得内功：擒龙功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇免疫反弹 反击，斗转",
    "Ｗ◇增加丐世无双触发概率10%",
    "Ｗ◇降龙打狗招式概率增加5%",
    "Ｗ◇时序回复流血2点",
    "Ｗ◇丐世无双学会其中一种另一种要求再降低20",
    "Ｗ◇降龙极意概率高于等于40增加概率10",
    "Ｗ◇降龙极意概率低于40增加概率20",
    "Ｗ◇增加打狗极意20%",
}

-- 呼延鞭法
ItemInfo[352]={
    "Ｌ习得武功：呼延鞭法",
    
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：田 4格",
    
    "Ｄ组合特效：",
    "Ｗ◇寸长寸强：同时修炼呼延枪法和呼延鞭法到极",
    "Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加5%",
}

-- 震天铁掌
ItemInfo[353]={
    "Ｌ习得武功：震天铁掌",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：390",
    "Ｗ武功范围：米 4格",
}

-- 枯荣禅功
ItemInfo[354]={
    "Ｌ习得内功：枯荣禅功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇50%概率气攻加600，气防加600",
    "Ｗ◇额外回复1灼烧/时序",
    "Ｗ◇亦枯亦荣：每回合消耗当前内力/50，回复等量生命值",
    "Ｗ◇一阳指威力增加200，必连击",
    "Ｗ◇六脉神剑威力增加400，必连击",
}

-- 少林心法
ItemInfo[355]={
    "Ｌ习得内功：少林心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：少林一脉相承",  
    "Ｗ◇学会少林心法，修炼易筋经时可以一脉相承",
}

-- 武当心法
ItemInfo[356]={
    "Ｌ习得内功：武当心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：武当一脉相承",  
    "Ｗ◇学会武当心法，修炼太极神功时可以一脉相承",
}

-- 全真心法
ItemInfo[357]={
    "Ｌ习得内功：全真心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：全真一脉相承",  
    "Ｗ◇学会全真心法，修炼先天功时可以一脉相承",
}

-- 古墓心法
ItemInfo[358]={
    "Ｌ习得内功：古墓心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：古墓一脉相承",  
    "Ｗ◇学会古墓心法，修炼玉女神功时可以一脉相承",
}

-- 华山心法
ItemInfo[359]={
    "Ｌ习得内功：华山心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：华山一脉相承",  
    "Ｗ◇学会华山心法，修炼紫霞神功时可以一脉相承",
}

-- 嵩山心法
ItemInfo[360]={
    "Ｌ习得内功：嵩山心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：嵩山一脉相承",  
    "Ｗ◇学会嵩山心法，修炼寒冰真气时可以一脉相承",
}

-- 血刀心法
ItemInfo[361]={
    "Ｌ习得内功：血刀心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：血刀一脉相承",  
    "Ｗ◇学会血刀心法，修炼血河神鉴时可以一脉相承",
}

-- 莲花功
ItemInfo[362]={
    "Ｌ习得内功：莲花功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：丐帮一脉相承",  
    "Ｗ◇学会莲花功，修炼擒龙功时可以一脉相承",
}

-- 地火功
ItemInfo[363]={
    "Ｌ习得内功：地火功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    "Ｚ特别说明：明教一脉相承",  
    "Ｗ◇学会地火功，修炼圣火神功时可以一脉相承",
}

-- 峨眉心法
ItemInfo[364]={
    "Ｌ习得内功：峨眉心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
    
    
    --"Ｚ特别说明：峨眉一脉相承",  
    --"Ｗ◇学会峨眉心法，修炼XX神功时可以一脉相承",
}

-- 小星罗功
ItemInfo[365]={
    "Ｌ习得内功：小星罗功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇5时序回复内伤1",
}

-- 寒冰真气
ItemInfo[366]={
    "Ｌ习得内功：寒冰真气",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇拳法武功出招+20%",
    "Ｗ◇对冰封值超过80的人概率冰冻",
    "Ｗ◇5时序回内伤1点",
    "Ｗ◇攻击必冰封",
    "Ｗ◇免疫冰封",
    "Ｗ◇学会嵩山心法，修炼寒冰真气时可以一脉相承",
}

-- 五毒宝典
ItemInfo[367]={
    "Ｌ习得内功：五毒神功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇时序增加自身中毒",
    "Ｗ◇回合结束按照自身中毒值一半恢复生命",
    "Ｗ◇自身中毒不影响集气",
    "Ｗ◇自身中毒补偿移动能力",
    "Ｗ◇自身每20点中毒程度增伤1%",
    "Ｗ◇自身每20点中毒程度减受伤1%",
    "Ｗ◇五毒神掌战斗中基础威力随机提升1-3倍",
    "Ｗ◇攻击强制上毒20点",
    "Ｗ◇攻击时根据目标中毒值/2追加伤害",
    "Ｄ组合特效：",
    "Ｗ◇毒布武林：主运五毒神功，修炼五毒神掌/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
    "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
    "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

-- 金雁功
ItemInfo[368]={
    "Ｌ习得轻功：金雁功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇轻功+30%，无视ZOC限制移动范围+3",
    "Ｗ◇气攻气防值+800",
    "Ｗ◇连击率增加30%，连击伤害增加30%",
    "Ｗ◇暴击率增加30%，暴击伤害增加30%"
}

-- 蛇行狸翻
ItemInfo[369]={
    "Ｌ习得轻功：蛇行狸翻",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇轻功+20%，无视ZOC限制移动范围+2",
    "Ｗ◇“每20时序(轻功值)%机率集气往前跳跃（轻功值）/10位置",
    "Ｗ◇15%概率闪避攻击"
}

-- 葵花点穴手
ItemInfo[370]={
    "Ｌ习得武功：葵花点穴手",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：▽ 7格",
    
    "Ｚ特别说明：",
    "Ｗ◇攻击必定封穴",
}

-- 龟息功
ItemInfo[371]={
    "Ｌ习得内功：龟息功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇蓄力状态下集气速度增加30%",
    "Ｗ◇被攻击时概率进入防御状态，初始概率25，生命越低概率越高",
    "Ｗ◇防御状态下无法被杀气，被攻击35%概率触发“伺机而动”集气位置增加100",
    "Ｗ◇防御状态下被攻击时反震目标内伤15点",
    "Ｗ◇时序回生命2点",
    "Ｗ◇5时序回内伤1点",
    "Ｗ◇免疫破绽",
    "Ｗ◇休息时自动防御",
    "Ｄ一脉相承：",  
    "Ｗ◇学习不老长春功时可以一脉相承。",
}

-- 中庸之道
ItemInfo[372]={
    "Ｌ习得奇术：中庸之道",
    "Ｎ",
    "Ｄ天命之谓性 特效：",
    "Ｗ◇每（资质-1）时序行动一次",
    "Ｎ",
    "Ｄ率性之谓道 特效：",
    "Ｗ◇受到攻击后如果满怒，（资质-29）%几率结束对手攻击并反击",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇需资质低于80且资质大于30",
}

-- 八卦心法
ItemInfo[373]={
    "Ｌ习得内功：八卦心法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇使用拳法刀法，系数必然不低于对方。",
    "Ｗ◇拳法刀法武功连击暴击概率+20%。",     
    "Ｚ特别说明：",
    "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",
}

-- 八卦刀法
ItemInfo[374]={
    "Ｌ习得武功：八卦刀法",
    
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：△ 5格",
    
    "Ｚ特别说明：",
    "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",
    "Ｗ学会八卦刀法，修炼百胜刀法一脉相承",
}

-- 神门十三剑
ItemInfo[375]={
    "Ｌ习得武功：神门十三剑",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：《 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇炼神还虚：同时修炼神门十三剑/玄虚刀法",
    "Ｗ◇炼神还虚：玄虚刀法必封穴，神门十三剑必冰封灼烧",
    "Ｗ◇炼神还虚：受到攻击30%几率使用双倍内力抵消一半伤害",
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ◇必封穴",
}

-- 五虎棍法
ItemInfo[376]={
    "Ｌ习得武功：五虎棍法",
    
    "Ｗ武功威力：600",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：田 4格",
    
    "Ｄ组合特效：",
    "Ｗ◇五虎闹东京：同时修炼五虎断门刀和五虎棍法",
    "Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
    "Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
    "Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
    "Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
    "Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
    "Ｗ学会五虎棍法，修炼无上大力杵一脉相承",
}

-- 流云飞袖
ItemInfo[377]={
    "Ｌ习得武功：流云飞袖",
    
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：面 3格",
    
    "Ｄ组合特效：",
    "Ｚ特别说明：",
}

-- 武当九阳功
ItemInfo[378]={
    "Ｌ习得内功：武当九阳功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇拳掌功夫招式概率+20%。",
    "Ｗ◇增加伤害10%，减伤10%。",    
    "Ｄ一脉相承：",  
    "Ｗ◇学习九阳神功时可以一脉相承。",
}

-- 峨眉九阳功
ItemInfo[379]={
    "Ｌ习得内功：峨眉九阳功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇剑法武功招式概率+20%。",
    "Ｗ◇行动后概率触发“佛光普照”清除自身灼烧/中毒/冰封/流血/内伤。",   
    "Ｄ一脉相承：",  
    "Ｗ◇学习九阳神功时可以一脉相承。",
}

-- 少林九阳功
ItemInfo[380]={
    "Ｌ习得内功：少林九阳功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇奇门武功招式概率+20%。",
    "Ｗ◇被攻击概率减伤20%并进入防御状态。",   
    "Ｄ一脉相承：",  
    "Ｗ◇学习九阳神功时可以一脉相承。",
}

-- 虎爪绝户手
ItemInfo[381]={
    "Ｌ习得武功：虎爪绝户手",
    
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米 4格",
    "Ｚ组合特效：",
    "Ｗ◇虎鹤双形：学会擒龙手、虎爪绝户手。",
    "Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
    "Ｗ◇擒龙手，虎爪绝户手概率+20，暴怒概率双倍。",  
    "Ｗ◇虎啸：被击中的目标概率混乱", 
    "Ｗ◇龙吟：被击中的目标集气位置倒退300。",
}

-- 疯魔棍谱
ItemInfo[382]={
    "Ｌ习得武功：疯魔棍法",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：11000",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：田 5格",
    
    "Ｄ组合特效：",
    
    "Ｚ特别说明：",
}

-- 金蛇缠丝手
ItemInfo[383]={
    "Ｌ习得武功：金蛇缠丝手",
    
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：11000",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：▽ 5格",
    
    "Ｄ组合特效：",
    
    "Ｚ特别说明：",
}

-- 小周天功
ItemInfo[384]={
    "Ｌ习得内功：小周天功",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇增加攻击伤害15%，减少受到的伤害15%。",
    "Ｗ◇5时序回复内伤1点。",   
    "Ｗ学会小周天功，修炼大周天功一脉相承",
}

-- 金刚狮子吼
ItemInfo[385]={
    "Ｌ习得内功：金刚狮子吼",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇行动前诵念金刚咒",
    "Ｗ  七格范围内我方获得200点护盾",
    "Ｗ  七格范围内敌方伤害降低20%，受到伤害增加20%，20%几率度化敌方一回合",
    "Ｎ",
    "Ｄ被动效果：",
    "Ｗ◇行动前诵念菩提咒",
    "Ｗ  七格范围内我方伤害提高10%，受到伤害减少10%",
    "Ｗ  七格范围内敌方集气后退100",
}

-- 岳家枪法
ItemInfo[386]={
    "Ｌ习得武功：岳家枪法",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｗ学会杨家枪法，修炼岳家枪法一脉相承",
}

-- 神足经
ItemInfo[387]={
    "Ｌ习得内功：神足经",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇未装备武器时，攻击后根据拳掌数值一半追加伤害",
    "Ｗ◇未装备防具时，攻击后根据指法数值一半获得护盾",
    "Ｗ◇未装备坐骑时，攻击后根据奇门数值一半提升下回合集气位置",
    "Ｗ◇每点体质增加1%伤害",
    "Ｗ◇每点体质减少1%受伤",
    "Ｚ组合特效：",
    "Ｗ◇梵我合一：学会神足经、瑜伽密乘，主运其中一门",
    "Ｗ◇梵我合一：受到会暴击或连击的攻击时，20%几率终止敌方行动",
}

-- 天刀九问
ItemInfo[388]={
    "Ｌ习得得武功：天刀九问",
    
    "Ｗ武功威力：600",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：280",
    "Ｗ武功范围：△ 7格",
    
    "Ｚ特别说明：",    
    "Ｗ根据天书数量提升威力杀气",
}

-- 忘情天书
ItemInfo[389]={
    "Ｌ习得内功：忘情天书",
    "Ｄ运功效果：",
    "Ｗ1书领悟：“天意”死亡时必触发“天意”复活一次",
    "Ｗ2书领悟：“水逝”增加冰封，冰封过50点概率发动“月映”冰冻5时序", 
    "Ｗ3书领悟：“火延”增加燃烧，燃烧过50点概率发动“日明”点燃目标",    
    "Ｗ4书领悟：“土掩”减伤30点，机率发动“风流”完全闪避攻击",         
    "Ｗ5书领悟：“云翳”必杀集气200，暴怒后20%概率“忘情无我”反弹全部伤害。", 
    "Ｗ◇时序回复1点流血。",
    "Ｗ◇时序回复2点生命，4点内力。", 
    "Ｚ特效：顾惜朝、萧秋水获得七本天书且学会了忘情天书后自动运功，云翳几率翻倍。",  
    "Ｗ学会剑华皈壹，修炼忘情天书一脉相承",
}

-- 玉碎掌
ItemInfo[390]={
    "Ｌ习得内功：玉碎掌",
 
 "Ｗ武功威力：1100",
 "Ｗ武功气攻：1200",
 "Ｗ内力消耗：350",
 "Ｗ武功范围：■ 5+5×5",
 "Ｗ武功特效：必冰封",
 
 "Ｄ组合特效：",
 "Ｎ",
 "Ｚ特别说明：",
}

-- 灵犀分水功
ItemInfo[393]={
    "Ｌ习得内功：灵犀分水功",
    "Ｎ",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ受到的伤害的一半50%概率由随机目标承担，如果承担伤害的目标是队友，则伤害变为回复。",
    "Ｗ受到冰封DEBUFF,则回复冰封值X2的生命值。", 
    "Ｗ攻击时如果造成冰封，伤害结果增加冰封值X2",    
    "Ｚ特效：使用天机宫武功必冰封。",
}

-- 绕指柔剑
ItemInfo[402]={
    "Ｌ习得武功：绕指柔剑",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ一脉相承",
    "Ｗ◇学习柔云剑法一脉相承",
    "Ｎ",                                     --小飞侠
    "Ｄ组合特效：",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 芙蓉金针功
ItemInfo[403]={
    "Ｌ习得武功：芙蓉金针",
    "Ｎ",
    "Ｗ武功威力：6",
    "Ｗ武功气攻：0",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 天霜拳
ItemInfo[404]={
    "Ｌ习得武功：天霜拳",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 流云掌
ItemInfo[405]={
    "Ｌ习得武功：流云掌",
    "Ｎ",
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：20",
    "Ｗ武功范围：十字4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 回风落雁剑
ItemInfo[406]={
    "Ｌ习得武功：回风落雁剑",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 衡山五神剑
ItemInfo[407]={
    "Ｌ习得武功：衡山五神剑",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：30",
    "Ｗ武功范围：《 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 三分神指
ItemInfo[408]={
    "Ｌ习得武功：三分神指",
    "Ｎ",
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：正方形4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 无妄神功
ItemInfo[409]={
    "Ｌ习得武功：无妄神咒",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：50",
    "Ｗ武功范围：正方形4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 神跌鬼倒
ItemInfo[410]={
    "Ｌ习得武功：神跌鬼倒",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：30",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 伏魔剑法
ItemInfo[411]={
    "Ｌ习得武功：伏魔剑法",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：25",
    "Ｗ武功范围：3格大米",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 天长掌法
ItemInfo[412]={
    "Ｌ习得武功：天长掌法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 春蚕掌法
ItemInfo[413]={
    "Ｌ习得武功：春蚕掌法",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：20",
    "Ｗ武功范围：米 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 降魔掌
ItemInfo[414]={
    "Ｌ习得武功：降魔掌",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：移米 2格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 参合剑气
ItemInfo[422]={
    "Ｌ习得武功：参合剑气",
    "Ｎ",
    "Ｗ武功威力：1400",
    "Ｗ武功气攻：1500",
    "Ｗ内力消耗：350",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｗ◇参合状态：增己伤10%-30%，减敌伤15%-30%", 
    "Ｗ◇学有参合剑并使用任何剑系武功即可，不需主运参合剑", 
    "Ｗ◇学会北斗剑法，修炼參合剑气一脉相承",
}

-- 北斗剑法
ItemInfo[423]={
    "Ｌ习得武功：北斗剑法",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：25",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ一脉相承",
    "Ｗ◇学习参合剑气一脉相承",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 降魔刀法
ItemInfo[424]={
    "Ｌ习得武功：降魔刀法",
    "Ｎ",
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：20",
    "Ｗ武功范围：△ 5格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 八卦游龙掌
ItemInfo[426]={
    "Ｌ习得武功：八卦游龙掌",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 大嵩阳掌
ItemInfo[429]={
    "Ｌ习得武功：大嵩阳掌",
    "Ｎ",
    "Ｗ武功威力：600",
    "Ｗ武功气攻：600",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 迅雷剑法
ItemInfo[433]={
    "Ｌ习得武功：迅雷剑法",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 易筋锻骨篇
ItemInfo[440]={
    "Ｌ习得内功：易筋锻骨篇",
    "Ｄ运功效果：",
    "Ｎ",
    "Ｗ◇【阴内专属】提升20%伤害，降低10%所承受伤害",
    "Ｗ◇【阴内专属】每时序额外回复5点生命值",
    "Ｎ",
    "Ｄ一脉相承",
    "Ｗ◇学习九阴真经一脉相承",
}

-- 一气化三清
ItemInfo[441]={
    "Ｌ习得武功：一气化三清",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 履霜破冰拳
ItemInfo[442]={
    "Ｌ习得武功：履霜破冰拳",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 金顶绵掌
ItemInfo[445]={
    "Ｌ习得武功：金顶绵掌",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 四象掌
ItemInfo[446]={
    "Ｌ习得武功：四象掌",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 佛光普照
ItemInfo[447]={
    "Ｌ习得武功：佛光普照",
    "Ｎ",
    "Ｗ武功威力：650",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 金顶九式
ItemInfo[448]={
    "Ｌ习得武功：金顶九式",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 霹雳雷火弹
ItemInfo[450]={
    "Ｌ习得武功：霹雳雷火弹",
    "Ｎ",
    "Ｗ武功威力：11",
    "Ｗ武功气攻：11",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 连环腐尸毒
ItemInfo[452]={
    "Ｌ习得武功：连环腐尸毒",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：米字 4格",
    "Ｗ◇连环腐尸毒·极意：攻击时有30%几率触发，暴怒必定触发",
    "Ｗ◇连环腐尸毒·极意：攻击范围变为面攻，追加1000气攻并引爆目标身上毒素",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇毒布武林：主运五毒神功，修炼五毒神掌/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
    "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
    "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

-- 碧磷针
ItemInfo[453]={
    "Ｌ习得武功：碧磷针",
    "Ｎ",
    "Ｗ武功威力：3",
    "Ｗ武功气攻：3",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 玉蜂针
ItemInfo[457]={
    "Ｌ习得武功：玉蜂针",
    "Ｎ",
    "Ｗ武功威力：6",
    "Ｗ武功气攻：6",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 冰魄银针
ItemInfo[458]={
    "Ｌ习得武功：冰魄银针",
    "Ｎ",
    "Ｗ武功威力：9",
    "Ｗ武功气攻：9",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 宁氏一剑
ItemInfo[459]={
    "Ｌ习得武功：宁氏一剑",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｚ特别说明：",      
    "Ｗ攻击时50%几率给敌人添加虚弱状态，暴怒必触发",
}

-- 玉女十九式
ItemInfo[460]={
    "Ｌ习得武功：玉女十九式",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 夺命连环三仙剑
ItemInfo[461]={
    "Ｌ习得武功：夺命连环三仙剑",
    "Ｎ",
    "Ｗ武功威力：1100",
    "Ｗ武功气攻：1100",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 混元掌
ItemInfo[463]={
    "Ｌ习得武功：混元掌",
    "Ｎ",
    "Ｗ武功威力：750",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：280",
    "Ｗ武功范围：■ 10+5×5格",
    "Ｎ",
    "学会混元掌：使用任何拳掌系武功50%几率散功1-5时序，不需主运混元掌",
}

-- 鹰蛇生死搏
ItemInfo[465]={
    "Ｌ习得武功：鹰蛇生死搏",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：米字 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 泼墨披麻剑
ItemInfo[466]={
    "Ｌ习得武功：泼墨披麻剑",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：", 
}

-- 七玹无形剑
ItemInfo[467]={
    "Ｌ习得武功：七玹无形剑",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：田 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 黑血神针功
ItemInfo[469]={
    "Ｌ习得武功：黑血神针功",
    "Ｎ",
    "Ｗ武功威力：9",
    "Ｗ武功气攻：9",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：", 
}

-- 葵花神针功
ItemInfo[470]={
    "Ｌ习得武功：葵花神针功",
    "Ｎ",
    "Ｗ武功威力：9",
    "Ｗ武功气攻：9",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 段家剑法
ItemInfo[471]={
    "Ｌ习得武功：段家剑法",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 五罗轻烟掌
ItemInfo[472]={
    "Ｌ习得武功：五罗轻烟掌",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 碧海潮生曲
ItemInfo[473]={
    "Ｌ习得武功：碧海潮生曲",
    "Ｎ",
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：田 6格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 奇门五转
ItemInfo[474]={
    "Ｌ习得内功：奇门五转",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇被攻击时5%几率将一半伤害转化为自身护盾",
    "Ｗ◇被攻击时5%几率将一半伤害转化为对方掉血",
    "Ｗ◇被攻击时5%几率将一半伤害转化为内力回复",
    "Ｗ◇被攻击时5%几率攻击转给随机敌方承受",
    "Ｗ◇被攻击时5%几率转移自身位置",
    "Ｗ◇被攻击时25%几率将杀气效果转由对方承受",
    "Ｗ◇武功威力提高5%",
    "Ｗ◇加力/护体/出招几率提高5%",
    "Ｗ◇气攻/气防提高5%",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 落英剑法
ItemInfo[477]={
    "Ｌ习得武功：落英剑法",
    "Ｎ",
    "Ｗ武功威力：500",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：0 田字",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 一字电剑
ItemInfo[478]={
    "Ｌ习得武功：一字电剑",
    "Ｎ",
    "Ｗ武功威力：350",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：线 7格",
    "Ｎ",
    "Ｗ◇学习周公剑法时可以一脉相承。",
}

-- 奇门遁甲
ItemInfo[479]={
    "Ｌ习得内功：奇门遁甲",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇弹指神通/落英神剑掌/玉箫剑法威力翻倍",
    "Ｗ◇被攻击时,30%概率将伤害的50%转化成护盾",
    "Ｗ◇集气速度+4",
    "Ｗ◇20%概率闪避",
}

-- 冰火阴阳诀
ItemInfo[480]={
    "Ｌ习得内功：冰火阴阳诀",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇攻击必灼烧",
    "Ｗ◇攻击必冰封",
    "Ｗ◇每次攻击附带30%概率点燃2-5时序效果，需阳内或天罡",
    "Ｗ◇每次攻击附带30%概率冰冻2-5时序效果，需阴内或天罡",
}

-- 碧海潮生功
ItemInfo[482]={
    "Ｌ习得内功：碧海潮生功",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇每次攻击杀内300点",
    
    "Ｎ",
    -- "Ｄ被动效果：",
    "Ｗ◇40%概率暴击",
    -- "Ｗ◇40%概率必破气防",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 临济十二庄
ItemInfo[483]={
    "Ｌ习得内功：临济十二庄",
    "Ｎ",
    "Ｄ运功效果：",
    "Ｗ◇攻击必连击,30%三连击",
    "Ｗ◇每3时序回复1点内伤",
    "Ｗ◇每时序回2点冰封",
    "Ｗ◇每时序回2点灼烧",
    "Ｗ◇每时序回2点流血",
    "Ｗ◇每时序回1点封穴",
    "Ｎ",
    --"Ｄ被动效果：",
    "Ｗ◇每时序回5点生命",
    "Ｗ◇每时序回10点内力",
    --"Ｗ◇50%几率用双倍内力抵消30%伤害",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 摧心掌
ItemInfo[485]={
    "Ｌ习得武功：摧心掌",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：280",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｎ",
    "Ｚ特别说明：",  
    "Ｗ学会九阴真经后威力翻倍",
}

-- 三蜈五蟆烟
ItemInfo[489]={
    "Ｌ习得武功：三蜈五蟆烟",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：500",
    "Ｗ内力消耗：60",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｗ学会三蜈五蟆烟，修炼灵蛇杖法一脉相承",
}

-- 金蛇锥功
ItemInfo[490]={
    "Ｌ习得武功：金蛇锥功",
    "Ｎ",
    "Ｗ武功威力：7",
    "Ｗ武功气攻：7",
    "Ｗ内力消耗：9",
    "Ｗ武功范围：点 10格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 千蛛万毒手
ItemInfo[491]={
    "Ｌ习得武功：千蛛万毒手",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：米字 4格",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇毒布武林：主运五毒神功，修炼五毒神掌/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
    "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
    "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
    "Ｎ",
    "Ｚ特别说明：",  
    "Ｗ攻击强制上毒20点，根据目标中毒值回复生命",
}

-- 五行六合拳
ItemInfo[492]={
    "Ｌ习得武功：五行六合拳",
    "Ｎ",
    "Ｗ武功威力：900",
    "Ｗ武功气攻：900",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：米字 4格",
    "Ｗ学会五行六合拳，修炼落英神剑掌一脉相承",
}

-- 大九天手
ItemInfo[497]={
    "Ｌ习得武功：大九天手",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：15",
    "Ｗ武功范围：米字 4格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 大伏魔拳
ItemInfo[499]={
    "Ｌ习得武功：大伏魔拳",
    "Ｎ",
    "Ｗ武功威力：1200",
    "Ｗ武功气攻：1200",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：十字 4格",
    "Ｎ",
    "Ｗ攻击时几率触发“天之道”，附加目标生命最大值5~10%的伤害",
    "Ｗ主运九阴真经时效果翻倍",  
    "Ｎ",    
    "Ｄ组合特效：",
    "Ｗ学会大伏魔拳：使用任何拳掌系武功50%几率给敌人添加5-10时序创伤（撕裂）debuff，不需主运大伏魔拳",
    "Ｗ学会无极玄功拳，修炼大伏魔拳一脉相承",
}

-- 分筋错骨手
ItemInfo[502]={
    "Ｌ习得武功：分筋错骨手",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 三阴蜈蚣爪
ItemInfo[503]={
    "Ｌ习得武功：三阴蜈蚣爪",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 玄女剑法
ItemInfo[504]={
    "Ｌ习得武功：玄女剑法",
    "Ｎ",
    "Ｗ武功威力：800",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：70",
    "Ｗ武功范围：《 5",
    "Ｎ",
    "Ｎ",
    "Ｚ特别说明：",   
    "Ｗ 【女性专属】伤害、气攻增加20%",
}

-- 狂风快剑
ItemInfo[505]={
    "Ｌ习得武功：狂风快剑",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 铁剑
ItemInfo[507]={
    "Ｌ习得武功：铁剑",
    "Ｎ",
    "Ｗ武功威力：1300",
    "Ｗ武功气攻：1300",
    "Ｗ内力消耗：140",
    "Ｗ武功范围：《 8",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫并主运铁布衫",
    "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 八卦掌
ItemInfo[508]={
    "Ｌ习得武功：八卦掌",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 大慈大悲手
ItemInfo[514]={
    "Ｌ习得武功：大慈大悲手",
    "Ｎ",
    "Ｗ武功威力：800",
    "Ｗ武功气攻：800",
    "Ｗ内力消耗：105",
    "Ｗ武功范围：3◆",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇慈悲为怀：同时修炼慈悲刀法和大慈大悲手",
    "Ｗ◇慈悲为怀：道德高于60时，如果伤害大于100减伤（道德-60）点",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 韦陀掌
ItemInfo[515]={
    "Ｌ习得武功：韦陀掌",
    "Ｎ",
    "Ｗ武功威力：300",
    "Ｗ武功气攻：300",
    "Ｗ内力消耗：30",
    "Ｗ武功范围：△ 2格",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 大阴阳手
ItemInfo[516]={
    "Ｌ习得武功：大阴阳手",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：30",
    "Ｗ武功范围：3十字 ",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 屠龙刀法
ItemInfo[517]={
    "Ｌ习得武功：屠龙刀法",
    "Ｎ",
    "Ｗ武功威力：1000",
    "Ｗ武功气攻：1000",
    "Ｗ内力消耗：210",
    "Ｗ武功范围：5直线 ",
    "Ｎ",
    "Ｚ特别说明：", 
    "Ｗ击杀小龙女不会触发复活",
}

-- 金龙鞭法
ItemInfo[519]={
    "Ｌ习得武功：金龙鞭法",
    "Ｎ",
    "Ｗ武功威力：400",
    "Ｗ武功气攻：400",
    "Ｗ内力消耗：10",
    "Ｗ武功范围：3井",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 碧针清掌
ItemInfo[520]={
    "Ｌ习得武功：碧针清掌",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：20",
    "Ｗ武功范围：3大米",
    "Ｎ",
    "Ｄ组合特效：无",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 剑华皈一
ItemInfo[525]={
    "Ｌ习得内功：剑华皈一",
    "Ｄ运功效果：",
    "Ｗ◇行动后扣除5%最大内力",
    "Ｗ◇使用剑法攻击时追加10%当前内力值伤害",    
    "Ｄ一脉相承",
    "Ｗ◇学习忘情天书一脉相承",
}

-- 铁布衫
ItemInfo[526]={
    "Ｌ习得内功：铁布衫",
    "Ｄ运功效果：",
    "Ｗ◇行动后扣除5%最大内力",
    "Ｗ◇护甲提升20%",
    "Ｗ◇承受伤害大于100时，减伤60点",
    "Ｄ组合特效：",
    "Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫并主运铁布衫",
    "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
    "Ｎ",
    "Ｚ特别说明：",
}

-- 释迦掷象功
ItemInfo[527]={
    "Ｌ习得武功：释迦掷象功",
    "Ｎ",
    "Ｗ武功威力：700",
    "Ｗ武功气攻：700",
    "Ｗ内力消耗：700",
    "Ｗ武功范围：5◆",
    "Ｎ",
    "Ｄ组合特效：",
    "Ｗ◇阿婆星：学会瑜伽密乘+释迦掷象功",
    "Ｗ◇阿婆星：主运会瑜伽密乘，释迦掷象功追加自身体质X50点伤害",     
    "Ｎ",
    "Ｚ特别说明：",
    "Ｗ必定单击",
}

-- 西岳神剑金
ItemInfo[535]={
    "Ｌ习得武功：西岳神剑金",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 中岳神剑土
ItemInfo[536]={
    "Ｌ习得武功：中岳神剑土",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 南岳神剑火
ItemInfo[537]={
    "Ｌ习得武功：南岳神剑火",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 东岳神剑木
ItemInfo[538]={
    "Ｌ习得武功：东岳神剑木",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 北岳神剑水
ItemInfo[539]={
    "Ｌ习得武功：北岳神剑水",
    "Ｎ",
    "Ｗ武功威力：",
    "Ｗ武功气攻：",
    "Ｗ内力消耗：",
    "Ｗ武功范围：",
    "Ｎ",
    "Ｄ组合特效：无",    
    "Ｎ",
    "Ｚ特别说明：",
}

-- 秘籍残章
ItemInfo[550]={
    "Ｌ物品说明：可以去燕子坞书阁换秘籍",
}

-- 阿青套装
ItemInfo[551]={"Ｌ青竹棒","Ｎ","Ｗ阿青套装◆青竹棒 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[552]={"Ｌ浅绿青衫","Ｎ","Ｗ阿青套装◆浅绿青衫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[553]={"Ｌ羊","Ｎ","Ｗ阿青套装◆羊 ","Ｗ◆套装特效  ","Ｎ",}

-- 白虎套装
ItemInfo[554]={"Ｌ飞天玉虎爪","Ｎ","Ｗ白虎套装◆飞天玉虎爪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[555]={"Ｌ驺虞皮裘","Ｎ","Ｗ白虎套装◆驺虞皮裘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[556]={"Ｌ驺虞","Ｎ","Ｗ白虎套装◆驺虞 ","Ｗ◆套装特效  ","Ｎ",}

-- 白驼套装
ItemInfo[557]={"Ｌ幻蝶扇","Ｎ","Ｗ白驼套装◆幻蝶扇 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[558]={"Ｌ绣金白袍","Ｎ","Ｗ白驼套装◆绣金白袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[559]={"Ｌ骆驼","Ｎ","Ｗ白驼套装◆骆驼 ","Ｗ◆套装特效  ","Ｎ",}

-- 北侠套装
ItemInfo[560]={"Ｌ沥泉盘龙枪","Ｎ","Ｗ北侠套装◆沥泉盘龙枪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[561]={"Ｌ龙神天铠","Ｎ","Ｗ北侠套装◆龙神天铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[562]={"Ｌ黑雕","Ｎ","Ｗ北侠套装◆黑雕 ","Ｗ◆套装特效  ","Ｎ",}

-- 碧波套装
ItemInfo[563]={"Ｌ九弦琴","Ｎ","Ｗ碧波套装◆九弦琴 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[564]={"Ｌ缀玉华裳","Ｎ","Ｗ碧波套装◆缀玉华裳 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[565]={"Ｌ猫","Ｎ","Ｗ碧波套装◆猫 ","Ｗ◆套装特效  ","Ｎ",}

-- 冰霜套装
ItemInfo[566]={"Ｌ金铃索带","Ｎ","Ｗ冰霜套装◆金铃索带 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[567]={"Ｌ雪羽披风","Ｎ","Ｗ冰霜套装◆雪羽披风 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[568]={"Ｌ九尾灵狐","Ｎ","Ｗ冰霜套装◆九尾灵狐 ","Ｗ◆套装特效  ","Ｎ",}

-- 波斯套装
ItemInfo[569]={"Ｌ乌兹钢刃","Ｎ","Ｗ波斯套装◆乌兹钢刃 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[570]={"Ｌ鳄神皮甲","Ｎ","Ｗ波斯套装◆鳄神皮甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[571]={"Ｌ鲨鱼","Ｎ","Ｗ波斯套装◆鲨鱼 ","Ｗ◆套装特效  ","Ｎ",}

-- 超风套装
ItemInfo[572]={"Ｌ毒龙银鞭","Ｎ","Ｗ超风套装◆毒龙银鞭 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[573]={"Ｌ素绸朱绫","Ｎ","Ｗ超风套装◆素绸朱绫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[574]={"Ｌ蛇蟋","Ｎ","Ｗ超风套装◆蛇蟋 ","Ｗ◆套装特效  ","Ｎ",}

-- 成昆套装
ItemInfo[575]={"Ｌ乾坤一气袋","Ｎ","Ｗ成昆套装◆乾坤一气袋 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[576]={"Ｌ化蕴神铠","Ｎ","Ｗ成昆套装◆化蕴神铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[577]={"Ｌ漆黑星","Ｎ","Ｗ成昆套装◆漆黑星 ","Ｗ◆套装特效  ","Ｎ",}

-- 承志套装
ItemInfo[578]={"Ｌ金蛇剑","Ｎ","Ｗ承志套装◆金蛇剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[579]={"Ｌ金丝背心","Ｎ","Ｗ承志套装◆金丝背心 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[580]={"Ｌ猩猩","Ｎ","Ｗ承志套装◆猩猩 ","Ｗ◆套装特效  ","Ｎ",}

-- 翠山套装
ItemInfo[581]={"Ｌ银钩铁划","Ｎ","Ｗ翠山套装◆银钩铁划 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[582]={"Ｌ火浣银纱","Ｎ","Ｗ翠山套装◆火浣银纱 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[583]={"Ｌ白熊","Ｎ","Ｗ翠山套装◆白熊 ","Ｗ◆套装特效  ","Ｎ",}

-- 翠羽套装
ItemInfo[584]={"Ｌ楼兰古剑","Ｎ","Ｗ翠羽套装◆楼兰古剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[585]={"Ｌ玉女云袖","Ｎ","Ｗ翠羽套装◆玉女云袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[586]={"Ｌ兀鹰","Ｎ","Ｗ翠羽套装◆兀鹰 ","Ｗ◆套装特效  ","Ｎ",}

-- 达摩套装
ItemInfo[587]={"Ｌ九仪天尊","Ｎ","Ｗ达摩套装◆九仪天尊 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[588]={"Ｌ辟法玄胄","Ｎ","Ｗ达摩套装◆辟法玄胄 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[589]={"Ｌ狻倪","Ｎ","Ｗ达摩套装◆狻倪 ","Ｗ◆套装特效  ","Ｎ",}

-- 刀王套装
ItemInfo[590]={"Ｌ井中水月","Ｎ","Ｗ刀王套装◆井中水月 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[591]={"Ｌ黄缠明锦","Ｎ","Ｗ刀王套装◆黄缠明锦 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[592]={"Ｌ照夜白","Ｎ","Ｗ刀王套装◆照夜白 ","Ｗ◆套装特效  ","Ｎ",}

-- 狄云套装
ItemInfo[593]={"Ｌ血刀","Ｎ","Ｗ狄云套装◆血刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[594]={"Ｌ乌蚕宝衣","Ｎ","Ｗ狄云套装◆乌蚕宝衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[595]={"Ｌ黄牛","Ｎ","Ｗ狄云套装◆黄牛 ","Ｗ◆套装特效  ","Ｎ",}

-- 东方套装
ItemInfo[596]={"Ｌ簪花绣针","Ｎ","Ｗ东方套装◆簪花绣针 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[597]={"Ｌ山河绣袍","Ｎ","Ｗ东方套装◆山河绣袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[598]={"Ｌ空速星痕","Ｎ","Ｗ东方套装◆空速星痕 ","Ｗ◆套装特效  ","Ｎ",}

-- 东邪套装
ItemInfo[599]={"Ｌ玉箫","Ｎ","Ｗ东邪套装◆玉箫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[600]={"Ｌ软猬宝甲","Ｎ","Ｗ东邪套装◆软猬宝甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[601]={"Ｌ白驼怪蛇","Ｎ","Ｗ东邪套装◆白驼怪蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 毒妇套装
ItemInfo[602]={"Ｌ柳叶银狐刀","Ｎ","Ｗ毒妇套装◆柳叶银狐刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[603]={"Ｌ玄罗轻袖","Ｎ","Ｗ毒妇套装◆玄罗轻袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[604]={"Ｌ金银血蛇","Ｎ","Ｗ毒妇套装◆金银血蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 段誉套装
ItemInfo[605]={"Ｌ阴阳扇","Ｎ","Ｗ段誉套装◆阴阳扇 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[606]={"Ｌ浅绿青衫","Ｎ","Ｗ段誉套装◆浅绿青衫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[607]={"Ｌ莽牯朱蛤","Ｎ","Ｗ段誉套装◆莽牯朱蛤 ","Ｗ◆套装特效  ","Ｎ",}

-- 鳄神套装
ItemInfo[608]={"Ｌ鳄嘴剪","Ｎ","Ｗ鳄神套装◆鳄嘴剪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[609]={"Ｌ鳄神皮甲","Ｎ","Ｗ鳄神套装◆鳄神皮甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[610]={"Ｌ鳄鱼","Ｎ","Ｗ鳄神套装◆鳄鱼 ","Ｗ◆套装特效  ","Ｎ",}

-- 飞狐套装
ItemInfo[611]={"Ｌ闯王军刀","Ｎ","Ｗ飞狐套装◆闯王军刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[612]={"Ｌ紫云战衣","Ｎ","Ｗ飞狐套装◆紫云战衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[613]={"Ｌ九尾灵狐","Ｎ","Ｗ飞狐套装◆九尾灵狐 ","Ｗ◆套装特效  ","Ｎ",}

-- 凤凰套装
ItemInfo[614]={"Ｌ凤屏孔雀翎","Ｎ","Ｗ凤凰套装◆凤屏孔雀翎 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[615]={"Ｌ九龙云胄","Ｎ","Ｗ凤凰套装◆九龙云胄 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[616]={"Ｌ狴犴","Ｎ","Ｗ凤凰套装◆狴犴 ","Ｗ◆套装特效  ","Ｎ",}

-- 芙华套装
ItemInfo[617]={"Ｌ金丝芙蓉镯","Ｎ","Ｗ芙华套装◆金丝芙蓉镯 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[618]={"Ｌ浮光锦裘","Ｎ","Ｗ芙华套装◆浮光锦裘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[619]={"Ｌ蛇蟋","Ｎ","Ｗ芙华套装◆蛇蟋 ","Ｗ◆套装特效  ","Ｎ",}

-- 蝠王套装
ItemInfo[620]={"Ｌ烂银鹤爪","Ｎ","Ｗ蝠王套装◆烂银鹤爪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[621]={"Ｌ雪羽披风","Ｎ","Ｗ蝠王套装◆雪羽披风 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[622]={"Ｌ黑玫瑰","Ｎ","Ｗ蝠王套装◆黑玫瑰 ","Ｗ◆套装特效  ","Ｎ",}

-- 丐王套装
ItemInfo[623]={"Ｌ打狗棒","Ｎ","Ｗ丐王套装◆打狗棒 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[624]={"Ｌ百结鹑衣","Ｎ","Ｗ丐王套装◆百结鹑衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[625]={"Ｌ漆黑星","Ｎ","Ｗ丐王套装◆漆黑星 ","Ｗ◆套装特效  ","Ｎ",}

-- 公孙套装
ItemInfo[626]={"Ｌ金刀黑剑","Ｎ","Ｗ公孙套装◆金刀黑剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[627]={"Ｌ幽旛魂锦","Ｎ","Ｗ公孙套装◆幽旛魂锦 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[628]={"Ｌ彩雪蛛","Ｎ","Ｗ公孙套装◆彩雪蛛 ","Ｗ◆套装特效  ","Ｎ",}

-- 郭襄套装
ItemInfo[629]={"Ｌ倚天剑","Ｎ","Ｗ郭襄套装◆倚天剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[630]={"Ｌ天都雾月","Ｎ","Ｗ郭襄套装◆天都雾月 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[631]={"Ｌ金钱豹","Ｎ","Ｗ郭襄套装◆金钱豹 ","Ｗ◆套装特效  ","Ｎ",}

-- 红药套装
ItemInfo[632]={"Ｌ绿波香露刀","Ｎ","Ｗ红药套装◆绿波香露刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[633]={"Ｌ九黎轻装","Ｎ","Ｗ红药套装◆九黎轻装 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[634]={"Ｌ羊","Ｎ","Ｗ红药套装◆羊 ","Ｗ◆套装特效  ","Ｎ",}

-- 胡斐套装
ItemInfo[635]={"Ｌ冷月宝刀","Ｎ","Ｗ胡斐套装◆冷月宝刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[636]={"Ｌ紫云战衣","Ｎ","Ｗ胡斐套装◆紫云战衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[637]={"Ｌ黑熊","Ｎ","Ｗ胡斐套装◆黑熊 ","Ｗ◆套装特效  ","Ｎ",}

-- 胡商套装
ItemInfo[638]={"Ｌ金龙鞭","Ｎ","Ｗ胡商套装◆金龙鞭 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[639]={"Ｌ金丝缎袍","Ｎ","Ｗ胡商套装◆金丝缎袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[640]={"Ｌ碧云霞","Ｎ","Ｗ胡商套装◆碧云霞 ","Ｗ◆套装特效  ","Ｎ",}

-- 黄蓉套装
ItemInfo[641]={"Ｌ打狗棒","Ｎ","Ｗ黄蓉套装◆打狗棒 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[642]={"Ｌ软猬宝甲","Ｎ","Ｗ黄蓉套装◆软猬宝甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[643]={"Ｌ白雕","Ｎ","Ｗ黄蓉套装◆白雕 ","Ｗ◆套装特效  ","Ｎ",}

-- 黄衫套装
ItemInfo[644]={"Ｌ卜天钻","Ｎ","Ｗ黄衫套装◆卜天钻 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[645]={"Ｌ黄缠明锦","Ｎ","Ｗ黄衫套装◆黄缠明锦 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[646]={"Ｌ黄骝自在","Ｎ","Ｗ黄衫套装◆黄骝自在 ","Ｗ◆套装特效  ","Ｎ",}

-- 火手套装
ItemInfo[647]={"Ｌ凝碧剑","Ｎ","Ｗ火手套装◆凝碧剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[648]={"Ｌ素绸朱绫","Ｎ","Ｗ火手套装◆素绸朱绫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[649]={"Ｌ豺狼","Ｎ","Ｗ火手套装◆豺狼 ","Ｗ◆套装特效  ","Ｎ",}

-- 霍山套装
ItemInfo[650]={"Ｌ圣火令","Ｎ","Ｗ霍山套装◆圣火令 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[651]={"Ｌ幽旛魂锦","Ｎ","Ｗ霍山套装◆幽旛魂锦 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[652]={"Ｌ菩斯曲蛇","Ｎ","Ｗ霍山套装◆菩斯曲蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 剑魔套装
ItemInfo[653]={"Ｌ木剑","Ｎ","Ｗ剑魔套装◆木剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[654]={"Ｌ山河绣袍","Ｎ","Ｗ剑魔套装◆山河绣袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[655]={"Ｌ神雕","Ｎ","Ｗ剑魔套装◆神雕 ","Ｗ◆套装特效  ","Ｎ",}

-- 剑神套装
ItemInfo[656]={"Ｌ九韶定音剑","Ｎ","Ｗ剑神套装◆九韶定音剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[657]={"Ｌ玄乌羽衣","Ｎ","Ｗ剑神套装◆玄乌羽衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[658]={"Ｌ天尊令","Ｎ","Ｗ剑神套装◆天尊令 ","Ｗ◆套装特效  ","Ｎ",}

-- 剑圣套装
ItemInfo[659]={"Ｌ木剑","Ｎ","Ｗ剑圣套装◆木剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[660]={"Ｌ飙风猿铠","Ｎ","Ｗ剑圣套装◆飙风猿铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[661]={"Ｌ猩猩","Ｎ","Ｗ剑圣套装◆猩猩 ","Ｗ◆套装特效  ","Ｎ",}

-- 剑仙套装
ItemInfo[662]={"Ｌ青竹棒","Ｎ","Ｗ剑仙套装◆青竹棒 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[663]={"Ｌ瑶池仙袖","Ｎ","Ｗ剑仙套装◆瑶池仙袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[664]={"Ｌ白猿","Ｎ","Ｗ剑仙套装◆白猿 ","Ｗ◆套装特效  ","Ｎ",}

-- 金刀套装
ItemInfo[665]={"Ｌ虎头金刀","Ｎ","Ｗ金刀套装◆虎头金刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[666]={"Ｌ肃霜宝裘","Ｎ","Ｗ金刀套装◆肃霜宝裘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[667]={"Ｌ黑雕","Ｎ","Ｗ金刀套装◆黑雕 ","Ｗ◆套装特效  ","Ｎ",}

-- 金环套装
ItemInfo[668]={"Ｌ龙凤子母环","Ｎ","Ｗ金环套装◆龙凤子母环 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[669]={"Ｌ金丝缎袍","Ｎ","Ｗ金环套装◆金丝缎袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[670]={"Ｌ灵獒","Ｎ","Ｗ金环套装◆灵獒 ","Ｗ◆套装特效  ","Ｎ",}

-- 金轮套装
ItemInfo[671]={"Ｌ五行轮","Ｎ","Ｗ金轮套装◆五行轮 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[672]={"Ｌ天蚕宝甲","Ｎ","Ｗ金轮套装◆天蚕宝甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[673]={"Ｌ彩雪蛛","Ｎ","Ｗ金轮套装◆彩雪蛛 ","Ｗ◆套装特效  ","Ｎ",}

-- 金蛇套装
ItemInfo[674]={"Ｌ金蛇剑","Ｎ","Ｗ金蛇套装◆金蛇剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[675]={"Ｌ凤凰织锦","Ｎ","Ｗ金蛇套装◆凤凰织锦 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[676]={"Ｌ金蛇","Ｎ","Ｗ金蛇套装◆金蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 九真套装
ItemInfo[677]={"Ｌ镔铁判官笔","Ｎ","Ｗ九真套装◆镔铁判官笔 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[678]={"Ｌ银狐披肩","Ｎ","Ｗ九真套装◆银狐披肩 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[679]={"Ｌ灵獒","Ｎ","Ｗ九真套装◆灵獒 ","Ｗ◆套装特效  ","Ｎ",}

-- 君子套装
ItemInfo[680]={"Ｌ君子剑","Ｎ","Ｗ君子套装◆君子剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[681]={"Ｌ钧天珑袖","Ｎ","Ｗ君子套装◆钧天珑袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[682]={"Ｌ踏霜白","Ｎ","Ｗ君子套装◆踏霜白 ","Ｗ◆套装特效  ","Ｎ",}

-- 崆峒套装
ItemInfo[683]={"Ｌ崆峒印","Ｎ","Ｗ崆峒套装◆崆峒印 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[684]={"Ｌ仙符法袍","Ｎ","Ｗ崆峒套装◆仙符法袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[685]={"Ｌ血蛙","Ｎ","Ｗ崆峒套装◆血蛙 ","Ｗ◆套装特效  ","Ｎ",}

-- 葵花套装
ItemInfo[686]={"Ｌ割鹿刀","Ｎ","Ｗ葵花套装◆割鹿刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[687]={"Ｌ雷绦纹帛","Ｎ","Ｗ葵花套装◆雷绦纹帛 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[688]={"Ｌ血鸟","Ｎ","Ｗ葵花套装◆血鸟 ","Ｗ◆套装特效  ","Ｎ",}

-- 力士套装
ItemInfo[689]={"Ｌ伏魔金杵","Ｎ","Ｗ力士套装◆伏魔金杵 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[690]={"Ｌ九黎轻装","Ｎ","Ｗ力士套装◆九黎轻装 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[691]={"Ｌ黄牛","Ｎ","Ｗ力士套装◆黄牛 ","Ｗ◆套装特效  ","Ｎ",}

-- 灵珊套装
ItemInfo[692]={"Ｌ碧水剑","Ｎ","Ｗ灵珊套装◆碧水剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[693]={"Ｌ玉女云袖","Ｎ","Ｗ灵珊套装◆玉女云袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[694]={"Ｌ照夜白","Ｎ","Ｗ灵珊套装◆照夜白 ","Ｗ◆套装特效  ","Ｎ",}

-- 灵素套装
ItemInfo[695]={"Ｌ银烟管","Ｎ","Ｗ灵素套装◆银烟管 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[696]={"Ｌ凝玉纱索","Ｎ","Ｗ灵素套装◆凝玉纱索 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[697]={"Ｌ莽牯朱蛤","Ｎ","Ｗ灵素套装◆莽牯朱蛤 ","Ｗ◆套装特效  ","Ｎ",}

-- 令狐套装
ItemInfo[698]={"Ｌ紫薇软剑","Ｎ","Ｗ令狐套装◆紫薇软剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[699]={"Ｌ钧天珑袖","Ｎ","Ｗ令狐套装◆钧天珑袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[700]={"Ｌ乌云盖雪","Ｎ","Ｗ令狐套装◆乌云盖雪 ","Ｗ◆套装特效  ","Ｎ",}

-- 龙女套装
ItemInfo[701]={"Ｌ淑女剑","Ｎ","Ｗ龙女套装◆淑女剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[702]={"Ｌ胧影织衣","Ｎ","Ｗ龙女套装◆胧影织衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[703]={"Ｌ玉蜂","Ｎ","Ｗ龙女套装◆玉蜂 ","Ｗ◆套装特效  ","Ｎ",}

-- 龙燕套装
ItemInfo[704]={"Ｌ北霸银鲨枪","Ｎ","Ｗ龙燕套装◆北霸银鲨枪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[705]={"Ｌ冰壁玉甲","Ｎ","Ｗ龙燕套装◆冰壁玉甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[706]={"Ｌ龙燕令","Ｎ","Ｗ龙燕套装◆龙燕令 ","Ｗ◆套装特效  ","Ｎ",}

-- 鹿杖套装
ItemInfo[707]={"Ｌ鹿角杖","Ｎ","Ｗ鹿杖套装◆鹿角杖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[708]={"Ｌ蚀魄幽铠","Ｎ","Ｗ鹿杖套装◆蚀魄幽铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[709]={"Ｌ黄犬","Ｎ","Ｗ鹿杖套装◆黄犬 ","Ｗ◆套装特效  ","Ｎ",}

-- 骆冰套装
ItemInfo[710]={"Ｌ鸳鸯宝刀","Ｎ","Ｗ骆冰套装◆鸳鸯宝刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[711]={"Ｌ玄罗轻袖","Ｎ","Ｗ骆冰套装◆玄罗轻袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[712]={"Ｌ银霜逐电","Ｎ","Ｗ骆冰套装◆银霜逐电 ","Ｗ◆套装特效  ","Ｎ",}

-- 马王套装
ItemInfo[713]={"Ｌ金龙鞭","Ｎ","Ｗ马王套装◆金龙鞭 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[714]={"Ｌ肃霜宝裘","Ｎ","Ｗ马王套装◆肃霜宝裘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[715]={"Ｌ追风黄","Ｎ","Ｗ马王套装◆追风黄 ","Ｗ◆套装特效  ","Ｎ",}

-- 蒙帝套装
ItemInfo[716]={"Ｌ铁鸳鸯","Ｎ","Ｗ蒙帝套装◆铁鸳鸯 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[717]={"Ｌ黑天魔铠","Ｎ","Ｗ蒙帝套装◆黑天魔铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[718]={"Ｌ九花虬","Ｎ","Ｗ蒙帝套装◆九花虬 ","Ｗ◆套装特效  ","Ｎ",}

-- 迷城套装
ItemInfo[719]={"Ｌ辉耀金斧","Ｎ","Ｗ迷城套装◆辉耀金斧 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[720]={"Ｌ驼纹金胄","Ｎ","Ｗ迷城套装◆驼纹金胄 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[721]={"Ｌ骆驼","Ｎ","Ｗ迷城套装◆骆驼 ","Ｗ◆套装特效  ","Ｎ",}

-- 闵柔套装
ItemInfo[722]={"Ｌ黑白双剑","Ｎ","Ｗ闵柔套装◆黑白双剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[723]={"Ｌ胧影织衣","Ｎ","Ｗ闵柔套装◆胧影织衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[724]={"Ｌ墨蹄玉兔","Ｎ","Ｗ闵柔套装◆墨蹄玉兔 ","Ｗ◆套装特效  ","Ｎ",}

-- 明王套装
ItemInfo[725]={"Ｌ东皇钟","Ｎ","Ｗ明王套装◆东皇钟 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[726]={"Ｌ计都荒寰","Ｎ","Ｗ明王套装◆计都荒寰 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[727]={"Ｌ战象","Ｎ","Ｗ明王套装◆战象 ","Ｗ◆套装特效  ","Ｎ",}

-- 明尊套装
ItemInfo[728]={"Ｌ圣火令","Ｎ","Ｗ明尊套装◆圣火令 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[729]={"Ｌ幽日煌袍","Ｎ","Ｗ明尊套装◆幽日煌袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[730]={"Ｌ金银血蛇","Ｎ","Ｗ明尊套装◆金银血蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 魔刀套装
ItemInfo[731]={"Ｌ圆月弯刀","Ｎ","Ｗ魔刀套装◆圆月弯刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[732]={"Ｌ黄泉祭衣","Ｎ","Ｗ魔刀套装◆黄泉祭衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[733]={"Ｌ狻倪","Ｎ","Ｗ魔刀套装◆狻倪 ","Ｗ◆套装特效  ","Ｎ",}

-- 魔神套装
ItemInfo[734]={"Ｌ苍狼天刃","Ｎ","Ｗ魔神套装◆苍狼天刃 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[735]={"Ｌ黑天魔铠","Ｎ","Ｗ魔神套装◆黑天魔铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[736]={"Ｌ飞云骓","Ｎ","Ｗ魔神套装◆飞云骓 ","Ｗ◆套装特效  ","Ｎ",}

-- 莫愁套装
ItemInfo[737]={"Ｌ银丝拂尘","Ｎ","Ｗ莫愁套装◆银丝拂尘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[738]={"Ｌ雾幻云袍","Ｎ","Ｗ莫愁套装◆雾幻云袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[739]={"Ｌ金钱豹","Ｎ","Ｗ莫愁套装◆金钱豹 ","Ｗ◆套装特效  ","Ｎ",}

-- 木桑套装
ItemInfo[740]={"Ｌ玄铁棋盘","Ｎ","Ｗ木桑套装◆玄铁棋盘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[741]={"Ｌ金丝背心","Ｎ","Ｗ木桑套装◆金丝背心 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[742]={"Ｌ黄骢骠","Ｎ","Ｗ木桑套装◆黄骢骠 ","Ｗ◆套装特效  ","Ｎ",}

-- 慕容套装
ItemInfo[743]={"Ｌ琥珀神环","Ｎ","Ｗ慕容套装◆琥珀神环 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[744]={"Ｌ紫灵天珠","Ｎ","Ｗ慕容套装◆紫灵天珠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[745]={"Ｌ御风乘黄","Ｎ","Ｗ慕容套装◆御风乘黄 ","Ｗ◆套装特效  ","Ｎ",}

-- 女娲套装
ItemInfo[746]={"Ｌ天蛇杖","Ｎ","Ｗ女娲套装◆天蛇杖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[747]={"Ｌ圣灵披风","Ｎ","Ｗ女娲套装◆圣灵披风 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[748]={"Ｌ圣灵珠","Ｎ","Ｗ女娲套装◆圣灵珠 ","Ｗ◆套装特效  ","Ｎ",}

-- 平之套装
ItemInfo[749]={"Ｌ偷天剑","Ｎ","Ｗ平之套装◆偷天剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[750]={"Ｌ雷绦纹帛","Ｎ","Ｗ平之套装◆雷绦纹帛 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[751]={"Ｌ小雪龙","Ｎ","Ｗ平之套装◆小雪龙 ","Ｗ◆套装特效  ","Ｎ",}

-- 破天套装
ItemInfo[752]={"Ｌ玄铁令","Ｎ","Ｗ破天套装◆玄铁令 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[753]={"Ｌ乌蚕宝衣","Ｎ","Ｗ破天套装◆乌蚕宝衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[754]={"Ｌ黄犬","Ｎ","Ｗ破天套装◆黄犬 ","Ｗ◆套装特效  ","Ｎ",}

-- 千尺套装
ItemInfo[755]={"Ｌ冥煌刺","Ｎ","Ｗ千尺套装◆冥煌刺 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[756]={"Ｌ百结鹑衣","Ｎ","Ｗ千尺套装◆百结鹑衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[757]={"Ｌ鳄鱼","Ｎ","Ｗ千尺套装◆鳄鱼 ","Ｗ◆套装特效  ","Ｎ",}

-- 青龙套装
ItemInfo[758]={"Ｌ北霸银鲨枪","Ｎ","Ｗ青龙套装◆北霸银鲨枪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[759]={"Ｌ紫金玄铠","Ｎ","Ｗ青龙套装◆紫金玄铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[760]={"Ｌ五彩神龙","Ｎ","Ｗ青龙套装◆五彩神龙 ","Ｗ◆套装特效  ","Ｎ",}

-- 清帝套装
ItemInfo[761]={"Ｌ血滴子","Ｎ","Ｗ清帝套装◆血滴子 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[762]={"Ｌ九龙云胄","Ｎ","Ｗ清帝套装◆九龙云胄 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[763]={"Ｌ玉花骢","Ｎ","Ｗ清帝套装◆玉花骢 ","Ｗ◆套装特效  ","Ｎ",}

-- 若兰套装
ItemInfo[764]={"Ｌ白玉瑶琴","Ｎ","Ｗ若兰套装◆白玉瑶琴 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[765]={"Ｌ银狐披肩","Ｎ","Ｗ若兰套装◆银狐披肩 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[766]={"Ｌ猫","Ｎ","Ｗ若兰套装◆猫 ","Ｗ◆套装特效  ","Ｎ",}

-- 三渡套装
ItemInfo[767]={"Ｌ黑狼鬼索","Ｎ","Ｗ三渡套装◆黑狼鬼索 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[768]={"Ｌ辟法玄胄","Ｎ","Ｗ三渡套装◆辟法玄胄 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[769]={"Ｌ战象","Ｎ","Ｗ三渡套装◆战象 ","Ｗ◆套装特效  ","Ｎ",}

-- 三丰套装
ItemInfo[770]={"Ｌ真武剑","Ｎ","Ｗ三丰套装◆真武剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[771]={"Ｌ神隐披风","Ｎ","Ｗ三丰套装◆神隐披风 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[772]={"Ｌ灵龟","Ｎ","Ｗ三丰套装◆灵龟 ","Ｗ◆套装特效  ","Ｎ",}

-- 三圣套装
ItemInfo[773]={"Ｌ焦尾琴","Ｎ","Ｗ三圣套装◆焦尾琴 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[774]={"Ｌ银华月缎","Ｎ","Ｗ三圣套装◆银华月缎 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[775]={"Ｌ仙鹤","Ｎ","Ｗ三圣套装◆仙鹤 ","Ｗ◆套装特效  ","Ｎ",}

-- 僧人套装
ItemInfo[776]={"Ｌ蟠龙金棍","Ｎ","Ｗ僧人套装◆蟠龙金棍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[777]={"Ｌ锦斓袈裟","Ｎ","Ｗ僧人套装◆锦斓袈裟 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[778]={"Ｌ小雪龙","Ｎ","Ｗ僧人套装◆小雪龙 ","Ｗ◆套装特效  ","Ｎ",}

-- 射雕套装
ItemInfo[779]={"Ｌ满月雕弓","Ｎ","Ｗ射雕套装◆满月雕弓 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[780]={"Ｌ驼纹金胄","Ｎ","Ｗ射雕套装◆驼纹金胄 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[781]={"Ｌ九花虬","Ｎ","Ｗ射雕套装◆九花虬 ","Ｗ◆套装特效  ","Ｎ",}

-- 神雕套装
ItemInfo[782]={"Ｌ玄铁剑","Ｎ","Ｗ神雕套装◆玄铁剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[783]={"Ｌ玄乌羽衣","Ｎ","Ｗ神雕套装◆玄乌羽衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[784]={"Ｌ菩斯曲蛇","Ｎ","Ｗ神雕套装◆菩斯曲蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 狮王套装
ItemInfo[785]={"Ｌ龙牙击","Ｎ","Ｗ狮王套装◆龙牙击 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[786]={"Ｌ驺虞皮裘","Ｎ","Ｗ狮王套装◆驺虞皮裘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[787]={"Ｌ白熊","Ｎ","Ｗ狮王套装◆白熊 ","Ｗ◆套装特效  ","Ｎ",}

-- 嵩阳套装
ItemInfo[788]={"Ｌ嵩阳铁剑","Ｎ","Ｗ嵩阳套装◆嵩阳铁剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[789]={"Ｌ紫练华衣","Ｎ","Ｗ嵩阳套装◆紫练华衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[790]={"Ｌ黑木令","Ｎ","Ｗ嵩阳套装◆黑木令 ","Ｗ◆套装特效  ","Ｎ",}

-- 苏荃套装
ItemInfo[791]={"Ｌ玄铁匕首","Ｎ","Ｗ苏荃套装◆玄铁匕首 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[792]={"Ｌ轻绸舞袖","Ｎ","Ｗ苏荃套装◆轻绸舞袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[793]={"Ｌ五彩神龙","Ｎ","Ｗ苏荃套装◆五彩神龙 ","Ｗ◆套装特效  ","Ｎ",}

-- 太白套装
ItemInfo[794]={"Ｌ昆仑镜","Ｎ","Ｗ太白套装◆昆仑镜 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[795]={"Ｌ飙风猿铠","Ｎ","Ｗ太白套装◆飙风猿铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[796]={"Ｌ白猿","Ｎ","Ｗ太白套装◆白猿 ","Ｗ◆套装特效  ","Ｎ",}

-- 桃花套装
ItemInfo[797]={"Ｌ峨嵋分水刺","Ｎ","Ｗ桃花套装◆峨嵋分水刺 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[798]={"Ｌ七色蝶裳","Ｎ","Ｗ桃花套装◆七色蝶裳 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[799]={"Ｌ汗血宝马","Ｎ","Ｗ桃花套装◆汗血宝马 ","Ｗ◆套装特效  ","Ｎ",}

-- 天池套装
ItemInfo[800]={"Ｌ剑盾珠索","Ｎ","Ｗ天池套装◆剑盾珠索 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[801]={"Ｌ银华月缎","Ｎ","Ｗ天池套装◆银华月缎 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[802]={"Ｌ豺狼","Ｎ","Ｗ天池套装◆豺狼 ","Ｗ◆套装特效  ","Ｎ",}

-- 天鹰套装
ItemInfo[803]={"Ｌ白虹剑","Ｎ","Ｗ天鹰套装◆白虹剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[804]={"Ｌ火浣银纱","Ｎ","Ｗ天鹰套装◆火浣银纱 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[805]={"Ｌ玉面火猴","Ｎ","Ｗ天鹰套装◆玉面火猴 ","Ｗ◆套装特效  ","Ｎ",}

-- 铁丑套装
ItemInfo[806]={"Ｌ精钢指套","Ｎ","Ｗ铁丑套装◆精钢指套 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[807]={"Ｌ荧煌明光","Ｎ","Ｗ铁丑套装◆荧煌明光 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[808]={"Ｌ冰蚕","Ｎ","Ｗ铁丑套装◆冰蚕 ","Ｗ◆套装特效  ","Ｎ",}

-- 铁手套装
ItemInfo[809]={"Ｌ金蜈钩","Ｎ","Ｗ铁手套装◆金蜈钩 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[810]={"Ｌ紫薇仙衣","Ｎ","Ｗ铁手套装◆紫薇仙衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[811]={"Ｌ金蛇","Ｎ","Ｗ铁手套装◆金蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 铁掌套装
ItemInfo[812]={"Ｌ冥煌刺","Ｎ","Ｗ铁掌套装◆冥煌刺 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[813]={"Ｌ紫金玄铠","Ｎ","Ｗ铁掌套装◆紫金玄铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[814]={"Ｌ追风黄","Ｎ","Ｗ铁掌套装◆追风黄 ","Ｗ◆套装特效  ","Ｎ",}

-- 顽童套装
ItemInfo[815]={"Ｌ毒针指环","Ｎ","Ｗ顽童套装◆毒针指环 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[816]={"Ｌ仙符法袍","Ｎ","Ｗ顽童套装◆仙符法袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[817]={"Ｌ鲨鱼","Ｎ","Ｗ顽童套装◆鲨鱼 ","Ｗ◆套装特效  ","Ｎ",}

-- 婉清套装
ItemInfo[818]={"Ｌ点钢峨嵋刺","Ｎ","Ｗ婉清套装◆点钢峨嵋刺 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[819]={"Ｌ舞风霓裳","Ｎ","Ｗ婉清套装◆舞风霓裳 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[820]={"Ｌ黑玫瑰","Ｎ","Ｗ婉清套装◆黑玫瑰 ","Ｗ◆套装特效  ","Ｎ",}

-- 文秀套装
ItemInfo[821]={"Ｌ金银小剑","Ｎ","Ｗ文秀套装◆金银小剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[822]={"Ｌ羊皮长袍","Ｎ","Ｗ文秀套装◆羊皮长袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[823]={"Ｌ踏霜白","Ｎ","Ｗ文秀套装◆踏霜白 ","Ｗ◆套装特效  ","Ｎ",}

-- 我行套装
ItemInfo[824]={"Ｌ真武剑","Ｎ","Ｗ我行套装◆真武剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[825]={"Ｌ绣金白袍","Ｎ","Ｗ我行套装◆绣金白袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[826]={"Ｌ血鸟","Ｎ","Ｗ我行套装◆血鸟 ","Ｗ◆套装特效  ","Ｎ",}

-- 无忌套装
ItemInfo[827]={"Ｌ屠龙刀","Ｎ","Ｗ无忌套装◆屠龙刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[828]={"Ｌ幽日煌袍","Ｎ","Ｗ无忌套装◆幽日煌袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[829]={"Ｌ血蛙","Ｎ","Ｗ无忌套装◆血蛙 ","Ｗ◆套装特效  ","Ｎ",}

-- 无名套装
ItemInfo[830]={"Ｌ九仪天尊","Ｎ","Ｗ无名套装◆九仪天尊 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[831]={"Ｌ神隐披风","Ｎ","Ｗ无名套装◆神隐披风 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[832]={"Ｌ驺虞","Ｎ","Ｗ无名套装◆驺虞 ","Ｗ◆套装特效  ","Ｎ",}

-- 五毒套装
ItemInfo[833]={"Ｌ蝎尾鞭","Ｎ","Ｗ五毒套装◆蝎尾鞭 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[834]={"Ｌ凝玉纱索","Ｎ","Ｗ五毒套装◆凝玉纱索 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[835]={"Ｌ花斑毒蝎","Ｎ","Ｗ五毒套装◆花斑毒蝎 ","Ｗ◆套装特效  ","Ｎ",}

-- 武当套装
ItemInfo[836]={"Ｌ白龙剑","Ｎ","Ｗ武当套装◆白龙剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[837]={"Ｌ玄武道装","Ｎ","Ｗ武当套装◆玄武道装 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[838]={"Ｌ青驴","Ｎ","Ｗ武当套装◆青驴 ","Ｗ◆套装特效  ","Ｎ",}

-- 西毒套装
ItemInfo[839]={"Ｌ天蛇杖","Ｎ","Ｗ西毒套装◆天蛇杖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[840]={"Ｌ计都荒寰","Ｎ","Ｗ西毒套装◆计都荒寰 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[841]={"Ｌ白驼怪蛇","Ｎ","Ｗ西毒套装◆白驼怪蛇 ","Ｗ◆套装特效  ","Ｎ",}

-- 西狂套装
ItemInfo[842]={"Ｌ玄铁剑","Ｎ","Ｗ西狂套装◆玄铁剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[843]={"Ｌ天瑞华绫","Ｎ","Ｗ西狂套装◆天瑞华绫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[844]={"Ｌ神雕","Ｎ","Ｗ西狂套装◆神雕 ","Ｗ◆套装特效  ","Ｎ",}

-- 惜花套装
ItemInfo[845]={"Ｌ海月清辉","Ｎ","Ｗ惜花套装◆海月清辉 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[846]={"Ｌ缀玉华裳","Ｎ","Ｗ惜花套装◆缀玉华裳 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[847]={"Ｌ九霄环佩","Ｎ","Ｗ惜花套装◆九霄环佩 ","Ｗ◆套装特效  ","Ｎ",}

-- 香香套装
ItemInfo[848]={"Ｌ玉剑","Ｎ","Ｗ香香套装◆玉剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[849]={"Ｌ轻绸舞袖","Ｎ","Ｗ香香套装◆轻绸舞袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[850]={"Ｌ碧云霞","Ｎ","Ｗ香香套装◆碧云霞 ","Ｗ◆套装特效  ","Ｎ",}

-- 襄儿套装
ItemInfo[851]={"Ｌ黑玉碎星镯","Ｎ","Ｗ襄儿套装◆黑玉碎星镯 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[852]={"Ｌ浮光锦裘","Ｎ","Ｗ襄儿套装◆浮光锦裘 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[853]={"Ｌ青驴","Ｎ","Ｗ襄儿套装◆青驴 ","Ｗ◆套装特效  ","Ｎ",}

-- 逍遥套装
ItemInfo[854]={"Ｌ伏羲琴","Ｎ","Ｗ逍遥套装◆伏羲琴 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[855]={"Ｌ瑶池仙袖","Ｎ","Ｗ逍遥套装◆瑶池仙袖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[856]={"Ｌ云狐","Ｎ","Ｗ逍遥套装◆云狐 ","Ｗ◆套装特效  ","Ｎ",}

-- 萧峰套装
ItemInfo[857]={"Ｌ锯齿钢盾","Ｎ","Ｗ萧峰套装◆锯齿钢盾 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[858]={"Ｌ龙神天铠","Ｎ","Ｗ萧峰套装◆龙神天铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[859]={"Ｌ狴犴","Ｎ","Ｗ萧峰套装◆狴犴 ","Ｗ◆套装特效  ","Ｎ",}

-- 小宝套装
ItemInfo[860]={"Ｌ罗刹火枪","Ｎ","Ｗ小宝套装◆罗刹火枪 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[861]={"Ｌ天蚕宝甲","Ｎ","Ｗ小宝套装◆天蚕宝甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[862]={"Ｌ玉花骢","Ｎ","Ｗ小宝套装◆玉花骢 ","Ｗ◆套装特效  ","Ｎ",}

-- 星宿套装
ItemInfo[863]={"Ｌ柔丝索","Ｎ","Ｗ星宿套装◆柔丝索 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[864]={"Ｌ黄泉祭衣","Ｎ","Ｗ星宿套装◆黄泉祭衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[865]={"Ｌ冰蚕","Ｎ","Ｗ星宿套装◆冰蚕 ","Ｗ◆套装特效  ","Ｎ",}

-- 虚竹套装
ItemInfo[866]={"Ｌ神农鼎","Ｎ","Ｗ虚竹套装◆神农鼎 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[867]={"Ｌ冥契法衣","Ｎ","Ｗ虚竹套装◆冥契法衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[868]={"Ｌ白鹿","Ｎ","Ｗ虚竹套装◆白鹿 ","Ｗ◆套装特效  ","Ｎ",}

-- 玄澄套装
ItemInfo[869]={"Ｌ降魔禅杖","Ｎ","Ｗ玄澄套装◆降魔禅杖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[870]={"Ｌ荧煌明光","Ｎ","Ｗ玄澄套装◆荧煌明光 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[871]={"Ｌ犀牛","Ｎ","Ｗ玄澄套装◆犀牛 ","Ｗ◆套装特效  ","Ｎ",}

-- 玄素套装
ItemInfo[872]={"Ｌ黑白双剑","Ｎ","Ｗ玄素套装◆黑白双剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[873]={"Ｌ黑缎笼衫","Ｎ","Ｗ玄素套装◆黑缎笼衫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[874]={"Ｌ乌云盖雪","Ｎ","Ｗ玄素套装◆乌云盖雪 ","Ｗ◆套装特效  ","Ｎ",}

-- 玄武套装
ItemInfo[875]={"Ｌ洞佩蝶恋花","Ｎ","Ｗ玄武套装◆洞佩蝶恋花 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[876]={"Ｌ玄武道装","Ｎ","Ｗ玄武套装◆玄武道装 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[877]={"Ｌ灵龟","Ｎ","Ｗ玄武套装◆灵龟 ","Ｗ◆套装特效  ","Ｎ",}

-- 血刀套装
ItemInfo[878]={"Ｌ血刀","Ｎ","Ｗ血刀套装◆血刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[879]={"Ｌ锦斓袈裟","Ｎ","Ｗ血刀套装◆锦斓袈裟 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[880]={"Ｌ黄骢骠","Ｎ","Ｗ血刀套装◆黄骢骠 ","Ｗ◆套装特效  ","Ｎ",}

-- 延庆套装
ItemInfo[881]={"Ｌ镔铁杖","Ｎ","Ｗ延庆套装◆镔铁杖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[882]={"Ｌ冰月皇衣","Ｎ","Ｗ延庆套装◆冰月皇衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[883]={"Ｌ醉人蜂","Ｎ","Ｗ延庆套装◆醉人蜂 ","Ｗ◆套装特效  ","Ｎ",}

-- 杨过套装
ItemInfo[884]={"Ｌ君子剑","Ｎ","Ｗ杨过套装◆君子剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[885]={"Ｌ黑缎笼衫","Ｎ","Ｗ杨过套装◆黑缎笼衫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[886]={"Ｌ黄骝自在","Ｎ","Ｗ杨过套装◆黄骝自在 ","Ｗ◆套装特效  ","Ｎ",}

-- 妖刀套装
ItemInfo[887]={"Ｌ妖刀村正","Ｎ","Ｗ妖刀套装◆妖刀村正 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[888]={"Ｌ化蕴神甲","Ｎ","Ｗ妖刀套装◆化蕴神甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[889]={"Ｌ黑木令","Ｎ","Ｗ妖刀套装◆黑木令 ","Ｗ◆套装特效  ","Ｎ",}

-- 一灯套装
ItemInfo[890]={"Ｌ铁浮屠","Ｎ","Ｗ一灯套装◆铁浮屠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[891]={"Ｌ冰月皇衣","Ｎ","Ｗ一灯套装◆冰月皇衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[892]={"Ｌ白雕","Ｎ","Ｗ一灯套装◆白雕 ","Ｗ◆套装特效  ","Ｎ",}

-- 仪琳套装
ItemInfo[893]={"Ｌ龙泉剑","Ｎ","Ｗ仪琳套装◆龙泉剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[894]={"Ｌ白练单衣","Ｎ","Ｗ仪琳套装◆白练单衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[895]={"Ｌ兔子","Ｎ","Ｗ仪琳套装◆兔子 ","Ｗ◆套装特效  ","Ｎ",}

-- 盈盈套装
ItemInfo[896]={"Ｌ燕语琴","Ｎ","Ｗ盈盈套装◆燕语琴 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[897]={"Ｌ七色蝶裳","Ｎ","Ｗ盈盈套装◆七色蝶裳 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[898]={"Ｌ墨蹄玉兔","Ｎ","Ｗ盈盈套装◆墨蹄玉兔 ","Ｗ◆套装特效  ","Ｎ",}

-- 语嫣套装
ItemInfo[899]={"Ｌ海月清辉","Ｎ","Ｗ语嫣套装◆海月清辉 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[900]={"Ｌ珠璃莹甲","Ｎ","Ｗ语嫣套装◆珠璃莹甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[901]={"Ｌ醉人蜂","Ｎ","Ｗ语嫣套装◆醉人蜂 ","Ｗ◆套装特效  ","Ｎ",}

-- 玉璧套装
ItemInfo[902]={"Ｌ逍遥神仙环","Ｎ","Ｗ玉璧套装◆逍遥神仙环 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[903]={"Ｌ珠璃莹甲","Ｎ","Ｗ玉璧套装◆珠璃莹甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[904]={"Ｌ仙鹤","Ｎ","Ｗ玉璧套装◆仙鹤 ","Ｗ◆套装特效  ","Ｎ",}

-- 玉女套装
ItemInfo[905]={"Ｌ铂丝掌套","Ｎ","Ｗ玉女套装◆铂丝掌套 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[906]={"Ｌ天瑞华绫","Ｎ","Ｗ玉女套装◆天瑞华绫 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[907]={"Ｌ玉蜂","Ｎ","Ｗ玉女套装◆玉蜂 ","Ｗ◆套装特效  ","Ｎ",}

-- 圆性套装
ItemInfo[908]={"Ｌ蟒神蛇鞭","Ｎ","Ｗ圆性套装◆蟒神蛇鞭 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[909]={"Ｌ紫练华衣","Ｎ","Ｗ圆性套装◆紫练华衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[910]={"Ｌ银霜逐电","Ｎ","Ｗ圆性套装◆银霜逐电 ","Ｗ◆套装特效  ","Ｎ",}

-- 远山套装
ItemInfo[911]={"Ｌ黑狼鬼索","Ｎ","Ｗ远山套装◆黑狼鬼索 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[912]={"Ｌ羊皮长袍","Ｎ","Ｗ远山套装◆羊皮长袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[913]={"Ｌ黑熊","Ｎ","Ｗ远山套装◆黑熊 ","Ｗ◆套装特效  ","Ｎ",}

-- 芸诗套装
ItemInfo[914]={"Ｌ轩辕剑","Ｎ","Ｗ芸诗套装◆轩辕剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[915]={"Ｌ圣灵披风","Ｎ","Ｗ芸诗套装◆圣灵披风 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[916]={"Ｌ云狐","Ｎ","Ｗ芸诗套装◆云狐 ","Ｗ◆套装特效  ","Ｎ",}

-- 赵敏套装
ItemInfo[917]={"Ｌ倚天剑","Ｎ","Ｗ赵敏套装◆倚天剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[918]={"Ｌ凤凰织锦","Ｎ","Ｗ赵敏套装◆凤凰织锦 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[919]={"Ｌ飞云骓","Ｎ","Ｗ赵敏套装◆飞云骓 ","Ｗ◆套装特效  ","Ｎ",}

-- 针神套装
ItemInfo[920]={"Ｌ暴雨梨花针","Ｎ","Ｗ针神套装◆暴雨梨花针 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[921]={"Ｌ冥契法衣","Ｎ","Ｗ针神套装◆冥契法衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[922]={"Ｌ兀鹰","Ｎ","Ｗ针神套装◆兀鹰 ","Ｗ◆套装特效  ","Ｎ",}

-- 芷若套装
ItemInfo[923]={"Ｌ毒龙银鞭","Ｎ","Ｗ芷若套装◆毒龙银鞭 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[924]={"Ｌ天都雾月","Ｎ","Ｗ芷若套装◆天都雾月 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[925]={"Ｌ兔子","Ｎ","Ｗ芷若套装◆兔子 ","Ｗ◆套装特效  ","Ｎ",}

-- 钟灵套装
ItemInfo[926]={"Ｌ秋水雁翎刀","Ｎ","Ｗ钟灵套装◆秋水雁翎刀 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[927]={"Ｌ舞风霓裳","Ｎ","Ｗ钟灵套装◆舞风霓裳 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[928]={"Ｌ闪电貂","Ｎ","Ｗ钟灵套装◆闪电貂 ","Ｗ◆套装特效  ","Ｎ",}

-- 重阳套装
ItemInfo[929]={"Ｌ七星龙渊剑","Ｎ","Ｗ重阳套装◆七星龙渊剑 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[930]={"Ｌ冰壁玉甲","Ｎ","Ｗ重阳套装◆冰壁玉甲 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[931]={"Ｌ犀牛","Ｎ","Ｗ重阳套装◆犀牛 ","Ｗ◆套装特效  ","Ｎ",}

-- 朱雀套装
ItemInfo[932]={"Ｌ朱雀神焰扇","Ｎ","Ｗ朱雀套装◆朱雀神焰扇 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[933]={"Ｌ雾幻云袍","Ｎ","Ｗ朱雀套装◆雾幻云袍 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[934]={"Ｌ白鹿","Ｎ","Ｗ朱雀套装◆白鹿 ","Ｗ◆套装特效  ","Ｎ",}

-- 紫衫套装
ItemInfo[935]={"Ｌ紫金珊瑚杖","Ｎ","Ｗ紫衫套装◆紫金珊瑚杖 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[936]={"Ｌ紫薇仙衣","Ｎ","Ｗ紫衫套装◆紫薇仙衣 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[937]={"Ｌ玉面火猴","Ｎ","Ｗ紫衫套装◆玉面火猴 ","Ｗ◆套装特效  ","Ｎ",}

-- 醉鹤套装
ItemInfo[938]={"Ｌ鹤嘴笔","Ｎ","Ｗ醉鹤套装◆鹤嘴笔 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[939]={"Ｌ蚀魄幽铠","Ｎ","Ｗ醉鹤套装◆蚀魄幽铠 ","Ｗ◆套装特效  ","Ｎ",}
ItemInfo[940]={"Ｌ花斑毒蝎","Ｎ","Ｗ醉鹤套装◆花斑毒蝎 ","Ｗ◆套装特效  ","Ｎ",}