-- 设置全局变量CC，保存游戏中使用的常数
function SetGlobalConst()
    -- 基本完整的SDL2键码，便于设置快捷键
    VK_ESCAPE = 27
    VK_SPACE = 32           -- 注意这里的空格实际上不需要定义，因为底层会自动把空格转换成回车
    VK_RETURN = 13
    VK_F1 = 1073741882
    VK_F2 = 1073741883
    VK_F3 = 1073741884
    VK_F4 = 1073741885
    VK_A = 97
    VK_B = 98
    VK_C = 99
    VK_D = 100
    VK_E = 101
    VK_F = 102
    VK_G = 103
    VK_H = 104
    VK_I = 105
    VK_J = 106
    VK_K = 107
    VK_L = 108
    VK_M = 109
    VK_N = 110
    VK_O = 111
    VK_P = 112
    VK_Q = 113
    VK_R = 114
    VK_S = 115
    VK_T = 116
    VK_U = 117
    VK_V = 118
    VK_W = 119
    VK_X = 120
    VK_Y = 121
    VK_Z = 122
    VK_BACKSPACE = 8
    VK_UP = 1073741906
    VK_DOWN = 1073741905
    VK_LEFT = 1073741904
    VK_RIGHT = 1073741903
    VK_PGUP = 1073741899
    VK_PGDN = 1073741902

    -- 游戏中颜色定义
    C_GRAY22 = Gra_RGB(68, 68, 68)
    C_BLUE = Gra_RGB(7, 99, 219)
    C_WSTM = Gra_RGB(0, 0, 0)                   -- 属性面板用
    C_CYGOLD = Gra_RGB(216, 214, 175)           -- 属性面板用
    C_STARTMENU = Gra_RGB(132, 0, 4)
    C_RED = Gra_RGB(216, 20, 24)                -- 红
    C_WHITE = Gra_RGB(236, 236, 236)            -- 白
    C_ORANGE = Gra_RGB(252, 148, 16)            -- 橘色
    C_GOLD = Gra_RGB(236, 200, 40)              -- 金
    C_BLACK = Gra_RGB(0, 0, 0)                  -- 黑色
    M_Black = Gra_RGB(0, 0, 0)                  -- 黑色
    M_Sienna = Gra_RGB(160, 82, 45)             -- 褐色
    M_DarkOliveGreen = Gra_RGB(85, 107, 47)     -- 深绿 
    M_DarkGreen = Gra_RGB(0, 100, 0)            -- 深绿
    M_DarkSlateBlue = Gra_RGB(72, 61, 139)      -- 板岩暗蓝灰色
    M_Navy = Gra_RGB(0, 0, 128)                 -- 海军蓝
    M_Indigo = Gra_RGB(75, 0, 130)              -- 靓蓝色
    M_DarkSlateGray = Gra_RGB(47, 79, 79)       -- 深青色
    M_DarkRed = Gra_RGB(139, 0, 0)              -- 深红
    M_DarkOrange = Gra_RGB(255, 140, 0)         -- 深橘色
    M_Olive = Gra_RGB(128, 128, 0)              -- 橄榄色
    M_Green = Gra_RGB(0, 128, 0)                -- 绿
    M_Teal = Gra_RGB(0, 128, 128)               -- 水绿
    M_Blue = Gra_RGB(0, 0, 255)                 -- 蓝
    M_SlateGray = Gra_RGB(112, 128, 144)        -- 灰石
    M_DimGray = Gra_RGB(105, 105, 105)          -- 暗灰
    M_Red = Gra_RGB(255, 0, 0)                  -- 红
    M_SandyBrown = Gra_RGB(244, 164, 96)        -- 黄褐色
    M_YellowGreen = Gra_RGB(154, 205, 50)       -- 黄绿
    M_SeaGreen = Gra_RGB(46, 139, 87)           -- 海 绿
    M_MediumTurquoise = Gra_RGB(72, 209, 204)   -- 宝石绿
    M_RoyalBlue = Gra_RGB(65, 105, 225)         -- 宝蓝色
    M_Purple = Gra_RGB(128, 0, 128)             -- 紫
    M_Gray = Gra_RGB(128, 128, 128)             -- 灰
    M_Magenta = Gra_RGB(255, 0, 255)            -- 洋红
    M_Orange = Gra_RGB(255, 165, 0)             -- 橘色
    M_Yellow = Gra_RGB(255, 255, 0)             -- 黄
    M_Lime = Gra_RGB(0, 255, 0)                 -- 石灰
    M_Cyan = Gra_RGB(0, 255, 255)               -- 青色/蓝绿
    M_DeepSkyBlue = Gra_RGB(0, 191, 255)        -- 深天蓝
    M_DarkOrchid = Gra_RGB(153, 50, 204)        -- 深兰花紫 
    M_Silver = Gra_RGB(192, 192, 192)           -- 银色
    M_Pink = Gra_RGB(255, 192, 203)             -- 粉
    M_Wheat = Gra_RGB(245, 222, 179)            -- 小麦色
    M_Wheat2 = Gra_RGB(205, 182, 139)           -- 小麦色
    M_LemonChiffon = Gra_RGB(255, 250, 205)     -- 柠檬色
    M_PaleGreen = Gra_RGB(152, 251, 152)        -- 苍绿
    M_PaleTurquoise = Gra_RGB(175, 238, 238)    -- 宝石绿
    M_LightBlue = Gra_RGB(173, 216, 230)        -- 浅蓝
    M_Plum = Gra_RGB(221, 160, 221)             -- 紫红葡萄
    M_White = Gra_RGB(255, 255, 255)            -- 白
    MilkWhite =Gra_RGB(255, 255, 204)           -- 奶白
    LimeGreen = Gra_RGB(100,200, 90)            -- 灰灰绿
    Lime = Gra_RGB(0,255,0)                     -- 石灰
    LightGreen = Gra_RGB(144,238,144)           -- 浅绿
    LightSkyBlue = Gra_RGB(135,206,250)         -- 深空蓝
    green1 = Gra_RGB(145, 235, 45)              -- 绿色1
    OliveDrab = Gra_RGB(107, 142, 35)           -- 绿褐色
    Snow3 = Gra_RGB(205, 201, 201)              -- 雪银
    grey21 = Gra_RGB(54, 54, 54)                -- 灰
    LightSlateBlue = Gra_RGB(132, 112, 255)     -- 浅石蓝
    Violet = Gra_RGB(208, 152, 208)             -- 紫罗兰
    PinkRed = Gra_RGB(255, 102, 102)            -- 粉红
    LightPurple = Gra_RGB(165, 28, 218)         -- 深紫
    Color_Hurt1 = Gra_RGB(255, 215, 0)          -- 金
    TG_Red = Gra_RGB(216, 20, 24)               -- 红色
    TG_Red_Bright = Gra_RGB(248, 40, 44)        -- 亮红
    Dark_Gold = Gra_RGB(216, 180, 20)           -- 黑金
    S_Yellow = Gra_RGB(245, 215, 15)            -- 深黄
    LightYellow = Gra_RGB(255, 242, 204)        -- 浅黄
    LightYellow2 = Gra_RGB(255, 229, 153)       -- 浅黄
    LightYellow3 = Gra_RGB(255, 217, 102)       -- 浅黄2

    -- 游戏状态定义
    GAME_START = 0          -- 开始画面
    GAME_FIRSTMMAP = 1      -- 第一次显示大地图
    GAME_MMAP = 2           -- 主地图
    GAME_FIRSTSMAP = 3      -- 第一次显示场景地图
    GAME_SMAP = 4           -- 场景地图
    GAME_WMAP = 5           -- 战斗地图
    GAME_DEAD = 6           -- 死亡画面
    GAME_END  = 7           -- 结束
    GAME_NEWNAME = 8        -- 开启新游戏

    -- 游戏数据全局变量
    cc = {}                 -- 定义游戏中使用的常量，这些可以在修改游戏时修改之

    -- 实际的屏幕宽度与高度
    cc.screen_w = lib.GetScreenW()          -- 窗口设定的最大宽度
    cc.screen_h = lib.GetScreenH()          -- 窗口设定的最大高度
    cc.src_char_set = 0                     -- 源代码的字符集，0：gb，1：big5，用于转换R×。如果源码被转换为big5，则应设为1
    cc.os_char_set = CONFIG.CharSet         -- OS字符集，-1：系统判断，0：GB, 1：Big5
    cc.font_name = CONFIG.FontName          -- 显示字体

    -- 定义记录文件名。S和D由于是固定大小，因此不再定义idx了
    -- 进度文件(对话事件战斗等编辑器缺省读取的进度文件)
    cc.r_idx_filename = {[0] = CONFIG.DataPath .. "ranger.idx"}
    cc.r_grp_filename = {[0] = CONFIG.DataPath .. "ranger.grp"}
    -- 战斗地图结构文件
    cc.s_filename = {[0] = CONFIG.DataPath .. "allsin.grp"}
    cc.d_filename = {[0] = CONFIG.DataPath .. "alldef.grp"}
    -- 存档路劲
    cc.save_path = CONFIG.DataPath .. "save/"
    cc.r_grp = cc.save_path.."r%d.grp"
    cc.s_grp = cc.save_path.."s%d.grp"
    cc.d_grp = cc.save_path.."d%d.grp"
    cc.cs = cc.save_path.."tjm"
    cc.save_num = 10         -- 存档数量为10
    cc.temp_s_filename = CONFIG.DataPath .. "allsinbk.grp"
    cc.palette_file = CONFIG.DataPath .. "mmap.col"              -- 256调色板
    cc.title_image = CONFIG.PicturePath .. "title.png"          -- 游戏开始画面1
    cc.game_start_file = CONFIG.PicturePath .. "GAMESTAR.png"     -- 游戏开始画面2
    cc.bg01_file = CONFIG.PicturePath .. "bg01.png"              -- 游戏开始画面3
    cc.say_box_nm_file = CONFIG.PicturePath .. "sayboxnm.png"      -- 对话框1
    cc.say_box_file = CONFIG.PicturePath .. "saybox.png"          -- 对话框2
    cc.dead_image = CONFIG.PicturePath .. "dead.png"              -- 战败画面
    cc.jy_xx_file = CONFIG.PicturePath .. "jyxx.png"              -- 战场组件
    cc.mmap_file = {                                             -- 大地图
        CONFIG.DataPath .. "earth.002",
        CONFIG.DataPath .. "surface.002",
        CONFIG.DataPath .. "building.002",
        CONFIG.DataPath .. "buildx.002",
        CONFIG.DataPath .. "buildy.002"
    }

    -- 各种贴图文件名，扩展名必须为idx/grp
    cc.mmap_pic_file = {CONFIG.DataPath .. "mmap.idx", CONFIG.DataPath .. "mmap.grp"}         -- 主地图贴图
    cc.smap_pic_file = {CONFIG.DataPath .. "smap.idx", CONFIG.DataPath .. "smap.grp"}         -- 场景贴图
    cc.wmap_pic_file = {CONFIG.DataPath .. "wmap.idx", CONFIG.DataPath .. "wmap.grp"}         -- 战场贴图
    cc.eft_file = {CONFIG.DataPath .. "eft.idx", CONFIG.DataPath .. "eft.grp"}               -- 特效贴图
    cc.eft_path = CONFIG.DataPath .. "eft/"             -- 特效贴图
    cc.eft_num = 6000
    cc.bj = {CONFIG.DataPath .. "bj.idx", CONFIG.DataPath .. "bj.grp"}
    cc.fight_pic_file = {CONFIG.DataPath .. "fight/fight%03d.idx", CONFIG.DataPath .. "fight/fight%03d.grp"}          -- 战斗贴图
    cc.body_path = CONFIG.DataPath .. "body/"        -- 人物身体图案
    cc.body_num = 1110
    cc.head_path = CONFIG.DataPath .. "head/"        -- 人物头像图案
    cc.head_num = 1110
    cc.thing_pic_file = {CONFIG.DataPath .. "thing.idx", CONFIG.DataPath .. "thing.grp"}      -- 物品贴图
    cc.thing_path = CONFIG.DataPath .. "thing/"         -- 物品贴图
    cc.thing_num = 1110
    cc.icon_path = CONFIG.DataPath .. "icons/"       -- 图标图案
    cc.icon_num = 1010;
    cc.xt_path = CONFIG.DataPath .. "xt/"            -- 其他图案
    cc.xt_num = 1100;    
    cc.ui_path = CONFIG.PicturePath .. "ui/"            -- UI图案
    cc.ui_num = 1100;
    cc.thing_path = CONFIG.DataPath .. "thing/"      -- 物品图案
    cc.thing_num = 1100;
    cc.pt_path = CONFIG.DataPath .. "portrait/"
    cc.pt_num = 1100;
    cc.bj_path = CONFIG.DataPath .. "bj/"            -- 其他UI图案
    cc.bj_num = 1100;
    CONFIG.help_path = CONFIG.DataPath .. "gl/"      -- 帮助文档
    -- cc.EFTPath = CONFIG.DataPath .. "eft/"       -- 特效图案
    -- cc.EFTNum = 5500

    if CONFIG.MP3 == 1 then
        cc.midi_file = CONFIG.SoundPath .. "game%02d.mp3"
    else
        cc.midi_file = CONFIG.SoundPath .. "game%02d.mid"
    end
    cc.ogg_file = CONFIG.SoundPath .. "game%02d.ogg"
    cc.atk_file = CONFIG.SoundPath .. "atk%02d.wav"
    cc.e_file = CONFIG.SoundPath .. "e%02d.wav"
    -- 战斗
    cc.war_file = CONFIG.DataPath .. "war.sta"
    cc.war_map_file = {CONFIG.DataPath .. "warfld.idx",
                    CONFIG.DataPath .. "warfld.grp"}
    -- 对话
    cc.trp = CONFIG.DataPath.."talk.grp"
    cc.tdx = CONFIG.DataPath.."talk.idx"
    cc.acvmts = CONFIG.DataPath .. "achievements"               -- 成就

    -- 定义记录文件R×结构
    -- lua不支持结构，无法直接从二进制文件中读取，因此需要这些定义，用table中不同的名字来仿真结构
    cc.per_num = 1000                -- 人物总数量
    cc.team_num = 15                 -- 队伍人数
    cc.my_thing_num = 950             -- 主角物品数量
    cc.week = 1                     -- 周目
    cc.version = "v2000"                 -- 版本号
    cc.timer = {                    -- 动态显示提示
        stime = 0,
        status = 0,
        str = "",
        len = 0,
        fun = demostr,
    }
    cc.run_str = {                   -- 动态显示的内容
        '快捷键 F1-马车 F3-队列 F4-整理物品 H-回家',
        '多培养一些队友，可以让你后面的战斗更轻松',
        '千年灵芝是能增加体质的药品，人物体质跟主运内功决定人物生命最大值，体质最多可以提升到15点',
        '更新下载问题反馈请加 QQ群号：865420131',
        '本游戏部分素材取自铁血丹心论坛/游侠网/人在江湖/金书红颜录/黑山群侠传/金书群侠传',
        '小村的厨灶和炼丹炉可以制作药品',
    }
    cc.tjmsj = {}
    cc.tjm = 0
    cc.hslj = {}
    cc.hslj2 = {}
	cc.tg = {}								-- 天关
	cc.tgjl = {}							-- 天关奖励
	cc.commodity = {
		{343, 600, 0, '可重新选择天赋内功', 0},
		{344, 600, 0, '可重新选择天赋轻功', 0},
		{345, 600, 0, '可重新选择天赋外功', 0},
		{346, 600, 0, '可使用四大山战斗魔性', 0},
		{281, 600, 0, '可在小村商人处换银子', 0},
	}

    cc.base_s = {}                          -- 保存基本数据的结构
    -- 起始位置（从0开始），数据类型（0有符号，1无符号，2字符串），长度
    cc.base_s["乘船"] = {0, 0, 2}
    cc.base_s["无用"] = {2, 0, 2}
    cc.base_s["人X"] = {4, 0, 2}
    cc.base_s["人Y"] = {6, 0, 2}
    cc.base_s["人X1"] = {8, 0, 2}
    cc.base_s["人Y1"] = {10, 0, 2}
    cc.base_s["人方向"] = {12, 0, 2}
    cc.base_s["船X"] = {14, 0, 2}
    cc.base_s["船Y"] = {16, 0, 2}
    cc.base_s["船X1"] = {18, 0, 2}
    cc.base_s["船Y1"] = {20, 0, 2}
    cc.base_s["船方向"] = {22, 0, 2}
    cc.base_s["难度"] = {24, 0, 2}
    cc.base_s["标准"] = {26, 0, 2}
    cc.base_s["畅想"] = {28, 0, 2}
    cc.base_s["特殊"] = {30, 0, 2}
    cc.base_s["单通"] = {32, 0, 2}
    cc.base_s["周目"] = {34, 0, 2}
    cc.base_s["天书数量"] = {36, 0, 2}
    cc.base_s["武功数量"] = {38, 0, 2}
    cc.base_s["碎片"] = {40, 0, 2}
    cc.base_s["备用5"] = {42, 0, 2}
    cc.base_s["备用4"] = {44, 0, 2}
    cc.base_s["备用3"] = {46, 0, 2}
    cc.base_s["备用2"] = {48, 0, 2}
    cc.base_s["备用1"] = {50, 0, 2}
    for i = 1, cc.team_num do
        cc.base_s["队伍" .. i] = {52 + 2 * (i - 1), 0, 2}
    end
    for i = 1, cc.my_thing_num do
        cc.base_s["物品" .. i] = {82 + 4 * (i - 1), 0, 2}
        cc.base_s["物品数量" .. i] = {82 + 4 * (i - 1) + 2, 0, 2}
    end

    cc.person_size = 602                     -- 每个人物数据占用字节
    cc.person_s = {}                        -- 保存人物数据的结构
    cc.person_s["代号"] = {0, 0, 2}
    cc.person_s["头像代号"] = {2, 0, 2}
    cc.person_s["生命增长"] = {4, 0, 2}
    cc.person_s["无用"] = {6, 0, 2}
    cc.person_s["姓名"] = {8, 2, 10}
    cc.person_s["外号"] = {18, 2, 10}
    cc.person_s["性别"] = {28, 0, 2}
    cc.person_s["等级"] = {30, 0, 2}
    cc.person_s["经验"] = {32, 1, 2}
    cc.person_s["生命"] = {34, 0, 2}
    cc.person_s["生命最大值"] = {36, 0, 2}
    cc.person_s["受伤程度"] = {38, 0, 2}
    cc.person_s["中毒程度"] = {40, 0, 2}
    cc.person_s["体力"] = {42, 0, 2}
    cc.person_s["物品修炼点数"] = {44, 0, 2}
    cc.person_s["武器"] = {46, 0, 2}
    cc.person_s["防具"] = {48, 0, 2}
    for i = 1, 5 do
        cc.person_s["出招动画帧数" .. i] = {50 + 2 * (i - 1), 0, 2}
        cc.person_s["出招动画延迟" .. i] = {60 + 2 * (i - 1), 0, 2}
        cc.person_s["武功音效延迟" .. i] = {70 + 2 * (i - 1), 0, 2}
    end
    cc.person_s["内力性质"] = {80, 0, 2}
    cc.person_s["内力"] = {82, 0, 2}
    cc.person_s["内力最大值"] = {84, 0, 2}
    cc.person_s["攻击力"] = {86, 0, 2}
    cc.person_s["轻功"] = {88, 0, 2}
    cc.person_s["防御力"] = {90, 0, 2}
    cc.person_s["医疗"] = {92, 0, 2}
    cc.person_s["用毒"] = {94, 0, 2}
    cc.person_s["解毒"] = {96, 0, 2}
    cc.person_s["抗毒"] = {98, 0, 2}
    cc.person_s["拳掌"] = {100, 0, 2}
    cc.person_s["指法"] = {102, 0, 2}
    cc.person_s["御剑"] = {104, 0, 2}
    cc.person_s["耍刀"] = {106, 0, 2}
    cc.person_s["奇门"] = {108, 0, 2}
    cc.person_s["暗器"] = {110, 0, 2}
    cc.person_s["武学常识"] = {112, 0, 2}
    cc.person_s["品德"] = {114, 0, 2}
    cc.person_s["攻击带毒"] = {116, 0, 2}
    cc.person_s["左右互博"] = {118, 0, 2}
    cc.person_s["声望"] = {120, 0, 2}
    cc.person_s["资质"] = {122, 0, 2}
    cc.person_s["修炼物品"] = {124, 0, 2}
    cc.person_s["修炼点数"] = {126, 0, 2}
    for i = 1, 15 do
        cc.person_s["所会武功" .. i] = {128 + 2 * (i - 1), 0, 2}
        cc.person_s["所会武功等级" .. i] = {158 + 2 * (i - 1), 0, 2}
    end
    for i = 1, 4 do
        cc.person_s["携带物品" .. i] = {188 + 2 * (i - 1), 0, 2}
        cc.person_s["携带物品数量" .. i] = {196 + 2 * (i - 1), 0, 2}
    end
    for i = 1, 2 do
        cc.person_s["天赋外功" .. i] = {204 + 2 * (i - 1), 0, 2}
    end
    cc.person_s["属性点数"] = {208, 0, 2}
    cc.person_s["武学点数"] = {210, 0, 2}
    cc.person_s["天赋内功"] = {212, 0, 2}
    cc.person_s["天赋轻功"] = {214, 0, 2}
    cc.person_s["实战"] = {216, 0, 2}
    cc.person_s["出战"] = {218, 0, 2}
    cc.person_s["命中"] = {220, 0, 2}
    cc.person_s["主运内功"] = {222, 0, 2}
    cc.person_s["主运轻功"] = {224, 0, 2}
    cc.person_s["六如觉醒"] = {226, 0, 2}
    cc.person_s["个人觉醒"] = {228, 0, 2}
    cc.person_s["畅想分阶"] = {230, 0, 2}
    cc.person_s["外号2"] = {232, 2, 10}
    cc.person_s["灼烧程度"] = {242, 0, 2}
    cc.person_s["冰封程度"] = {244, 0, 2}
    cc.person_s["论剑奖励"] = {246, 0, 2}
    cc.person_s["血量翻倍"] = {248, 0, 2}
    cc.person_s["行为模式"] = {250, 0, 2}
    cc.person_s["优先使用"] = {252, 0, 2}
    cc.person_s["是否吃药"] = {254, 0, 2}
    cc.person_s["能量"] = {256, 0, 2}
    cc.person_s["格挡"] = {258, 0, 2}
    cc.person_s["特色指令"] = {260, 0, 2}
    cc.person_s["坐骑"] = {262, 0, 2}
    cc.person_s["中庸"] = {264, 0, 2}
    cc.person_s["半身像"] = {266, 0, 2}
    cc.person_s["迷踪步"] = {268, 0, 2}
    cc.person_s["门派"] = {270, 0, 2}
    cc.person_s["心魔"] = {272, 0, 2}
    for i = 1, 25 do
        cc.person_s["拳掌奇穴等级" .. i] = {274 + 2 * (i - 1), 0, 2}
        cc.person_s["指法奇穴等级" .. i] = {324 + 2 * (i - 1), 0, 2}
        cc.person_s["御剑奇穴等级" .. i] = {374 + 2 * (i - 1), 0, 2}
        cc.person_s["耍刀奇穴等级" .. i] = {424 + 2 * (i - 1), 0, 2}
        cc.person_s["奇门奇穴等级" .. i] = {474 + 2 * (i - 1), 0, 2}
        cc.person_s["内功奇穴等级" .. i] = {524 + 2 * (i - 1), 0, 2}
    end
    for i = 1, 150 do
        cc.person_s["武功招式" .. i] = {574 + 2 * (i - 1), 0, 2}
    end
    cc.person_s["门派位阶"] = {874, 0, 2}
    for i = 1, 8 do
        cc.person_s["门派技能" .. i] = {876 + 2 * (i - 1), 0, 2}
    end
    cc.person_s["流血程度"] = {892, 0, 2}
    cc.person_s["封穴程度"] = {894, 0, 2}

    cc.thing_size = 202                      -- 每个物品数据占用字节
    cc.thing_s = {}                         -- 保存物品数据的结构
    cc.thing_s["代号"] = {0, 0, 2}
    cc.thing_s["名称"] = {2, 2, 20}
    cc.thing_s["名称2"] = {22, 2, 20}
    cc.thing_s["物品说明"] = {42, 2, 30}
    cc.thing_s["练出武功"] = {72, 0, 2}
    cc.thing_s["暗器动画编号"] = {74, 0, 2}
    cc.thing_s["使用人"] = {76, 0, 2}
    cc.thing_s["装备类型"] = {78, 0, 2}
    cc.thing_s["显示物品说明"] = {80, 0, 2}
    cc.thing_s["类型"] = {82, 0, 2}
    cc.thing_s["未知5"] = {84, 0, 2}
    cc.thing_s["未知6"] = {86, 0, 2}
    cc.thing_s["未知7"] = {88, 0, 2}
    cc.thing_s["加生命"] = {90, 0, 2}
    cc.thing_s["加生命最大值"] = {92, 0, 2}
    cc.thing_s["加中毒解毒"] = {94, 0, 2}
    cc.thing_s["加体力"] = {96, 0, 2}
    cc.thing_s["改变内力性质"] = {98, 0, 2}
    cc.thing_s["加内力"] = {100, 0, 2}
    cc.thing_s["加内力最大值"] = {102, 0, 2}
    cc.thing_s["加攻击力"] = {104, 0, 2}
    cc.thing_s["加轻功"] = {106, 0, 2}
    cc.thing_s["加防御力"] = {108, 0, 2}
    cc.thing_s["加医疗"] = {110, 0, 2}
    cc.thing_s["加使毒"] = {112, 0, 2}
    cc.thing_s["加解毒"] = {114, 0, 2}
    cc.thing_s["加抗毒"] = {116, 0, 2}
    cc.thing_s["加拳掌"] = {118, 0, 2}
    cc.thing_s["加指法"] = {120, 0, 2}
    cc.thing_s["加御剑"] = {122, 0, 2}
    cc.thing_s["加耍刀"] = {124, 0, 2}
    cc.thing_s["加奇门"] = {126, 0, 2}
    cc.thing_s["加暗器"] = {128, 0, 2}
    cc.thing_s["加武学常识"] = {130, 0, 2}
    cc.thing_s["加品德"] = {132, 0, 2}
    cc.thing_s["加攻击次数"] = {134, 0, 2}
    cc.thing_s["加功夫带毒"] = {136, 0, 2}
    cc.thing_s["仅修炼人物"] = {138, 0, 2}
    cc.thing_s["需内力性质"] = {140, 0, 2}
    cc.thing_s["需内力"] = {142, 0, 2}
    cc.thing_s["需攻击力"] = {144, 0, 2}
    cc.thing_s["需轻功"] = {146, 0, 2}
    cc.thing_s["需用毒"] = {148, 0, 2}
    cc.thing_s["需医疗"] = {150, 0, 2}
    cc.thing_s["加命中"] = {152, 0, 2}
    cc.thing_s["需拳掌"] = {154, 0, 2}
    cc.thing_s["需指法"] = {156, 0, 2}
    cc.thing_s["需御剑"] = {158, 0, 2}
    cc.thing_s["需耍刀"] = {160, 0, 2}
    cc.thing_s["需奇门"] = {162, 0, 2}
    cc.thing_s["需暗器"] = {164, 0, 2}
    cc.thing_s["需资质"] = {166, 0, 2}
    cc.thing_s["需经验"] = {168, 0, 2}
    cc.thing_s["练出物品需经验"] = {170, 0, 2}
    cc.thing_s["需材料"] = {172, 0, 2}
    for i = 1, 5 do
        cc.thing_s["练出物品" .. i] = {174 + 2 * (i - 1), 0, 2}
        cc.thing_s["需要物品数量" .. i] = {184 + 2 * (i - 1), 0, 2}
    end
    cc.thing_s["是否特效"] = {194, 0, 2}
    cc.thing_s["装备经验"] = {196, 0, 2}
    cc.thing_s["装备等级"] = {198, 0, 2}
    cc.thing_s["装备系别"] = {200, 0, 2}
    cc.thing_s["加招架"] = {202, 0, 2}

    cc.scene_size = 54                       -- 每个场景数据占用字节
    cc.scene_s = {}                         -- 保存场景数据的结构
    cc.scene_s["代号"] = {0, 0, 2}
    cc.scene_s["名称"] = {2, 2, 10}
    cc.scene_s["出门音乐"] = {12, 0, 2}
    cc.scene_s["进门音乐"] = {14, 0, 2}
    cc.scene_s["跳转场景"] = {16, 0, 2}
    cc.scene_s["进入条件"] = {18, 0, 2}
    cc.scene_s["外景入口X1"] = {20, 0, 2}
    cc.scene_s["外景入口Y1"] = {22, 0, 2}
    cc.scene_s["外景入口X2"] = {24, 0, 2}
    cc.scene_s["外景入口Y2"] = {26, 0, 2}
    cc.scene_s["入口X"] = {28, 0, 2}
    cc.scene_s["入口Y"] = {30, 0, 2}
    cc.scene_s["出口X1"] = {32, 0, 2}
    cc.scene_s["出口X2"] = {34, 0, 2}
    cc.scene_s["出口X3"] = {36, 0, 2}
    cc.scene_s["出口Y1"] = {38, 0, 2}
    cc.scene_s["出口Y2"] = {40, 0, 2}
    cc.scene_s["出口Y3"] = {42, 0, 2}
    cc.scene_s["跳转口X1"] = {44, 0, 2}
    cc.scene_s["跳转口Y1"] = {46, 0, 2}
    cc.scene_s["跳转口X2"] = {48, 0, 2}
    cc.scene_s["跳转口Y2"] = {50, 0, 2}
    cc.scene_s["场景类型"] = {52, 0, 2}

    cc.wugong_size = 148                     -- 每个武功数据占用字节
    cc.wugong_s = {}                        -- 保存武功数据的结构
    cc.wugong_s["代号"] = {0, 0, 2}
    cc.wugong_s["名称"] = {2, 2, 10}
    for i = 1, 5 do
        cc.wugong_s["未知" .. i] = {12 + 2 * (i - 1), 0, 2}
    end
    cc.wugong_s["出招音效"] = {22, 0, 2}
    cc.wugong_s["武功类型"] = {24, 0, 2}
    cc.wugong_s["武功动画&音效"] = {26, 0, 2}
    cc.wugong_s["伤害类型"] = {28, 0, 2}
    cc.wugong_s["攻击范围"] = {30, 0, 2}
    cc.wugong_s["消耗内力点数"] = {32, 0, 2}
    cc.wugong_s["敌人中毒点数"] = {34, 0, 2}
    for i = 1, 10 do
        cc.wugong_s["攻击力" .. i] = {36 + 2 * (i - 1), 0, 2}
        cc.wugong_s["移动范围" .. i] = {56 + 2 * (i - 1), 0, 2}
        cc.wugong_s["杀伤范围" .. i] = {76 + 2 * (i - 1), 0, 2}
        cc.wugong_s["加内力" .. i] = {96 + 2 * (i - 1), 0, 2}
        cc.wugong_s["杀内力" .. i] = {116 + 2 * (i - 1), 0, 2}
    end
    cc.wugong_s["冰封系数"] = {136, 0, 2}
    cc.wugong_s["灼烧系数"] = {138, 0, 2}
    cc.wugong_s["门派"] = {140, 2, 10}
    cc.wugong_s["格档"] = {150, 0, 2}
    cc.wugong_s["灵巧系数"] = {152, 0, 2}
    cc.wugong_s["暂时无用"] = {154, 0, 2}
    cc.wugong_s["层级"] = {156, 0, 2}
    for i = 1, 4 do
        cc.wugong_s["特效" .. i] = {158 + 2 * (i - 1), 0, 2}
    end
    for i = 1, 10 do
        cc.wugong_s["招式"] = {166 + 2 * (i - 1), 0, 2}
    end
    
    cc.shop_size = 36                           -- 每个商店数据占用字节
    cc.shop_s = {}                              -- 保存商店数据的结构
    for i = 1, 6 do
        cc.shop_s["物品" .. i] = {0 + 2 * (i - 1), 0, 2}
        cc.shop_s["物品数量" .. i] = {12 + 2 * (i - 1), 0, 2}
        cc.shop_s["物品价格" .. i] = {24 + 2 * (i - 1), 0, 2}
    end

    cc.shop_scene = {}                       -- 小宝商店场景数据
    -- sceneid：场景id，d_shop：小宝位置D*, d_leave：小宝离开D*，一般在场景出口，路过触发
    cc.shop_scene[0] = {sceneid = 153, d_shop = 16, d_leave = {17, 18}, }
    cc.shop_scene[1] = {sceneid = 3, d_shop = 14, d_leave = {15, 16}, }
    cc.shop_scene[2] = {sceneid = 40, d_shop = 20, d_leave = {21, 22}, }
    cc.shop_scene[3] = {sceneid = 60, d_shop = 16, d_leave = {17, 18}, }
    cc.shop_scene[4] = {sceneid = 159, d_shop = 9, d_leave = {10, 11, 12}, }

    -- 其他常量
    cc.m_width = 480                             -- 大地图宽
    cc.m_height = 480                            -- 大地图高
    cc.s_width = 64                              -- 场景地图高
    cc.s_height = 64                             -- 场景地图宽
    cc.d_num = 200                               -- D * 每个场景的事件数
    cc.x_scale = CONFIG.XScale                   -- 贴图一半的宽
    cc.y_scale = CONFIG.YScale                   -- 贴图一半的高
    cc.frame = CONFIG.FrameRate                 -- 每帧毫秒数
    cc.battle_delay = CONFIG.BattleDelay         -- 战斗延迟
    cc.bj = CONFIG.Bj
    cc.scene_move_frame = 100                     -- 场景移动帧速，用于场景移动事件
    cc.person_move_frame = 100                    -- 主角移动速度，用于主角移动事件
    cc.animation_frame = 150                     -- 动画显示帧速，用于显示动画事件
    cc.war_auto_delay = 300                       -- 自动战斗时显示头像的延时
    cc.direct_x = {0, 1, -1, 0}                  -- 不同方向x的加减值，用于走路改变坐标值
    cc.direct_y = {-1, 0, 0, 1}                  -- 不同方向y的加减值，用于走路改变坐标值
    cc.my_start_pic_m = 2501                       -- 男主角走路起始贴图
    cc.my_start_pic_f = 5001                       -- 女主角走路起始贴图
    cc.my_start_pic_cg = 5201                      -- 主角走路起始贴图
    cc.boat_start_pic = 3715                      -- 船起始贴图
    -- cc.Level = 30                               -- 人物等级
    -- cc.Exp = {                                  -- 每等级经验
    --     50, 150, 300, 500, 750, 
    --     1050, 1400, 1800, 2250, 2750, 
    --     3850, 5050, 6350, 7750, 9250, 
    --     10850, 12550, 14350, 16750, 18250, 
    --     21400, 24700, 28150, 31750, 35500, 
    --     39400, 43450, 47650, 52000, 60000, [0] = 0
    -- }
    cc.mmap_boat = {}                            -- 大地图船可以进入的贴图
    local tmpBoat = {{0x166, 0x16a}, {0x176, 0x17c}, {0x1ca, 0x1d0}, {0x1fa, 0x262}, {0x3f8, 0x3fe}}
    for i, v in ipairs(tmpBoat) do              -- 把这些数据变换成数组，其中有值就是可以进入
        for j = v[1], v[2], 2 do
            cc.mmap_boat[j] = 1
        end
    end
    -- Alungky：解决船开到深海区时，显示为人的问题
    local tmpForbid = {{0x264, 0x29E}}
    for i, v in ipairs(tmpForbid) do
        for j = v[1], v[2], 2 do
            cc.mmap_boat[j] = 1
        end
    end

    cc.scene_water = {}                          -- 场景人不能进入的贴图
    local tmpWater = {{0x166, 0x16a}, {0x176, 0x17c}, {0x1ca, 0x1d0}, 
                    {0x1fa, 0x262}, {0x332, 0x338}, {0x346, 0x346}, 
                    {0x3a6, 0x3a8}, {0x3f8, 0x3fe}, {0x52c, 0x544}
                }
    for i, v in ipairs(tmpWater) do              -- 把这些数据变换成数组，其中空项就是可以进入的贴图
        for j = v[1], v[2], 2 do
            cc.scene_water[j] = 1
        end
    end

    cc.war_water = {}                            -- 战斗地图人不能进入的贴图
    local tmpWater = {{0x166, 0x16a}, {0x176, 0x17c}, {0x1ca, 0x1d0}, 
                    {0x1fa, 0x262}, {0x332, 0x338}, {0x346, 0x346}, 
                    {0x3a6, 0x3a8}, {0x3f8, 0x3fe}, {0x52c, 0x544}
                }
    for i, v in ipairs(tmpWater) do             -- 把这些数据变换成数组，其中空项就是可以进入的贴图
        for j = v[1], v[2], 2 do
            cc.war_water[j] = 1
        end
    end

    cc.wugong_zs = {}                            -- 武功招式
    for i = 1, 15 do
        cc.wugong_zs[i] = {1 + 10 * (i - 1), 2 + 10 * (i - 1), 3 + 10 * (i - 1), 
                         4 + 10 * (i - 1), 5 + 10 * (i - 1), 6 + 10 * (i - 1), 
                         7 + 10 * (i - 1), 8 + 10 * (i - 1), 9 + 10 * (i - 1), 
                         10 + 10 * (i - 1), 
                }
    end

    cc.weekday = {}
    cc.weekday["Monday"] = {"星期一"}
    cc.weekday["Tuesday"] = {"星期二"}
    cc.weekday["Wednesday"] = {"星期三"}
    cc.weekday["Thursday"] = {"星期四"}
    cc.weekday["Friday"] = {"星期五"}
    cc.weekday["Saturday"] = {"星期六"}
    cc.weekday["Sunday"] = {"星期日"}

    -- 离队人员列表: {人员id，离队调用函数}
    -- 如果有新的离队人员加入，直接在这里增加
    cc.person_exit = {
        [1]=100,
        [2]=102,
        [4]=104,
        [9]=106,
        [16]=108,
        [17]=110,
        [25]=112,
        [28]=114,
        [29]=116,
        [30]=118,
        [35]=120,
        [36]=122,
        [37]=124,
        [38]=126,
        [44]=128,
        [45]=130,
        [47]=132,
        [48]=134,
        [49]=136,
        [51]=138,
        [52]=140,
        [53]=142,
        [54]=144,
        [55]=146,
        [56]=148,
        [58]=150,
        [59]=152,
        [63]=154,
        [66]=156,
        [72]=158,
        [73]=160,
        [74]=162,
        [75]=164,
        [76]=166,
        [77]=168,
        [78]=170,
        [79]=172,
        [80]=174,
        [81]=176,
        [82]=178,
        [83]=180,
        [84]=182,
        [85]=184,
        [86]=186,
        [87]=188,
        [88]=190,
        [89]=192,
        [90]=194,
        [91]=196,
        [92]=198,
        [104]=80011,
        [105]=80012,
        [539]=80013,
        [581]=80014,  
        [582]=80015,  
        [151]=11004,
        [154]=11002,
        [161]=4183,
        [566]=11006,
        [569]=11003,
        [574]=11005,
        [587]=11007,    --紫衣
        [738]=11008,    --胡夫人
        [589]=8005,     --水笙
        [590]=8650,
        [601]=4138,
        [604]=11001,
        [607]=4202,     --焦万尔
        [609]=4250,     --赵敏
        [626]=4184,     --郭襄
        [629]=4200,     --阿九
        [631]=4209,     --周芷若
        [646]=4249,     --殷离
    }

    -- 所有可加入人员离队需要清除的D*事件，清除后这些人就找不到了。得到神杖时使用
    cc.all_person_exit = {
        {1, 5}, 
        {2, 6}, 
        {4, 21}, 
        {9, 17}, 
        {16, 31}, 
        {17, 32}, 
        {25, 28}, 
        {28, 29}, 
        {29, 26}, 
        {30, 13}, 
        {35, 15}, 
        {36, 25}, 
        {37, {7,8}}, 
        {38, {16,58}}, 
        {44, 33}, 
        {45, 12}, 
        {47, 23}, 
        {48, 24}, 
        {49, {10,11}}, 
        {51, 22}, 
        {52, 41}, 
        {53, 9}, 
        {54, 18}, 
        {55, 13}, 
        {56, 14}, 
        {58, 19}, 
        {59, 20}, 
        {63, 30}, 
        {66, 38}, 
        {72, 40}, 
        {73, 35}, 
        {74, 36}, 
        {75, 37}, 
        {76, 27}, 
        {77, 39}, 
        {78, 59}, 
        {79, 42}, 
        {80, 52}, 
        {81, 46}, 
        {82, 54}, 
        {83, 55}, 
        {84, 34}, 
        {85, 47}, 
        {86, 49}, 
        {87, 50}, 
        {88, 43}, 
        {89, 44}, 
        {90, 53}, 
        {91, 51},     
        {104, 51},     
        {105, 51},     
        {539, 51}, 
        {581, 51}, 
        {582, 51}, 
        {92, 1},
        {151, 115},     --文泰来
        {154, 112},     --骆冰
        {161, 99},      --李莫愁
        {566, 117},     --袁冠南
        {569, 113},     --李沅芷
        {574, 110},     --李清露
        {587, 124},     --袁紫衣
        {589, 80},      --水笙
        {590, 86},      --李文秀
        {601, 48},      --韦小宝
        {604, 100},     --阿青
        {609, 105},     --赵敏
        {626, 120},     --郭襄
        {629, 51},      --阿九
        {631, 105},     --芷若            
        {646, 106},     --殷离
    }

    cc.book_num = 14                -- 天书个数
    cc.book_start = 144             -- 14天书起始id
    cc.money_id = 174               -- 银两id
    cc.mjcv_id = 550                -- 秘籍残章id
    cc.she_ma_le = {[93] = 1}       -- ？
    cc.she_ma_le2 = {[370] = 1}     -- ？

    cc.effect = {                   -- 特效帧数
        14,   --特效1--(10 -- 23)
        17,   --特效2--(24 -- 40)
        9,   --特效3--(41 -- 49)
        13,   --特效4--(50 -- 62)
        17,   --特效5--(63 -- 79)
        17,   --特效6--(80 -- 96)
        17,   --特效7--(97 -- 113)
        18,   --特效8--(114 -- 131)
        19,   --特效9--(132 -- 150)
        19,   --特效10--(151 -- 169)
        15,   --特效11--(170 -- 184)
        13,   --特效12--(185 -- 197)
        10,   --特效13--(198 -- 207)
        10,   --特效14--(208 -- 217)
        15,   --特效15--(218 -- 232)
        21,   --特效16--(233 -- 253)
        16,   --特效17--(254 -- 269)
        9,   --特效18--(270 -- 278)
        11,   --特效19--(279 -- 289)
        8,   --特效20--(290 -- 297)
        9,   --特效21--(298 -- 306)
        8,   --特效22--(307 -- 314)
        8,   --特效23--(315 -- 322)
        7,   --特效24--(323 -- 329)
        8,   --特效25--(330 -- 337)
        8,   --特效26--(338 -- 345)
        9,   --特效27--(346 -- 354)
        12,   --特效28--(355 -- 366)
        19,   --特效29--(367 -- 385)
        11,   --特效30--(386 -- 396)
        14,   --特效31--(397 -- 410)
        12,   --特效32--(411 -- 422)
        17,   --特效33--(423 -- 439)
        8,   --特效34--(440 -- 447)
        11,   --特效35--(448 -- 458)
        10,   --特效36--(459 -- 468)
        13,   --特效37--(469 -- 481)
        10,   --特效38--(482 -- 491)
        19,   --特效39--(492 -- 510)
        14,   --特效40--(511 -- 524)
        17,   --特效41--(525 -- 541)
        19,   --特效42--(542 -- 560)
        14,   --特效43--(561 -- 574)
        21,   --特效44--(575 -- 595)
        16,   --特效45--(596 -- 611)
        13,   --特效46--(612 -- 624)
        18,   --特效47--(625 -- 642)
        14,   --特效48--(643 -- 656)
        17,   --特效49--(657 -- 673)
        17,   --特效50--(674 -- 690)
        16,   --特效51--(691 -- 706)
        7,   --特效52--(707 -- 713)
        12,   --特效53--(714 -- 725)
        40,   --特效54--(726 -- 765)
        16,   --特效55--(766 -- 781)
        9,   --特效56--(782 -- 790)
        15,   --特效57--(791 -- 805)
        15,   --特效58--(806 -- 820)
        31,   --特效59--(821 -- 851)
        38,   --特效60--(852 -- 889)
        24,   --特效61--(890 -- 913)
        26,   --特效62--(914 -- 939)
        24,   --特效63--(940 -- 963)
        20,   --特效64--(964 -- 983)
        12,   --特效65--(984 -- 995)
        17,   --特效66--(996 -- 1012)
        14,   --特效67--(1013 -- 1026)
        14,   --特效68--(1027 -- 1040)
        10,   --特效69--(1041 -- 1050)
        10,   --特效70--(1051 -- 1060)
        18,   --特效71--(1061 -- 1078)
        31,   --特效72--(1079 -- 1109)
        12,   --特效73--(1110 -- 1121)
        7,   --特效74--(1122 -- 1128)
        6,   --特效75--(1129 -- 1134)
        7,   --特效76--(1135 -- 1141)
        28,   --特效77--(1142 -- 1169)
        16,   --特效78--(1170 -- 1185)
        7,   --特效79--(1186 -- 1192)
        16,   --特效80--(1193 -- 1208)
        20,   --特效81--(1209 -- 1228)
        15,   --特效82--(1229 -- 1243)
        13,   --特效83--(1244 -- 1256)
        15,   --特效84--(1257 -- 1271)
        11,   --特效85--(1272 -- 1282)
        11,   --特效86--(1283 -- 1293)
        11,   --特效87--(1294 -- 1304)
        20,   --特效88--(1305 -- 1324)
        20,   --特效89--(1325 -- 1344)
        20,   --特效90--(1345 -- 1364)
        17,   --特效91--(1365 -- 1381)
        17,   --特效92--(1382 -- 1398)
        17,   --特效93--(1399 -- 1415)
        9,   --特效94--(1416 -- 1424)
        8,   --特效95--(1425 -- 1432)
        8,   --特效96--(1433 -- 1440)
        17,   --特效97--(1441 -- 1457)
        10,   --特效98--(1458 -- 1467)
        11,   --特效99--(1468 -- 1478)
        8,   --特效100--(1479 -- 1486)
        29,   --特效101--(1487 -- 1515)
        6,   --特效102--(1516 -- 1521)
        13,   --特效103--(1522 -- 1534)
        31,   --特效104--(1535 -- 1565)
        14,   --特效105--(1566 -- 1579)
        4,   --特效106--(1580 -- 1583)
        13,   --特效107--(1584 -- 1596)
        13,   --特效108--(1597 -- 1609)
        15,   --特效109--(1610 -- 1624)
        24,   --特效110--(1625 -- 1648)
        20,   --特效111--(1649 -- 1668)
        12,   --特效112--(1669 -- 1680)
        16,   --特效113--(1681 -- 1696)
        18,   --特效114--(1697 -- 1714)
        17,   --特效115--(1715 -- 1731)
        14,   --特效116--(1732 -- 1745)
        12,   --特效117--(1746 -- 1757)
        19,   --特效118--(1758 -- 1776)
        16,   --特效119--(1777 -- 1792)
        12,   --特效120--(1793 -- 1804)
        14,   --特效121--(1805 -- 1818)
        14,   --特效122--(1819 -- 1832)
        6,   --特效123--(1833 -- 1838)
        8,   --特效124--(1839 -- 1846)
        24,   --特效125--(1847 -- 1870)
        19,   --特效126--(1871 -- 1889)
        16,   --特效127--(1890 -- 1905)
        14,   --特效128--(1906 -- 1919)
        20,   --特效129--(1920 -- 1939)
        18,   --特效130--(1940 -- 1957)
        16,   --特效131--(1958 -- 1973)
        13,   --特效132--(1974 -- 1986)
        25,   --特效133--(1987 -- 2011)
        20,   --特效134--(2012 -- 2031)
        13,   --特效135--(2032 -- 2044)
        22,   --特效136--(2045 -- 2066)
        35,   --特效137--(2067 -- 2101)
        11,   --特效138--(2102 -- 2112)
        17,   --特效139--(2113 -- 2129)
        25,   --特效140--(2130 -- 2154)
        23,   --特效141--(2155 -- 2177)
        16,   --特效142--(2178 -- 2193)
        11,   --特效143--(2194 -- 2204)
        13,   --特效144--(2205 -- 2217)
        7,   --特效145--(2218 -- 2224)
        14,   --特效146--(2225 -- 2238)
        27,   --特效147--(2239 -- 2265)
        16,   --特效148--(2266 -- 2281)
        14,   --特效149--(2282 -- 2295)
        44,   --特效150--(2296 -- 2339)
        12,   --特效151--(2340 -- 2351)
        16,   --特效152--(2352 -- 2367)
        14,   --特效153--(2368 -- 2381)
        18,   --特效154--(2382 -- 2399)
        11,   --特效155--(2400 -- 2410)
        17,   --特效156--(2411 -- 2427)
        12,   --特效157--(2428 -- 2439)
        12,   --特效158--(2440 -- 2451)
        17,   --特效159--(2452 -- 2468)
        14,   --特效160--(2469 -- 2482)
        11,   --特效161--(2483 -- 2493)
        12,   --特效162--(2494 -- 2505)
        17,   --特效163--(2506 -- 2522)
        11,   --特效164--(2523 -- 2533)
        9,   --特效165--(2534 -- 2542)
        24,   --特效166--(2543 -- 2566)
        3,   --特效167--(2567 -- 2569)
        19,   --特效168--(2570 -- 2588)
        28,   --特效169--(2589 -- 2616)
        9,   --特效170--(2617 -- 2625)
        15,   --特效171--(2626 -- 2640)
        18,   --特效172--(2641 -- 2658)
        22,   --特效173--(2659 -- 2680)
        17,   --特效174--(2681 -- 2697)
        19,   --特效175--(2698 -- 2716)
        19,   --特效176--(2717 -- 2735)
        6,   --特效177--(2736 -- 2741)
        10,   --特效178--(2742 -- 2751)
        9,   --特效179--(2752 -- 2760)
        19,   --特效180--(2761 -- 2779)
        8,   --特效181--(2780 -- 2787)
        41,   --特效182--(2788 -- 2828)
        10,   --特效183--(2829 -- 2838)
        11,   --特效184--(2839 -- 2849)
        10,   --特效185--(2850 -- 2859)
        10,   --特效186--(2860 -- 2869)
        7,   --特效187--(2870 -- 2876)
        6,   --特效188--(2877 -- 2882)
        12,   --特效189--(2883 -- 2894)
        17,   --特效190--(2895 -- 2911)
        30,   --特效191--(2912 -- 2941)
        27,   --特效192--(2942 -- 2968)
        10,   --特效193--(2969 -- 2978)
        10,   --特效194--(2979 -- 2988)
        18,   --特效195--(2989 -- 3006)
        10,   --特效196--(3007 -- 3016)
        19,   --特效197--(3017 -- 3035)
        20,   --特效198--(3036 -- 3055)
        20,   --特效199--(3056 -- 3075)
        22,   --特效200--(3076 -- 3097)
        20,   --特效201--(3098 -- 3117)
        18,   --特效202--(3118 -- 3135)
        4,   --特效203--(3136 -- 3139)
        25,   --特效204--(3140 -- 3164)
        18,   --特效205--(3165 -- 3182)
        17,   --特效206--(3183 -- 3199)
        14,   --特效207--(3200 -- 3213)
        18,   --特效208--(3214 -- 3231)
        15,   --特效209--(3232 -- 3246)
        14,   --特效210--(3247 -- 3260)
        32,   --特效211--(3261 -- 3292)
        11,   --特效212--(3293 -- 3303)
        15,   --特效213--(3304 -- 3318)
        20,   --特效214--(3319 -- 3338)
        16,   --特效215--(3339 -- 3354)
        23,   --特效216--(3355 -- 3377)
        20,   --特效217--(3378 -- 3397)
        15,   --特效218--(3398 -- 3412)
        31,   --特效219--(3413 -- 3443)
        8,   --特效220--(3444 -- 3451)
        13,   --特效221--(3452 -- 3464)
        21,   --特效222--(3465 -- 3485)
        13,   --特效223--(3486 -- 3498)
        29,   --特效224--(3499 -- 3527)
        20,   --特效225--(3528 -- 3547)
        15,   --特效226--(3548 -- 3562)
        20,   --特效227--(3563 -- 3582)
        16,   --特效228--(3583 -- 3598)
        15,   --特效229--(3599 -- 3613)
        30,   --特效230--(3614 -- 3643)
        15,   --特效231--(3644 -- 3658)
        26,   --特效232--(3659 -- 3684)
        22,   --特效233--(3685 -- 3706)
        27,   --特效234--(3707 -- 3733)
        21,   --特效235--(3734 -- 3754)
        29,   --特效236--(3755 -- 3783)
        21,   --特效237--(3784 -- 3804)
        20,   --特效238--(3805 -- 3824)
        12,   --特效239--(3825 -- 3836)
        20,   --特效240--(3837 -- 3856)
        30,   --特效241--(3857 -- 3886)
        21,   --特效242--(3887 -- 3907)
        12,   --特效243--(3908 -- 3919)
        19,   --特效244--(3920 -- 3938)
        34,   --特效245--(3939 -- 3972)
        18,   --特效246--(3973 -- 3990)
        21,   --特效247--(3991 -- 4011)
        11,   --特效248--(4012 -- 4022)
        21,   --特效249--(4023 -- 4043)
        11,   --特效250--(4044 -- 4054)
        12,   --特效251--(4055 -- 4066)
        26,   --特效252--(4067 -- 4092)
        14,   --特效253--(4093 -- 4106)
        15,   --特效254--(4107 -- 4121)
        5,   --特效255--(4122 -- 4126)
        5,   --特效256--(4127 -- 4131)
        3,   --特效257--(4132 -- 4134)
        7,   --特效258--(4135 -- 4141)
        4,   --特效259--(4142 -- 4145)
        3,   --特效260--(4146 -- 4148)
        2,   --特效261--(4149 -- 4150)
        2,   --特效262--(4151 -- 4152)
        2,   --特效263--(4153 -- 4154)
        7,   --特效264--(4155 -- 4161)
        2,   --特效265--(4162 -- 4163)
        2,   --特效266--(4164 -- 4165)
        5,   --特效267--(4166 -- 4170)
        6,   --特效268--(4171 -- 4176)
        8,   --特效269--(4177 -- 4184)
        3,   --特效270--(4185 -- 4187)
        3,   --特效271--(4188 -- 4190)
        13,   --特效272--(4191 -- 4203)
        10,   --特效273--(4204 -- 4213)
        6,   --特效274--(4214 -- 4219)
        4,   --特效275--(4220 -- 4223)
        8,   --特效276--(4224 -- 4231)
        3,   --特效277--(4232 -- 4234)
        10,   --特效278--(4235 -- 4244)
        2,   --特效279--(4245 -- 4246)
        7,   --特效280--(4247 -- 4253)
        4,   --特效281--(4254 -- 4257)
        5,   --特效282--(4258 -- 4262)
        7,   --特效283--(4263 -- 4269)
        6,   --特效284--(4270 -- 4275)
        6,   --特效285--(4276 -- 4281)
        6,   --特效286--(4282 -- 4287)
        4,   --特效287--(4288 -- 4291)
        2,   --特效288--(4292 -- 4293)
        3,   --特效289--(4294 -- 4296)
        5,   --特效290--(4297 -- 4301)
        3,   --特效291--(4302 -- 4304)
        22,   --特效292--(4305 -- 4326)
        3,   --特效293--(4327 -- 4329)
        6,   --特效294--(4330 -- 4335)
        10,   --特效295--(4336 -- 4345)
        5,   --特效296--(4346 -- 4350)
        5,   --特效297--(4351 -- 4355)
        2,   --特效298--(4356 -- 4357)
        3,   --特效299--(4358 -- 4360)
        3,   --特效300--(4361 -- 4363)
        14,   --特效301--(4364 -- 4377)
        8,   --特效302--(4378 -- 4385)
        15,   --特效303--(4386 -- 4400)
        15,   --特效304--(4401 -- 4415)
        16,   --特效305--(4416 -- 4431)
        30,   --特效306--(4432 -- 4461)
        14,   --特效307--(4462 -- 4475)
        30,   --特效308--(4476 -- 4505)
        98,   --特效309--(4506 -- 4603)
        70,   --特效310--(4604 -- 4673)
        6,   --特效311--(4674 -- 4679)
        4,   --特效312--(4680 -- 4683)
        9,   --特效313--(4684 -- 4692)
        9,   --特效314--(4693 -- 4701)
        16,   --特效315--(4702 -- 4717)
        6,   --特效316--(4718 -- 4723)
        7,   --特效317--(4724 -- 4730)
        7,   --特效318--(4731 -- 4737)
        10,   --特效319--(4738 -- 4747)
        6,   --特效320--(4748 -- 4753)
        6,   --特效321--(4754 -- 4759)
        6,   --特效322--(4760 -- 4765)
        8,   --特效323--(4766 -- 4773)
        6,   --特效324--(4774 -- 4779)
        8,   --特效325--(4780 -- 4787)
        5,   --特效326--(4788 -- 4792)
        7,   --特效327--(4793 -- 4799)
        6,   --特效328--(4800 -- 4805)
        7,   --特效329--(4806 -- 4812)
        7,   --特效330--(4813 -- 4819)
        7,   --特效331--(4820 -- 4826)
        6,   --特效332--(4827 -- 4832)
        7,   --特效333--(4833 -- 4839)
        10,   --特效334--(4840 -- 4849)
        4,   --特效335--(4850 -- 4853)
        4,   --特效336--(4854 -- 4857)
        6,   --特效337--(4858 -- 4863)
        4,   --特效338--(4864 -- 4867)
        6,   --特效339--(4868 -- 4873)
        8,   --特效340--(4874 -- 4881)
        10,   --特效341--(4882 -- 4891)
        7,   --特效342--(4892 -- 4898)
        8,   --特效343--(4899 -- 4906)
        6,   --特效344--(4907 -- 4912)
        15,   --特效345--(4913 -- 4927)
        11,   --特效346--(4928 -- 4938)
        10,   --特效347--(4939 -- 4948)
        14,   --特效348--(4949 -- 4962)
        18,   --特效349--(4963 -- 4980)
        12,   --特效350--(4981 -- 4992)
        12,   --特效351--(4993 -- 5004)
        8,   --特效352--(5005 -- 5012)
        8,   --特效353--(5013 -- 5020)
        8,   --特效354--(5021 -- 5028)
        8,   --特效355--(5029 -- 5036)
        8,   --特效356--(5037 -- 5044)
        8,   --特效357--(5045 -- 5052)
        8,   --特效358--(5053 -- 5060)
        8,   --特效359--(5061 -- 5068)
        8,   --特效360--(5069 -- 5076)
        8,   --特效361--(5077 -- 5084)
        8,   --特效362--(5085 -- 5092)
        8,   --特效363--(5093 -- 5100)
        8,   --特效364--(5101 -- 5108)
        8,   --特效365--(5109 -- 5116)
        8,   --特效366--(5117 -- 5124)
        8,   --特效367--(5125 -- 5132)
        8,   --特效368--(5133 -- 5140)
        8,   --特效369--(5141 -- 5148)
        8,   --特效370--(5149 -- 5156)
        8,   --特效371--(5157 -- 5164)
        
        [0] = 9        --特效0        Tiny heart(when heal)
    }

    cc.extra_offense = {                 -- 装备对威力的加成
        {52, 75, 100},          --鳄嘴剪+大剪刀
        {45, 67, 100},          --冷月宝刀+胡刀
        {43, 349, 500},         --屠龙刀+屠龙刀法
        {202, 67, 100},         --闯王军刀+胡刀
        {37, 41, 100},          --倚天剑+灭剑
        {49, 80, 200},          --打狗棒+打狗棒法
        {44, 63, 200},          --血刀+血刀
        {40, 40, 200},          --金蛇剑+金蛇
        {36, 45, 100},          --玄铁剑+玄铁
        {276, 155, 3000},       --火枪+火枪
        {51, 78, 200},          --金龙鞭+黄沙万里鞭法
        {50, 86, 100},          --伏魔杵+伏魔杖法
        {241, 39, 100},         --君子剑+全真剑法
        {242, 42, 100},         --淑女剑+玉女剑法
        {244, 81, 200},         --西毒蛇杖+灵蛇杖法
        {55, 110, 100},         --神山剑+神山剑法
        {56, 111, 100},         --玄铁菜刀+西瓜刀法
        {57, 112, 100},         --犽月+犽月流空
        {243, 77, 200},         --金刀黑剑+阴阳倒乱刃
        {39, 44, 100},          --白龙剑+苗家剑法
        {236, 46, 100},         --真武剑+太极剑法
        {326,156,200},
        {326,188,200}
    }

    cc.new_person_name = CONFIG.PlayName      -- 新游戏的数据
    cc.new_game_scene_id = 70
    cc.new_game_scene_x = 16
    cc.new_game_scene_y = 31
    cc.new_game_event = 691
    cc.new_person_pic_m = 2515
    cc.new_person_pic_f = 5015
    cc.person_attrib_max = {}                 -- 属性最大值
    cc.person_attrib_max["经验"] = 60000
    cc.person_attrib_max["物品修炼点数"] = 60000
    cc.person_attrib_max["修炼点数"] = 30000
    cc.person_attrib_max["生命最大值"] = 9999
    cc.person_attrib_max["受伤程度"] = 100
    cc.person_attrib_max["中毒程度"] = 250
    cc.person_attrib_max["内力最大值"] = 9999
    cc.person_attrib_max["生命增长"] = 15
    cc.person_attrib_max["体力"] = 100
    cc.person_attrib_max["攻击力"] = 9999
    cc.person_attrib_max["防御力"] = 9999
    cc.person_attrib_max["轻功"] = 9999
    cc.person_attrib_max["医疗能力"] = 300
    cc.person_attrib_max["用毒能力"] = 300
    cc.person_attrib_max["解毒能力"] = 300
    cc.person_attrib_max["抗毒能力"] = 300
    cc.person_attrib_max["拳掌功夫"] = 999
    cc.person_attrib_max["指法技巧"] = 999
    cc.person_attrib_max["御剑能力"] = 999
    cc.person_attrib_max["耍刀技巧"] = 999
    cc.person_attrib_max["特殊兵器"] = 999
    cc.person_attrib_max["暗器技巧"] = 999
    cc.person_attrib_max["武学常识"] = 999
    cc.person_attrib_max["品德"] = 200
    cc.person_attrib_max["资质"] = 100
    cc.person_attrib_max["攻击带毒"] = 500
    cc.person_attrib_max["冰封程度"] = 100
    cc.person_attrib_max["灼烧程度"] = 100
    cc.person_attrib_max["实战"] = 500

    cc.war_data_size = 186                -- 战斗数据大小，war.sta数据结构
    cc.war_data_s = {}                   -- 战斗数据结构
    cc.war_data_s["代号"] = {0, 0, 2}
    cc.war_data_s["名称"] = {2, 2, 10}
    cc.war_data_s["地图"] = {12, 0, 2}
    cc.war_data_s["经验"] = {14, 0, 2}
    cc.war_data_s["音乐"] = {16, 0,2 }
    for i = 1, 6 do
        cc.war_data_s["手动选择参战人" .. i] = {18 + 2 * (i - 1), 0, 2}
        cc.war_data_s["自动选择参战人" .. i] = {30 + 2 * (i - 1), 0, 2}
        cc.war_data_s["我方X" .. i] = {42 + 2 * (i - 1), 0, 2}
        cc.war_data_s["我方Y" .. i] = {54 + 2 * (i - 1), 0, 2}
    end
    for i = 1, 20 do
        cc.war_data_s["敌人" .. i] = {66 + 2 * (i - 1), 0, 2}
        cc.war_data_s["敌方X" .. i] = {106 + 2 * (i - 1), 0, 2}
        cc.war_data_s["敌方Y" .. i] = {146 + 2 * (i - 1), 0, 2}
    end
    cc.war_width = 64                    -- 战斗地图大小
    cc.war_height = 64

    -- 显示主地图和场景地图坐标
    -- 如果显示坐标，则会增加cpu占用。机器速度慢的话可能会卡。这个在调试时有用。
    cc.show_xy = 1                       -- 0 不显示，1 显示

    -- 以下为控制显示方式的参数
    cc.menu_border_pixel = 5              -- 菜单四周边框留的像素数，也用于绘制字符串的box四周留的像素
    cc.default_font = math.modf(math.min(cc.screen_w, cc.screen_h) / 320 * 14)
    cc.small_font = cc.default_font * 3 / 4
    cc.font_big1 = math.modf(cc.default_font * 1.45)
    cc.font_big2 = math.modf(cc.default_font * 1.3)
    cc.font_big3 = math.modf(cc.default_font * 1.15)
    cc.font_small1 = math.modf(cc.default_font * 0.85)
    cc.font_small2 = math.modf(cc.default_font * 0.7)
    cc.font_small3 = math.modf(cc.default_font * 0.65)
    cc.font_small4 = math.modf(cc.default_font * 0.635)
    cc.font_small5 = math.modf(cc.default_font * 0.9)
    cc.font_small6 = math.modf(cc.default_font * 0.92)
    cc.font_small7 = math.modf(cc.default_font * 0.55)
    cc.row_pixel = math.modf(math.min(cc.screen_w, cc.screen_h) / 100)

    -- cc.start_menu_y = 160                  -- 开始菜单Y坐标
    cc.start_menu_font_size = cc.default_font   -- 开始菜单字号
    -- cc.new_game_y= 160                     -- 新游戏属性显示Y坐标
    cc.new_game_font_size = cc.default_font     -- 新游戏属性选择字号
    cc.main_menu_x = 10                       -- 主菜单开始坐标
    cc.main_menu_y = 10
    cc.game_over_x = 90                       -- 战败菜单开始坐标
    cc.game_over_y = 65
    cc.person_state_row_pixel = 5              -- 显示人物状态行间距像素
    cc.thing_font_size = cc.font_small1         -- 物品显示定义
    -- cc.thing_pic_width=math.modf(100 * CONFIG.Zoom / 100)          -- 物品图片宽高
    cc.thing_pic_width = 100                  -- 物品图片固定尺寸
    cc.thing_pic_height = cc.thing_pic_width    -- 同宽同高
    local n = math.modf(cc.screen_w / cc.thing_pic_width - 2)          -- 一行显示几个物品
    if n < 10 then
        cc.menu_thing_x_num = 9
    else
        cc.menu_thing_x_num = 9
    end
    -- 周目商店一行显示物品
    if n < 6 then 
        cc.mxzm = 5
    else
        cc.mxzm = 5
    end
    local m = math.modf(cc.screen_h / cc.thing_pic_height - 2)         -- 物品显示几列
    if m < 5 then
        cc.menu_thing_num = 5
    else
        cc.menu_thing_num = 5
    end

    cc.thing_gap_out = 4                      -- 物品图像显示四周留白
    cc.thing_gap_in = 4                       -- 物品图像显示中间间隔
    cc.start_menu_y = cc.screen_h - 3 * (cc.start_menu_font_size + cc.row_pixel) - 20
    cc.new_game_y = cc.screen_h - 4 * (cc.new_game_font_size + cc.row_pixel) - 10
    -- 子菜单的开始坐标
    cc.main_sub_menu_x = cc.main_menu_x + 2 * cc.menu_border_pixel + 2 * cc.default_font + 5            -- 主菜单为两个汉字
    cc.main_sub_menu_y = cc.main_menu_y
    -- 二级子菜单开始坐标
    cc.main_sub_menu_x2 = cc.main_sub_menu_x + 2 * cc.menu_border_pixel + 4 * cc.default_font + 5        -- 子菜单为四个字符
    cc.single_line_height = cc.default_font + 2 * cc.menu_border_pixel + 5                           -- 带框的单行字符高
    cc.start_thing_pic = 0
    cc.auto_move_event = {[0] = 0}            -- 鼠标操作时是否触发事件，第一个位置0未触发，1触发，2触发并且能够走到面前，第二和第三个位置为XY坐标
    cc.mmap_address = {}                      -- 大地图地址

    --LMSJ = {"少商剑", "商阳剑", "中冲剑", "关冲剑", "少冲剑", "少泽剑"}
    --XL18 = {"亢龙有悔", "见龙在田", "飞龙在天", "双龙出水", "神龙摆尾", "潜龙勿用"}
    xl18jy = {"极意--亢龙·鸿渐於陆", "极意--飞龙·或跃在渊", "极意--潜龙·密雨不云", "极意--神龙·震惊百里", "极意--见龙·利涉大川", "极意--双龙·突如其来", "极意--六龙·履霜冰至", "极意--龙战·损则有孚"}
    tfssj = {"·『天道惊雷憾』", "·『点墨山河』", "·『一剑镇神洲』", "·『羽葬煌炎斩』", "·『千机龙绝闪』", "·『化气御九天』", "·『仁者无敌』", "·『八门聚万象』", "·『天人五衰』", "·『邪魅天下』"}
    zjtf = {"盖世神拳", "灵犀一指", "剑神一笑", "傲世狂刀", "奇门无双", "绝世天罡", "仁者无敌", "回天圣手", "欲天摩罗", "穷凶极恶"}
    tfe = {"拳", "指", "剑", "刀", "特", "罡", "仁", "医", "毒", "邪"}
    --YLJFZS = {"清饮小酌", "浪迹天涯", "举案齐眉", "皓腕玉镯", "冷月窥人", "竹帘临池"}
    --QZJFZS = {"大江似练", "斜风细雨", "星河欲转", "桃花流水"}
    sjhbjfzs = {"双剑合璧--清饮小酌", "双剑合璧--浪迹天涯", "双剑合璧--举案齐眉", "双剑合璧--皓腕玉镯", "双剑合璧--冷月窥人", 
    "双剑合璧--竹帘临池","双剑合璧--大江似练", "双剑合璧--斜风细雨", "双剑合璧--星河欲转", "双剑合璧--桃花流水"}
    --SHSGZS = {"石火电光", "火中取栗", "明火执仗", "引火烧身", "烽火连天", "刀山火海"}
    tstf = {nil, "影帝"}
    mptf = {"少林弟子"}

    -- 实战经验
    war_szjy = {
        3, 2, 5, 2, 20, 15, 5, 5, 5, 5, 5, 5, 5, 5, 3, 2, 2,
        10, 5, 4, 4, 5, 4, 2, 2, 10, 20, 2, 3, 3, 3, 3, 3, 3, 5, 3, 4, 4,
        8, 8, 4, 4, 4, 4, 2, 5, 3, 4, 3, 15, 4, 2, 3, 3, 4, 4, 15, 5, 5,
        15, 3, 15, 3, 15, 10, 2, 8, 3, 15, 7, 8, 3, 3, 3, 4, 2, 2, 2, 2,
        4, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 7, 4, 4, 2,
        2, 12, 2, 2, 2, 3, 3, 3, 3, 3, 7, 7, 25, 3, 3, 5, 6, 3, 3, 3, 3,
        3, 3, 3, 3, 3, 3, 10, 3, 3, 3, 3, 3, 3, 3, 2, 3, 2, 35, 2, 2, 2,
        2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3,
        3, 3, 3, 3, 3, 4, 3, 4, 4, 4, 2, 2, 2, 2, 2, 2, 2, 3, 7, 7, 4, 3, 5, 5, 3
    }

    -- 称号
    rwwh = {}
    rwwh[1] = "雪山飞狐"
	rwwh[2] = "灵枢素问"
	rwwh[3] = "金面佛"
	rwwh[4] = "雁过拨毛"
	rwwh[5] = "太极宗师"
	rwwh[6] = "灭绝师太"
	rwwh[7] = "铁琴先生"	--何太冲
	rwwh[8] = "崆峒掌门"	--唐文亮
	rwwh[9] = "九阳明尊"
	rwwh[10] = "光明右使"
	rwwh[11] = "光明左使"
	rwwh[12] = "白眉鹰王"
	rwwh[13] = "金毛狮王"
	rwwh[14] = "青翼蝠王"
	rwwh[15] = "紫衫龙王"
	rwwh[16] = "蝶谷医仙"
	rwwh[17] = "蝶谷毒仙"
	rwwh[18] = "混元霹雳手"
	rwwh[19] = "君子剑"
	rwwh[20] = "潇湘夜雨"
	rwwh[21] = "恒山掌门"
	rwwh[22] = "嵩山掌门"
	rwwh[23] = "泰山掌门"
	rwwh[24] = "青城掌门"
	rwwh[25] = "五毒教主"
	rwwh[26] = "日月魔帝"
	rwwh[27] = "风云再起"
	rwwh[28] = "杀人名医"
	rwwh[29] = "万里独行"
	rwwh[30] = "傻小子"
	rwwh[31] = "梅庄四友"
	rwwh[32] = "梅庄四友"
	rwwh[33] = "梅庄四友"
	rwwh[34] = "梅庄四友"
	rwwh[35] = "九剑传人"
	rwwh["35"] = "剑魔再临"
	rwwh[36] = "辟邪剑客"
	rwwh[37] = "真名神照"
	rwwh["38"] = "混沦太玄"
	rwwh[39] = "侠客岛主"
	rwwh[40] = "侠客岛主"
	rwwh[41] = "赏善使者"
	rwwh[42] = "罚恶使者"
	rwwh[43] = "雪山掌门"
	rwwh[44] = "凶神恶煞"
	rwwh[45] = "阎王敌"
	rwwh[46] = "星宿老怪"
	rwwh[47] = "曼珠沙华"
	rwwh[48] = "冰毒怪客"
	rwwh[49] = "小和尚"
	rwwh["49"] = "逍遥掌门"
	rwwh[50] = "狂龙天征"
	rwwh[539] = "狂龙天征"
	rwwh[51] = "姑苏慕容"
	rwwh[52] = "中平神枪"
	rwwh[53] = "六脉真传"
	rwwh[54] = "碧血长风"
	rwwh[55] = "侠之大者"
	rwwh[56] = "兰质蕙心"
	rwwh[57] = "桃花岛主"
	rwwh[58] = "西狂"
	rwwh[59] = "冷若天仙"
	rwwh[60] = "西毒"
	rwwh[62] = "元蒙帝师"
	rwwh[63] = "青箫落瑛"
	rwwh[64] = "顽童武痴"
	rwwh[65] = "南僧"
	rwwh[66] = "波斯圣女"
	rwwh[67] = "铁掌帮主"
	rwwh[68] = "长春子"
	rwwh[69] = "北丐"
	rwwh[71] = "神龙教主"
	rwwh[72] = "天龙掌门"
	rwwh[73] = "日月圣姑"
	rwwh[74] = "翠羽黄衫"
 	rwwh[75] = "天池红花"
	rwwh[76] = "琅嬛仙子"
	rwwh[77] = "秀外慧中"
	rwwh[78] = "铁尸魔煞"
	rwwh[79] = "慧中灵剑"
	rwwh[80] = "火手判官"
	rwwh[81] = "雪岭双姝"
	rwwh[82] = "玉面孟尝"
	rwwh[83] = "五毒教主"
	rwwh[84] = "小王爷"
	rwwh[85] = "老谋深算"
	rwwh[86] = "金枝玉叶"
	rwwh[87] = "媚眼如丝"
	rwwh[88] = "酒神"
	rwwh[89] = "食神"
	rwwh[90] = "毓秀灵姝"	
	rwwh[91] = "青青子衿"
	rwwh[92] = "扑朔迷离"
	rwwh[94] = "仁义刀"
	rwwh[95] = "柔云剑"
	rwwh[96] = "冷月剑"
	rwwh[97] = "血刀老祖"
	rwwh[98] = "恶贯满盈"
	rwwh[101] = "笔砚生"
	rwwh[102] = "天龙禅师"
	rwwh[103] = "大轮明王"
	rwwh[104] = "珠落玉盘"
	rwwh[105] = "吴侬软语"
	rwwh[106] = "金刀无敌"
	rwwh[112] = "震天魔狼"
	rwwh[113] = "参合潜龙"
	rwwh[114] = "达摩再世"
	rwwh[115] = "聪辩先生"
	rwwh[116] = "风月无间"
	rwwh[117] = "不老长春"
	rwwh[118] = "秋水无尘"
	rwwh[129] = "中神通"
	rwwh[131] = "妙手书生"
	rwwh[138] = "一指震江南"	--瓦尔拉齐
	rwwh[140] = "剑术通神"		--风清扬
	rwwh[142] = "狂风快剑"
	rwwh[149] = "少林掌门"
	rwwh[153] = "暗器之王"
	rwwh[154] = "鸳鸯刀"
	rwwh[157] = "湘西尸王"
	rwwh[158] = "波斯大贾"
	rwwh[159] = "瑜伽鬼王"
	rwwh[160] = "尊师重道"		--达尔巴
	rwwh[161] = "赤练仙子"
	rwwh[164] = "摩天居士"
	rwwh[171] = "武当儒侠"
	rwwh[185] = "神剑仙猿"
	rwwh[186] = "神拳无敌"
	rwwh[311] = "天山双鹰"
    rwwh[510] = '曲夕烟隙'
	rwwh[511] = '盗圣'
	rwwh[517] = '大威天龙'
	rwwh[532] = '武当七侠'
	rwwh[533] = '武当七侠'
	rwwh[534] = '武当七侠'
	rwwh[535] = '武当七侠'
	rwwh[536] = '武当七侠'
	rwwh[537] = '武当七侠'
	rwwh[538] = '武当七侠'
	rwwh[553] = "真田一之兵"
	rwwh[589] = "铃剑侠女"		--水笙
	rwwh[590] = "古道西风"		--李文秀
	rwwh[592] = "无我无剑"		--独孤求败
	rwwh[597] = "金刚伏魔"		--渡厄
	rwwh[598] = "金刚伏魔"		--渡劫
	rwwh[599] = "金刚伏魔"		--渡难
	rwwh[594] = "铁索横江"		--戚长发
	rwwh[601] = "天魁地宝"		--韦小宝
	rwwh[602] = "阴阳怪气"		--海大富
	rwwh[603] = "满洲勇士"		--鳌拜
	rwwh[604] = "越女剑仙"		--阿青
	rwwh[605] = "姑射仙姿"		--林朝英
	rwwh[606] = "西域战神"		--阿凡提
	rwwh[607] = "乱世浮萍"		--焦宛儿
	rwwh[609] = "绍敏郡主"		--赵敏
	rwwh[616] = "绝情谷主"		--公孙止
	rwwh[617] = "铁掌莲花"		--裘千尺
	rwwh[626] = "小东邪"		--郭襄
	rwwh["626"] = "峨眉祖师"
	rwwh[627] = "王霸之气"		--蒙哥
	rwwh[628] = "雕兄"			--神雕
	rwwh[629] = "长平公主"		--阿九
	rwwh[631] = "谁与争锋"		--周芷若
	rwwh[642] = "精心打磨"		--四大山
	rwwh[646] = "绝色佳人"		--殷离
	rwwh[647] = "玄冥二老"		--鹤笔翁
	rwwh[648] = "玄冥二老"		--鹿杖客
	rwwh[649] = "华山玉女"		--宁中则
	rwwh[650] = "小王爷"		--杨康
	rwwh[651] = "影帝"			--张家辉
	rwwh[636] = "青莲剑仙"	    --李白
	rwwh[652] = "神州大侠"	    --萧秋水
	rwwh[635] = "西昆仑"	    --梁萧
	rwwh[497] = "金刚门人"	    --陆渐
	rwwh[498] = "小李探花"	    --李寻欢
	rwwh[638] = "九阳至尊"	    --斗酒僧
	rwwh[640] = "古墓后人"	    --黄衫女
	rwwh[189] = "晋阳大侠"	    --萧半和
	rwwh[633] = "辽东大侠"	    --胡一刀
	rwwh[500] = "剑神"	    --西门吹雪	
	rwwh[588] = "岛主夫人"	--冯蘅	
	rwwh[587] = "紫衣银鞭"	--袁紫衣		
	rwwh[586] = "昆仑三圣"	    --何足道
	rwwh[584] = "不哭死神"	    --
	rwwh[583] = "小尼姑"		--
	rwwh[582] = "冰川天女"		--	
	rwwh[581] = "丁丁当当"		--
	rwwh[580] = "银弧刀"		--	
	rwwh[579] = "盗王之王"	  --司空摘星	
	rwwh[637] = "九阴至尊"	  --黄赏
	rwwh[578] = "大唐双龙"	  --寇仲
	rwwh[634] = "逍遥祖师"	  --	逍遥子
	rwwh[577] = "禅宗始祖"	  --	达摩
	rwwh[569] = "小魔女"	  --	李沅芷
	rwwh[151] = "奔雷手"	  --	文泰来
	rwwh[574] = "寒露清梦"	  --萧玲
	rwwh[613] = "铁掌神鞭"	  
	rwwh[612] = "铁鞭震八方"
	rwwh[614] = "荒野游龙"	
	rwwh[615] = "玉堂飞燕"	
	rwwh[566] = "白衣书生"	
	rwwh[639] = "金蛇郎君"	--	
	rwwh[499] = "大理太祖"	--
	rwwh[313] = "天佛降世"	--	
	rwwh[658] = "天池怪侠"
	rwwh[657] = "悲天佛怜"	
	rwwh[656] = "天怒红颜"
	rwwh[655] = "红粉骷髅"
	rwwh[567] = "千秋侠烈"	
	rwwh[570] = "棉里针"	
	rwwh[571] = "总舵主"	
	rwwh[573] = "仁阳佛光"	
	rwwh[575] = "神剑仙猿"	
	rwwh[576] = "佛门无双"	
	rwwh[641] = "圣火明尊"		
	rwwh[568] = "精忠报国"	
	rwwh[567] = "千秋侠烈"	
	rwwh[650] = "小王爷"	
	rwwh[505] = "大唐双龙"
	rwwh[504] = "太虚剑主"
	rwwh[507] = "琅琊公子"
    rwwh[508] = "琅琊公子"	
    rwwh[513] = "长风万里"	
	rwwh[721] = "黄河老祖"	
	rwwh[546] = "风中之神"
	rwwh[610] = "妙手仁心"
	rwwh[545] = "望雪颦愁"
	rwwh[722] = "八卦高手"
	rwwh[737] = "八卦高手"
	rwwh[724] = "丐帮帮主"
	rwwh[731] = "汤大侠"		--标记修改
	rwwh[737] = "八卦高手"
	rwwh[738] = "冰肌玉骨"
	rwwh[739] = "商家堡主"		--标记修改
	rwwh[740] = "隔壁大王"		--标记修改
	rwwh[741] = "隔壁二王"		--标记修改
	rwwh[752] = "连云七略"
	rwwh[514] = "最强发型师"	--标记修改
	rwwh[757] = "怡红公子"
	rwwh[516] = "雪羽宗主"			 
	rwwh[518] = "寺绯斋"
	rwwh[758] = "密不透风"		 
							
	-- 天赋
	rwtflb = {}
	rwtflb[758] = "奇异经脉"
	rwtflb[516] = "不归三境"
	rwtflb[518] = "四斋蒸鹅心"
	rwtflb[757] = "春哥的自信"
	rwtflb[752] = "逆水寒"
	rwtflb[311] = "秃鹰"
	rwtflb[610] = "流云飞袖"	
	rwtflb[546] = "入魔"
	rwtflb[508] = "亘天赤焰"	
	rwtflb[507] = "江左梅郎"		
	rwtflb[505] = "九字真言"	
	rwtflb[517] = "绝世淫僧"	
	rwtflb[650] = "无妄无我"	
	rwtflb[567] = "傲世神罡"	
	rwtflb[568] = "决胜千里"		
	rwtflb[641] = "魔道天行"		
	rwtflb[576] = "无量禅震"	
	rwtflb[575] = "闪电惊鸿"			
	rwtflb[573] = "天域幻音"		
	rwtflb[657] = "诸法无我"		
	rwtflb[658] = "博通百家"	
	rwtflb[313] = "诸行无常"		
	rwtflb[140] = "无我无剑"		
	rwtflb[499] = "文韬武略"	
	rwtflb[27] = "化凰为凤"	  --萧玲		
	rwtflb[574] = "天仙锁魂"	  --萧玲		
	rwtflb[151] = "否极泰来"	  --文泰来	
	rwtflb[68] = "一言止杀"	  --丘处机	
	rwtflb[5] = "通微显化"	  --张三丰
	rwtflb[577] = "一苇渡江"	  --达摩	
	rwtflb[634] = "长春不老"	  --逍遥子
	rwtflb[578] = "兵法入刀"	  --寇仲	
	rwtflb[637] = "大道归藏"		 --黄赏
	rwtflb[579] = "千变万幻"		 --司空摘星
	rwtflb[629] = "浴火凤凰"		--
	rwtflb[580] = "古墓无双"		--
	rwtflb[581] = "机灵古怪"		--
	rwtflb[649] = "娇美人妻"		--宁中则
	rwtflb[583] = "普善圣心"		--仪琳
	rwtflb[582] = "雪花神剑"		--白绣		
	rwtflb[1] = "魂系一刀"
	rwtflb[4] = "跌打医生"
	rwtflb[9] = "运转乾坤"
    rwtflb[20] = "七弦无形剑"
	rwtflb[35] = "灵奇洒脱"
	rwtflb[37] = "赤心连城"
	rwtflb[38] = "名相皆无"	
	rwtflb[48] = "心无所住"
	rwtflb[49] = "福缘深厚"
	rwtflb[50] = "奋英雄怒"
	rwtflb[539] = "奋英雄怒"
	rwtflb[51] = "离合参商"
	rwtflb[53] = "磊落仁心"
	rwtflb[54] = "志垂日月"
	rwtflb[55] = "大器晚成"
	rwtflb[56] = "奇门遁甲"
	rwtflb[58] = "逆流勇进"
	rwtflb[59] = "一片冰心"
	rwtflb[60] = "倒行逆施"
	rwtflb[63] = "外和内刚"
	rwtflb[64] = "返璞归真"
	rwtflb[73] = "琴铮盈盈"
	rwtflb[74] = "巾帼之才"
	rwtflb[76] = "武中无相"
	rwtflb[77] = "珠联璧合"
	rwtflb[80] = "勇猛精进"
	rwtflb[83] = "纤纤铁手"
	rwtflb[84] = "龙象之姿"
	rwtflb[92] = "指挥若定"
	rwtflb[97] = "借刀杀人"
	rwtflb[102] = "双树枯荣"
	rwtflb[112] = "天威奋烈"
	rwtflb[116] = "北冥极渊"
	rwtflb[117] = "转瞬红颜"
	rwtflb[118] = "无相转身"
	rwtflb[129] = "仙风道骨"	
	rwtflb[153] = "千臂如来"
	rwtflb[458] = "入木三分"
	rwtflb[553] = "赤胆忠魂"
	rwtflb[565] = "十里坡剑神"	--卓不凡
	rwtflb[589] = "似水柔情"	--水笙
	rwtflb[590] = "心秀天铃"		--李文秀
	rwtflb[592] = "料敌先机"	--独孤求败
	rwtflb[595] = "一龙一象"	--宝象
	rwtflb[601] = "机敏无双"	--韦小宝
	rwtflb[605] = "惊才绝艳"	--林朝英
	rwtflb[606] = "踏沙无痕"	--阿凡提
	rwtflb[609] = "机智多谋"	--赵敏
	rwtflb[631] = "秀若芝兰"	--周芷若
	rwtflb[642] = "亿万小时"	--四大山
	rwtflb[636] = "侠客行"	--李白	
	rwtflb[652] = "惊天一剑"	--萧秋水
	rwtflb[635] = "天机神算"	--梁萧
	rwtflb[497] = "补天劫奴"	--陆渐
	rwtflb[498] = "惊才绝艳"	--李寻欢	
	rwtflb[638] = "氤氲紫气"	--斗酒僧
	rwtflb[640] = "翩若惊鸿"	--黄衫女		
	rwtflb[189] = "仁者无敌"	--萧半和	
	rwtflb[633] = "刀剑归真"	--胡一刀	
	rwtflb[500] = "剑道化身"	--西门吹雪	
	rwtflb[588] = "过目不忘"	--冯蘅
	rwtflb[586] = "何足道哉"	--何足道	
	rwtflb[584] = "麒麟臂"	    --
	rwtflb[569] = "沅芷澧兰"	--
	rwtflb[639] = "意假情真"	--	
	rwtflb[700] = "邪魅天下"	
	rwtflb[701] = "穷凶极恶"

    -- 难度文字
    MODEXZ2 = {"简单", "普通", "困难","地狱"}
end