SkillInfo = {}
-- 招式名字，威力，耗气

-- 罗汉拳
SkillInfo[1] = {
    {'童子摘葱', 250, 1},
    {'童子拜佛', 250, 2}
}

-- 逍遥游
SkillInfo[2] = {
    {'逍遥游', 250, 1}
}

-- 五毒神掌
SkillInfo[3] = {
    {'五毒摧心', 700, 1},
    {'五毒俱全', 700, 2},
    {'五毒不丈夫', 700, 2}
}

-- 鹰爪功
SkillInfo[4] = {
    {'锁喉', 700, 1},
    {'探目', 700, 2},
    {'撩阴', 700, 2}
}

-- 寒冰绵掌
SkillInfo[5] = {
    {'寒冰封体', 700, 1},
    {'冰雪严寒', 700, 2},
    {'冰厚三尺', 700, 2},
    {'冰销蚀骨', 700, 2}
}

-- 美女拳法
SkillInfo[6] = {
    {'红玉击鼓', 700, 1},
    {'文姬归汉', 700, 2},
    {'木兰弯弓', 700, 2}
}

-- 绵掌
SkillInfo[7] = {
    {'连绵不绝', 700, 1},
    {'连绵不断', 700, 2},
    {'连绵不休', 700, 2}
}

-- 天山六阳掌
SkillInfo[8] = {
    {'阳歌天钧', 900, 1},
    {'阳春白雪', 900, 2},
    {'阳关三叠', 900, 2},
    {'阳煦山立', 900, 3}
}

-- 灵蛇拳
SkillInfo[9] = {
    {'雪山白驼', 800, 1},
    {'飞鸿踏雪', 800, 2},
    {'雪上加霜', 800, 2}
}

-- 百花错拳
SkillInfo[10] = {
    {'红花天梦', 800, 1},
    {'天池缭乱', 800, 2},
    {'走马观花', 800, 2}
}

-- 九阴白骨爪
SkillInfo[11] = {
    {'探微索隐', 1100, 2},
    {'摧敌首脑', 1100, 3},
    {'如穿腐土', 1100, 3},
    {'六阴已极', 1100, 4},
    {'冥华幻灭', 1100, 4},
    {'犹鬼神幽', 1100, 5}
}

-- 落英神剑掌
SkillInfo[12] = {
    {'珞樱缤纷', 900, 1},
    {'雨急风狂', 900, 2},
    {'江城飞花', 900, 2}
}

-- 铁掌
SkillInfo[13] = {
    {'壁立千仞', 900, 1},
    {'斩钉截铁', 900, 2},
    {'铁掌莲花', 900, 3}
}

-- 天山折梅手
SkillInfo[14] = {
    {'踏雪折梅', 1200, 2},
    {'望梅止渴', 1200, 2},
    {'别有洞天', 1300, 3},
    {'天山灵鹫', 1300, 3},
    {'平淡无奇', 1400, 4}
}

-- 空明拳
SkillInfo[15] = {
    {'深藏若虚', 1200, 2},
    {'天马行空', 1200, 2},
    {'空穴来风', 1200, 2},
    {'空空如也', 1200, 3}
}

-- 太极拳
SkillInfo[16] = {
    {'野马分鬃', 1000, 2},
    {'提步探马', 1000, 2},
    {'双峰贯耳', 1000, 3},
    {'揽雀尾', 1000, 3},
    {'白鹤晾翅', 1000, 4}
}

-- 一阳指
SkillInfo[17] = {
    {'颐指气使', 1200, 2},
    {'梵指南天', 1200, 2},
    {'指矢天日', 1200, 3},
    {'紫微伏龙', 1200, 3}
}

-- 弹指神通
SkillInfo[18] = {
    {'弹指一瞬', 1200, 2},
    {'踏月香华', 1200, 2},
    {'弹冠相庆', 1200, 3},
    {'日月如梭', 1200, 3}
}

-- 幻阴指
SkillInfo[19] = {
    {'魔幻天阴', 1000, 2},
    {'梦幻泡影', 1000, 2},
    {'诪张为幻', 1000, 3},
    {'冥狱幻影', 1000, 3}
}

-- 龙爪手
SkillInfo[20] = {
    {'捉影式', 1000, 2},
    {'捕风式', 1000, 3},
    {'鼓瑟式', 1000, 3},
    {'抱残式', 1000, 4}
}

-- 玄冥神掌
SkillInfo[21] = {
    {'玄冥侵体', 1400, 2},
    {'天地幽冥', 1410, 2},
    {'天梦冥蒙', 1450, 3},
    {'冰毒缭绕', 1460, 3},
    {'飞鸿冥冥', 1470, 4},
    {'通幽洞明', 1480, 5}
}

-- 大力金刚掌
SkillInfo[22] = {
    {'大梵炼狱', 1000, 2},
    {'九仪崩乱', 1000, 2},
    {'地火燃穹', 1000, 3},
    {'金诚所至', 1000, 3}
}

-- 七伤拳
SkillInfo[23] = {
    {'五行阴阳', 1000, 2},
    {'损心催肝', 1000, 2},
    {'藏离精失', 1000, 3},
    {'三焦齐逆', 1000, 4},
    {'意恍惚诀', 1000, 4}
}

-- 须弥山神掌
SkillInfo[24] = {
    {'色空四显', 1400, 2},
    {'无色无相', 1400, 2},
    {'慑伏外道', 1400, 2},
    {'众佛参禅', 1400, 3},
    {'莲花佛相', 1400, 4},
    {'须弥芥子', 1400, 5}
}

-- 黯然销魂掌
SkillInfo[25] = {
    {'想入非非', 1500, 2},
    {'饮恨吞声', 1500, 3},
    {'行尸走肉', 1500, 3},
    {'穷途末路', 1500, 3},
    {'六神不安', 1500, 4},
    {'倒行逆施', 1500, 4},
    {'无中生有', 1500, 5}
}

-- 降龙十八掌
SkillInfo[26] = {
    {'亢龙有悔', 1500, 2},
    {'见龙在田', 1500, 2},
    {'飞龙在天', 1500, 2},
    {'双龙出水', 1500, 3},
    {'神龙摆尾', 1500, 4},
    {'潜龙勿用', 1500, 4},
    {'时乘六龙', 1500, 5}
}

-- 松风剑法
SkillInfo[27] = {
    {'平沙落雁', 300, 1},
    {'碧渊腾蛟', 300, 2}
}

-- 雷震剑法
SkillInfo[28] = {
    {'轰雷掣电', 300, 1},
    {'雷霆万钧', 300, 1}
}

-- 三分剑法
SkillInfo[29] = {
    {'冰河倒泻', 400, 1},
    {'雪中奇莲', 400, 1},
    {'千岩竞秀', 400, 2}
}

-- 万花剑法
SkillInfo[30] = {
    {'万花齐放', 500, 1},
    {'万卉争艳', 500, 1},
    {'清澈梅花', 500, 2}
}

-- 泰山十八盘
SkillInfo[31] = {
    {'五大夫剑', 500, 1},
    {'岱宗如何', 500, 1},
    {'七星落长空', 500, 2}
}

-- 云雾十三式
SkillInfo[32] = {
    {'泉鸣芙蓉', 600, 1},
    {'鹤翔紫盖', 600, 1},
    {'天柱云气', 600, 2}
}

-- 万岳朝宗
SkillInfo[33] = {
    {'叠翠浮青', 600, 1},
    {'玉进天池', 600, 1},
    {'天外玉龙', 600, 2}
}

-- 太岳三青峰
SkillInfo[34] = {
    {'苍松迎客', 600, 1},
    {'金雁横空', 600, 1},
    {'天坤倒悬', 600, 2}
}

-- 雪山剑法
SkillInfo[35] = {
    {'雪泥鸿爪', 600, 1},
    {'梅雪争春', 600, 1},
    {'雪山六出', 600, 2}
}

-- 柔云剑术
SkillInfo[36] = {
    {'杏花春雨', 700, 1},
    {'满天花雨', 700, 2},
    {'玉带围腰', 700, 2}
}

-- 两仪剑法
SkillInfo[37] = {
    {'金针渡劫', 800, 1},
    {'峭壁断云', 800, 2},
    {'仪静体闲', 800, 2}
}

-- 玉箫剑法
SkillInfo[38] = {
    {'山外清音', 800, 1},
    {'金声玉振', 800, 1},
    {'凤曲长鸣', 800, 2},
    {'响隔楼台', 800, 2}
}

-- 全真剑法
SkillInfo[39] = {
    {'素月分辉', 600, 1},
    {'疏星淡月', 700, 1},
    {'星河欲转', 800, 2}
}

-- 金蛇剑法
SkillInfo[40] = {
    {'金光蛇影', 900, 1},
    {'金蛇化龙', 950, 2},
    {'蛇困愁城', 1000, 3}
}

-- 倚天剑法
SkillInfo[41] = {
    {'玉碎昙香', 1000, 2},
    {'天劫俱灭', 1050, 2}, 
    {'倚天照海', 1100, 2},
    {'天外飞仙', 1200, 3}
}

-- 玉女剑法
SkillInfo[42] = {
    {'清饮小酌', 800, 1},
    {'举案齐眉', 850, 1},
    {'冷月窥人', 900, 2}
}

-- 斗转星移
SkillInfo[43] = {
    {'斗转星移', 1200, 2}
}

-- 苗家剑法
SkillInfo[44] = {
    {'苏秦背剑式', 1000, 2},
    {'黄龙吐须式', 1000, 2},
    {'反劈华山式', 1000, 2},
    {'怀中抱月式', 1000, 2}
}

-- 玄铁剑法
SkillInfo[45] = {
    {'逆击', 1500, 2},
    {'倒劈', 1500, 3},
    {'顺刺', 1500, 3},
    {'横削', 1500, 3},
    {'重剑无锋', 1500, 4},
    {'大巧不工', 1500, 5}
}

-- 太极剑法
SkillInfo[46] = {
    {'钟馗仗剑', 1300, 2},
    {'青龙出水', 1300, 3},
    {'白蛇吐信', 1300, 3},
    {'野马跳涧', 1300, 3},
    {'仙人指路', 1300, 4},
    {'三环套月', 1300, 4}
}

-- 独孤九剑
SkillInfo[47] = {
    {'总决式', 1600, 2},
    {'破剑式', 1600, 2},
    {'破枪式', 1600, 2},
    {'破刀式', 1600, 2},
    {'破鞭式', 1600, 2},
    {'破索式', 1600, 2},
    {'破掌式', 1600, 2},
    {'破箭式', 1600, 2},
    {'破气式', 1600, 2}
}

-- 辟邪剑法
SkillInfo[48] = {
    {'指打奸邪', 800, 2},
    {'飞燕穿柳', 1000, 3},
    {'花开见佛', 1300, 3}, 
    {'锺馗抉目', 1300, 3}, 
    {'扫荡群魔', 1400, 4},
    {'紫气东来', 1300, 5}
}

-- 六脉神剑
SkillInfo[49] = {
    {'少商剑', 1600, 2},
    {'商阳剑', 1600, 2},
    {'中冲剑', 1600, 3},
    {'关冲剑', 1600, 3},
    {'少冲剑', 1600, 3},
    {'少泽剑', 1600, 4}
}

-- 柴刀十八路
SkillInfo[50] = {
    {'砍', 300, 1},
    {'劈', 300, 2}
}

-- 万劫刀法
SkillInfo[51] = {
    {'百劫式', 500, 1},
    {'肆劫式', 500, 2}
}

-- 鬼头刀法
SkillInfo[52] = {
    {'鬼见愁', 600, 1},
    {'鬼见忧', 600, 2},
    {'鬼见糗', 600, 2}
}

-- 南山刀法
SkillInfo[53] = {
    {'燕子入巢', 600, 1},
    {'采菊东篱', 600, 2}
}

-- 鸳鸯刀法
SkillInfo[54] = {
    {'云蕾花开', 700, 1},
    {'玲珑偃月', 800, 2},
    {'只羡鸳鸯', 800, 2}
}

-- 狂风刀法
SkillInfo[55] = {
    {'狂风大作', 700, 1},
    {'飞沙走石', 700, 2},
    {'风卷残云', 700, 2}
}

-- 奇门三才刀
SkillInfo[56] = {
    {'带醉脱靴式', 400, 1},
    {'摇头摆尾式', 400, 2}
}

-- 慈悲刀法
SkillInfo[57] = {
    {'放下屠刀', 600, 1},
    {'立地成佛', 600, 2}
}

-- 修罗刀
SkillInfo[58] = {
    {'恨意绵绵', 600, 1},
    {'饮恨而终', 600, 2},
    {'含恨九泉', 600, 2}
}

-- 五虎断门刀
SkillInfo[59] = {
    {'白虎跳涧', 600, 1},
    {'剪扑自如', 600, 2},
    {'生龙活虎', 600, 2}
}

-- 反两仪刀法
SkillInfo[60] = {
    {'辗转反复', 900, 1},
    {'两小无猜', 900, 2},
    {'万劫不复', 900, 2},
    {'两仪转承', 900, 2}
}

-- 金乌刀法
SkillInfo[61] = {
    {'梅雪逢夏', 700, 1},
    {'赤日炎炎', 700, 2},
    {'锄禾当午', 700, 2}
}

-- 夫妻刀法
SkillInfo[62] = {
    {'女貌郎才', 1200, 1},
    {'丽质眷属', 1200, 2}, 
    {'清风引佩', 1200, 2}, 
    {'明月照妆', 1200, 3}
}

-- 血刀大法
SkillInfo[63] = {
    {'呕心沥血', 800, 1},
    {'批纸削腐', 800, 2},
    {'流星经天', 800, 2},
    {'血海刀风', 800, 3}
}

-- 玄虚刀法
SkillInfo[64] = {
    {'莫测高深', 900, 1},
    {'故弄玄虚', 900, 2},
    {'神而明之', 900, 2},
    {'玄天虚若', 900, 3}
}

-- 燃木刀法
SkillInfo[65] = {
    {'钻木取火', 900, 1},
    {'无名孽火', 900, 2},
    {'飞蛾扑火', 900, 2},
    {'无名业火', 900, 3}
}

-- 火焰刀法
SkillInfo[66] = {
    {'炽炎破军', 1200, 2},
    {'昊火焚天', 1200, 2},
    {'五内如焚', 1200, 3},
    {'烟焱张天', 1200, 3},
    {'炉火纯青', 1200, 3},
    {'星火燎原', 1200, 4}
}

-- 胡家刀法
SkillInfo[67] = {
    {'参拜北斗式', 1200, 2},
    {'沙鸥掠波式', 1200, 2},
    {'闭门铁扇刀', 1200, 3},
    {'缠身摘心刀', 1200, 3},
    {'拜佛听经式', 1200, 3},
    {'八方藏刀式', 1200, 4}
}

-- 杨家枪法
SkillInfo[68] = {
    {'回马枪', 500, 1},
    {'春雷震怒', 500, 2}
}

-- 毒龙鞭法
SkillInfo[69] = {
    {'毒龙出洞', 500, 1},
    {'毒龙钻风', 500, 2}
}

-- 中平枪法
SkillInfo[70] = {
    {'吊四平枪势', 400, 1},
    {'中四平枪势', 400, 2}
}

-- 裴将军帖
SkillInfo[71] = {
    {'大君制六合', 700, 1},
    {'猛将清九垓', 700, 2},
    {'战马若龙虎', 700, 2}
}

-- 棋盘招式
SkillInfo[72] = {
    {'紧气', 800, 1},
    {'提子', 800, 2},
    {'大飞', 800, 2}
}

-- 持瑶琴
SkillInfo[73] = {
    {'素手摘星', 800, 1},
    {'歌尽影生', 800, 2},
    {'高山流水', 800, 2}
}

-- 鹤蛇八打
SkillInfo[74] = {
    {'冲天一鹤', 700, 1},
    {'仙鹤穿云', 700, 2},
    {'鹤啸九天', 700, 2}
}

-- 大剪刀
SkillInfo[75] = {
    {'我咔', 800, 1},
    {'我嚓', 800, 2},
    {'我剪', 800, 2}
}

-- 海叟钓法
SkillInfo[76] = {
    {'寒江垂钓', 400, 1},
    {'江枫渔火', 400, 2}
}

-- 阴阳倒乱刃
SkillInfo[77] = {
    {"假刀非刀", 1000, 2},
    {"假剑非剑", 1000, 3},
    {"白马非马", 1000, 3},
    {"坤悬倒刺", 1000, 4}
}

-- 黄沙万里鞭
SkillInfo[78] = {
    {"血染黄沙", 900, 1},
    {"飞沙万里", 900, 2},
    {"黄粱一梦", 900, 2},
    {"海市蜃楼", 900, 3}
}

-- 银索金铃
SkillInfo[79] = {
    {"水银泻地", 1100, 2},
    {"金枝玉叶", 1100, 2},
    {"银索缠身", 1100, 3},
    {"锁穴金铃", 1100, 3}
}

-- 打狗棒法
SkillInfo[80] = {
    {'棒打狗头', 1400, 2},
    {'反截狗臀', 1400, 2},
    {'獒口夺杖', 1400, 3},
    {'棒打双犬', 1400, 3},
    {'恶狗拦路', 1400, 4},
    {'天下无狗', 1400, 5}
}

-- 灵蛇杖法
SkillInfo[81] = {
    {'怪蟒翻身', 1400, 2},
    {'毒蛇吐信', 1400, 2},
    {'蛇己旧人', 1400, 3},
    {'打草惊蛇', 1400, 3},
    {'蛇蝎心肠', 1400, 4},
    {'灵蛇之珠', 1400, 5}
}

-- 金刚伏魔圈
SkillInfo[82] = {
    {'祗园精舍', 1400, 2},
    {'诸行无常', 1400, 2},
    {'娑罗双树', 1400, 3}, 
    {'幻梦一场', 1400, 4},
    {'佛陀割肉', 1400, 4},
    {'金刚伏魔', 1400, 5}
}

-- 无上大力杵
SkillInfo[83] = {
    {'力战千钧', 1200, 2},
    {'拔山填海', 1200, 3},
    {'千钧压顶', 1200, 3},
    {'推象伏虎', 1200, 4}
}

-- 倚天屠龙功
SkillInfo[84] = {
    {'武林至尊', 1400, 2},
    {'宝刀屠龙', 1400, 3},
    {'号令天下', 1400, 3},
    {'莫敢不从', 1400, 3},
    {'倚天不出', 1400, 3},
    {'谁与争锋', 1400, 4}
}

-- 北冥神功
SkillInfo[85] = {
    {'北冥神功', 1200, 2}
}

-- 伏魔杖法
SkillInfo[86] = {
    {'天魔降伏', 1400, 2},
    {'佛怒唐莲', 1400, 3},
    {'祸福倚伏', 1400, 3},
    {'摩诃无量', 1400, 3},
    {'佛高一尺', 1400, 3},
    {'佛魔摄道', 1400, 4}
}

-- 化功大法
SkillInfo[87] = {
    {'化功大法', 1000, 2}
}

-- 吸星大法
SkillInfo[88] = {
    {'吸星大法', 1000, 2}
}

-- 紫霞神功
SkillInfo[89] = {
    {'紫霞神功', 1200, 2}
}

-- 混元功
SkillInfo[90] = {
    {'混元功', 1200, 2}
}

-- 金刚狮子吼
SkillInfo[91] = {
    {'金刚狮子吼', 1200, 2}
}

-- 狮子吼
SkillInfo[92] = {
    {'狮子吼神功', 1000, 2}
}

-- 圣火神功
SkillInfo[93] = {
    {'石火电光', 900, 1},
    {'火中取栗', 950, 2},
    {'明火执仗', 1000, 2},
    {'烽火连天', 1100, 3}
}

-- 神照功
SkillInfo[94] = {
    {'神照功', 850, 2}
}

-- 蛤蟆功
SkillInfo[95] = {
    {'蛤蟆功', 900, 2}
}

-- 罗汉伏魔功
SkillInfo[96] = {
    {'罗汉伏魔功', 900, 2}
}

-- 乾坤大挪移
SkillInfo[97] = {
    {'乾坤大挪移', 850, 2}
}

-- 小无相功
SkillInfo[98] = {
    {'小无相功', 1000, 2}
}

-- 纯阳无极功
SkillInfo[99] = {
    {'纯阳无极功', 900, 2}
}

-- 先天功
SkillInfo[100] = {
    {'先天功', 1000, 2}
}

-- 八荒六合功
SkillInfo[101] = {
    {'八荒六合功', 1000, 2}
}

-- 太玄神功
SkillInfo[102] = {
    {'赵客缦胡缨', 1200, 2},
    {'银鞍照白马', 1200, 2},
    {'三杯吐然诺', 1200, 2},
    {'纵死侠骨香', 1200, 2},
    {'白首太玄经', 1200, 2}
}

-- 龙象般若功
SkillInfo[103] = {
    {'龙象般若功', 1350, 2}
}

-- 逆运真经
SkillInfo[104] = {
    {'逆运神功', 1200, 2}
}

-- 葵花神功
SkillInfo[105] = {
    {'葵花神功', 1300, 2}
}

-- 九阳神功
SkillInfo[106] = {
    {'清风拂山冈', 1500, 2},
    {'他恶任他恶', 1500, 2},
    {'一口真气足', 1500, 4},
    {'他强任他强', 1500, 4},
    {'明月照大江', 1500, 4}
}

-- 九阴神功
SkillInfo[107] = {
    {'九阴神功', 1400, 2}
}

-- 易筋神功
SkillInfo[108] = {
    {'易筋神功', 1400, 2}
}

-- 野球拳
SkillInfo[109] = {
    {'石头', 1200, 1},
    {'剪子', 1200, 1},
    {'布', 1200, 1}
}

-- 神山剑法
SkillInfo[110] = {
    {'神洲移山剑', 1200, 1},
    {'神洲镇山剑', 1200, 1},
    {'神洲擎山剑', 1200, 1}
}

-- 西瓜刀法
SkillInfo[111] = {
    {'切瓜', 1200, 1},
    {'剁瓜', 1200, 1},
    {'砍瓜', 1200, 1}
}

-- 犽月流空
SkillInfo[112] = {
    {'月樱流', 1200, 1},
    {'月犽流', 1200, 1},
    {'月骁流', 1200, 1}
}

-- 闪电貂
SkillInfo[113] = {
    {'闪电貂', 600, 1}
}

-- 连城剑法
SkillInfo[114] = {
    {'西辞黄鹤楼', 900, 1},
    {'三月下扬州', 900, 2},
    {'远影碧空尽', 900, 2},
    {'长江天际流', 900, 3}
}

-- 三花聚顶掌
SkillInfo[115] = {
    {'炼精化气', 700, 1},
    {'炼气化神', 700, 2},
    {'炼神还虚', 700, 2}
}

-- 妙手空空
SkillInfo[116] = {
    {'探云手', 400, 1},
    {'揽月手', 400, 2}
}

-- 分筋错骨手
SkillInfo[117] = {
    {'腋底偷桃', 700, 1},
    {'截肘扣带', 700, 2},
    {'分筋错骨', 700, 2}
}

-- 化骨绵掌
SkillInfo[118] = {
    {'积毁销骨', 1000, 2},
    {'挫骨扬灰', 1000, 3},
    {'敲骨吸髓', 1000, 3},
    {'百鬼恸哭', 1000, 4}
}

-- 满州摔跤
SkillInfo[119] = {
    {'拿臂踹', 600, 1},
    {'倒臂踹', 600, 2},
    {'背負投', 600, 2}
}

-- 冰蚕毒掌
SkillInfo[120] = {
    {'冰消瓦解', 1100, 2},
    {'鲸吞蚕食', 1100, 2},
    {'如履薄冰', 1100, 3},
    {'冰毒缭绕', 1100, 3}
}

-- 铁指诀
SkillInfo[121] = {
    {'长风染指', 250, 1},
    {'指东话西', 250, 2}
}

-- 天竺佛指
SkillInfo[122] = {
    {'戟指怒目', 400, 1},
    {'指天画地', 400, 2}
}

-- 夺魄指
SkillInfo[123] = {
    {'迷魂夺魄', 400, 1},
    {'惊魂夺魄', 400, 2}
}

-- 去烦恼指
SkillInfo[124] = {
    {'烦心倦目', 600, 1},
    {'灰身泯智', 600, 2},
    {'牛山下涕', 600, 2}
}

-- 袖中指
SkillInfo[125] = {
    {'斫头谢天', 400, 1},
    {'临溪观鱼', 400, 2},
    {'井底之蛙', 400, 2}
}

-- 兰花拂穴手
SkillInfo[126] = {
    {'春深芳草尽', 500, 1},
    {'夏闲独兰馨', 500, 2},
    {'秋酣菊霜清', 500, 2}
}

-- 透骨打穴
SkillInfo[127] = {
    {'封穴结脉', 600, 1},
    {'透骨打穴', 600, 2},
    {'戳穴截血', 600, 2}
}

-- 一指禅
SkillInfo[128] = {
    {'一指头禅', 700, 1},
    {'一指破天', 700, 2},
    {'一指圆寂', 700, 3}
}

-- 旋风扫叶腿
SkillInfo[129] = {
    {'风起涟漪', 800, 1},
    {'落叶知秋', 800, 2},
    {'天旋地转', 800, 2}
}

-- 玄天指
SkillInfo[130] = {
    {'剖玄析微', 800, 1},
    {'钩玄提要', 800, 2},
    {'玄裳缟衣', 800, 2}
}

-- 黑风指
SkillInfo[131] = {
    {'阴风愁肠', 800, 1},
    {'捕风捉影', 800, 2},
    {'凄风苦雨', 800, 2}
}

-- 多罗叶指
SkillInfo[132] = {
    {'佛陀问路', 900, 1},
    {'雷音佛声', 900, 2},
    {'五丁开山', 900, 2}
}

-- 大智无定指
SkillInfo[133] = {
    {'三体顶天', 1000, 2},
    {'托佛珈蓝', 1000, 3},
    {'无踪无定', 1000, 3},
    {'大智若愚', 1000, 3}
}

-- 凝血神爪
SkillInfo[134] = {
    {'风驰电掣', 1000, 2},
    {'阴凝坚冰', 1000, 3},
    {'黄石纳履', 1000, 3},
    {'逆挽天华', 1000, 3}
}

-- 大力金刚指
SkillInfo[135] = {
    {'金刚揭谛', 1400, 2},
    {'正骨松筋', 1400, 2},
    {'金刚菩提', 1400, 3},
    {'铁指拔钉', 1400, 3},
    {'金刚震脉', 1400, 4},
    {'金刚般若', 1400, 5}
}

-- 无相劫指
SkillInfo[136] = {
    {'天保九如', 1300, 2},
    {'天马行空', 1300, 3},
    {'天地玄黄', 1300, 3},
    {'千劫不动', 1300, 4},
    {'金刚无相', 1300, 4},
    {'天火焚城', 1300, 5}
}

-- 拈花指
SkillInfo[137] = {
    {'花供佛残', 1500, 2},
    {'折花修佛', 1500, 3},
    {'拈花一笑', 1500, 3},
    {'佛拜昙花', 1500, 4}
}

-- 参合指
SkillInfo[138] = {
    {'国破山河在', 1500, 2},
    {'感时花溅泪', 1500, 3},
    {'锋火连三月', 1500, 3},
    {'兵败参合陂', 1500, 3},
    {'顾盼子孙贤', 1500, 3},
    {'铭记复国志', 1500, 4}
}

-- 玉女素心剑
SkillInfo[139] = {
    {'清饮小酌', 1400, 2},
    {'浪迹天涯', 1400, 3},
    {'举案齐眉', 1400, 3},
    {'皓腕玉镯', 1400, 3},
    {'冷月窥人', 1400, 4},
    {'竹帘临池', 1400, 4}
}

-- 达摩剑法
SkillInfo[140] = {
    {'万事随缘往', 1000, 2},
    {'来去若梦行', 1000, 3},
    {'浮世沧桑远', 1000, 3},
    {'轮回法舟轻', 1000, 4}
}

-- 百胜刀法
SkillInfo[141] = {
    {'却月天戈', 1000, 2},
    {'孤月寒江', 1000, 3},
    {'寒光百刃', 1000, 3},
    {'百战百胜', 1000, 4}
}

-- 妙笔丹青
SkillInfo[142] = {
    {'妙笔生花', 1200, 2},
    {'神笔马良', 1200, 3},
    {'神封太渊', 1200, 3},
    {'铁血丹心', 1200, 4}
}

-- 铁剑
SkillInfo[143] = {
    {'铁面无私', 1000, 2},
    {'铁树开花', 1000, 3},
    {'铁证如山', 1000, 3},
    {'铁杵磨针', 1000, 4}
}

-- 金刚不坏体
SkillInfo[144] = {
    {'金刚不坏体', 1000, 2}
}

-- 飞天神行
SkillInfo[145] = {
    {'飞天神行', 1000, 2}
}

-- 神行百变
SkillInfo[146] = {
    {'神行百变', 1000, 2}
}

-- 凌波微步
SkillInfo[147] = {
    {'凌波微步', 1000, 2}
}

-- 天罗地网
SkillInfo[148] = {
    {'天罗地网', 1000, 2}
}

-- 梯云纵
SkillInfo[149] = {
    {'梯云纵', 1000, 2}
}

-- 瞬息千里
SkillInfo[150] = {
    {'瞬息千里', 1000, 2}
}

-- 斩流剑术
SkillInfo[151] = {
    {'一念无量', 1400, 2},
    {'现世执妄', 1400, 3}, 
    {'悟入幻想', 1400, 3},
    {'草木成佛', 1400, 3}, 
    {'天人五衰', 1400, 4},
    {'六根清净', 1400, 4}
}

-- 太虚剑意
SkillInfo[152] = {
    {'太虚剑意', 1450, 2}
}

-- 沧溟刀法
SkillInfo[153] = {
    {'素月分辉', 1200, 2},
    {'银河共影', 1200, 3},
    {'沧海遗珠', 1200, 3},
    {'陵谷沧桑', 1200, 3},
    {'溟思苦想', 1200, 4},
    {'溟顽不灵', 1200, 4}
}

-- 玉女心经
SkillInfo[154] = {
    {'玉女心经', 1100, 2}
}

-- 火枪
SkillInfo[155] = {
    {'射击', 1500, 2},
    {'齐射', 1500, 3},
    {'钓瓶击', 1500, 3},
    {'三段击', 1500, 3},
    {'飞鸟击', 1500, 4},
    {'乱射', 1500, 4}
}

-- 越女剑法
SkillInfo[156] = {
    {'电照长空', 1500, 2},
    {'仙猿剑舞', 1500, 3},
    {'越畔之思', 1500, 3},
    {'天女散花', 1500, 3},
    {'诛天凌神', 1500, 4},
    {'天仙剑影', 1500, 5}
}

-- 枣核钉
SkillInfo[157] = {
    {'囫囵吞枣', 1000, 2},
    {'付之梨枣', 1000, 3},
    {'透骨腐肉', 1000, 3},
    {'瞬狱一杀', 1000, 4}
}

-- 五轮大转
SkillInfo[158] = {
    {'天高云淡', 1300, 2},
    {'天灾人祸', 1300, 3},
    {'天魔降伏', 1300, 3},
    {'天移日易', 1300, 3},
    {'天罡震烈', 1300, 4},
    {'天舞宝轮', 1300, 4}
}

-- 苍狼战戟
SkillInfo[159] = {
    {'苍髯如戟', 2000, 2},
    {'染苍染黄', 2000, 3},
    {'鬼哭狼嚎', 2000, 3},
    {'狼烟四起', 2000, 3},
    {'魔澜惊炽', 2000, 4},
    {'罗摩沌灭', 2000, 4}
}

-- 天魔功
SkillInfo[160] = {
    {'天魔功', 1200, 2}
}

-- 玄女剑法
SkillInfo[161] = {
    {'碧落穹苍', 1200, 2},
    {'飞花逐蝶', 1200, 3},
    {'月下花前', 1200, 3},
    {'玄裳缟衣', 1200, 4}
}

-- 狂风快剑
SkillInfo[162] = {
    {'一叶扁舟', 1300, 2},
    {'天外飞龙', 1300, 3},
    {'风驰云卷', 1300, 3},
    {'长风破浪', 1300, 3}
}

-- 血海魔功
SkillInfo[163] = {
    {'血海魔功', 800, 2}
}

-- 白蟒鞭法
SkillInfo[164] = {
    {'残烛引月', 1200, 2},
    {'杯弓蛇影', 1200, 3},
    {'白璧微瑕', 1200, 3},
    {'晦蟒否塞', 1200, 4}
}

-- 呼延枪法
SkillInfo[165] = {
    {'呼颈举踵', 400, 1},
    {'冲锋陷阵', 400, 3}
}

-- 天池心法
SkillInfo[166] = {
    {'天池心法', 900, 2}
}

-- 青莲剑法
SkillInfo[167] = {
    {'长风万里', 1400, 2},
    {'对酣高楼', 1400, 3},
    {'蓬莱文章', 1400, 3},
    {'小谢清发', 1400, 4},
    {'青天览月', 1400, 4},
    {'对酒当歌', 1400, 5}
}

-- 逍遥神剑
SkillInfo[168] = {
    {'既不回头', 1600, 2},
    {'何必不忘', 1600, 3},
    {'既然无缘', 1600, 3},
    {'何需誓言', 1600, 3},
    {'今日种种', 1600, 3},
    {'似水无痕', 1600, 4},
    {'明夕何夕', 1600, 4},
    {'君已陌路', 1600, 5}
}

-- 瑜伽密乘
SkillInfo[169] = {
    {'瑜伽密乘', 1100, 2}
}

-- 三阴腐尸掌
SkillInfo[170] = {
    {'行尸走肉', 1100, 2},
    {'尸居余气', 1100, 3},
    {'尸山血海', 1100, 3},
    {'三尸五鬼', 1100, 4}
}

-- 太神神功
SkillInfo[171] = {
    {'太神神功', 1300, 2}
}

-- 潮汐神功
SkillInfo[172] = {
    {'潮汐神功', 1300, 2}
}

-- 千手如来掌
SkillInfo[173] = {
    {'清风拂桂', 1250, 3},
    {'仰月承霖', 1250, 3},
    {'风满长空', 1250, 4},
    {'四方散花', 1250, 4}
}

-- 阴风刀
SkillInfo[174] = {
    {'鬼魅魍魉', 1200, 2},
    {'尸鬼封尽', 1200, 2},
    {'阴风阵阵', 1200, 3},
    {'利刃寒锋', 1200, 3}
}

-- 五岳剑诀
SkillInfo[175] = {
    {'五岳剑诀', 1250, 2}
}

-- 烈火剑法
SkillInfo[176] = {
    {'天灰地烬', 2000, 2},
    {'余烬复燃', 2000, 2},
    {'薪烬火传', 2000, 3}
}

-- 忘情天书
SkillInfo[177] = {
    {'忘情天书', 1250, 2}
}

-- 浣花剑法
SkillInfo[178] = {
    {'浣花剑法', 1250, 2}
}

-- 碧海惊涛掌
SkillInfo[179] = {
    {'长风破浪', 1200, 2},
    {'碧波汹涌', 1300, 3},
    {'惊涛骇浪', 1400, 3},
    {'白浪滔天', 1400, 3},
    {'波谲云诡', 1400, 4},
    {'碧海长空', 1600, 4}
}

-- 鲸息功
SkillInfo[180] = {
    {'鲸息功', 1350, 2}
}

-- 井月八法
SkillInfo[181] = {
    {'不攻', 1300, 2},
    {'击奇', 1300, 2},
    {'兵诈', 1300, 3},
    {'方圆', 1400, 4}
}

-- 小李飞刀
SkillInfo[182] = {
    {'小李飞刀', 1300, 2}
}

-- 不老长春功
SkillInfo[183] = {
    {'不老长春功', 1300, 2}
}

-- 九宵仙息
SkillInfo[184] = {
    {'九宵仙息', 1300, 2}
}

-- 阳春白雪曲
SkillInfo[185] = {
    {'宫', 1200, 2},
    {'商', 1300, 3},
    {'角', 1400, 3},
    {'徵', 1400, 3},
    {'羽', 1400, 4}
}

-- 一苇渡江
SkillInfo[186] = {
    {'一苇渡江', 0, 0}
}

-- 擒龙手
SkillInfo[187] = {
    {'羚羊挂角', 1100, 2},
    {'倏然而至', 1100, 2},
    {'手到擒来', 1100, 3},
    {'徒手擒龙', 1200, 3}
}

-- 猿公剑法
SkillInfo[188] = {
    {'剑气长空', 1200, 2},
    {'剑灵寰宇', 1200, 2},
    {'剑主天地', 1200, 3},
    {'剑破苍穹', 1200, 4}
}

-- 般若掌
SkillInfo[189] = {
    {'童子拜佛', 1400, 2},
    {'礼戒四参', 1400, 3},
    {'一拍两散', 1400, 3},
    {'观照般若', 1400, 3},
    {'妄想皆无', 1400, 4},
    {'大梵般若', 1400, 5}
}

-- 大周天功
SkillInfo[190] = {
    {'大周天功', 1200, 2}
}

-- 奔雷手
SkillInfo[191] = {
    {'轰雷贯耳', 1100, 2},
    {'雷鸣瓦釜', 1100, 2},
    {'平地风雷', 1100, 3},
    {'电闪雷鸣', 1100, 3}
}

-- 追魂夺命剑
SkillInfo[192] = {
    {'孟婆灌汤', 1300, 2},
    {'一剑封喉', 1300, 2},
    {'神驼骏足', 1300, 3},
    {'勾魂摄魄', 1300, 3},
    {'目断魂销', 1300, 4},
    {'追魂夺命', 1400, 5}
}

-- 庖丁解牛刀
SkillInfo[193] = {
    {'族庖月更刀', 1400, 2},
    {'良庖岁更刀', 1400, 3},
    {'无厚入有间', 1400, 3},
    {'游刃必有馀', 1400, 4}
}

-- 袈裟伏魔功
SkillInfo[194] = {
    {'菩提上首', 1200, 2},
    {'处众人天', 1200, 3},
    {'龙披免难', 1200, 3},
    {'得成佛道', 1200, 4}
}

-- 连环迷踪腿
SkillInfo[195] = {
    {'灭景追风', 800, 2},
    {'驷马不追', 800, 3},
    {'穷追不舍', 800, 3},
    {'追云逐电', 800, 3}
}

-- 铁布衫
SkillInfo[196] = {
    {'铁布衫', 1000, 2}
}

-- 无极玄功拳
SkillInfo[197] = {
    {'冲天炮', 1100, 2},
    {'铁牛耕地', 1100, 2},
    {'仙鹤亮翅', 1200, 3}
}

-- 岳王散手
SkillInfo[198] = {
    {'黑虎剪尾', 1100, 2},
    {'上动不停', 1100, 3},
    {'饱虎登山', 1200, 3},
    {'黑虎剪', 1200, 3}
}

-- 武穆遗书
SkillInfo[199] = {
    {'武穆遗书', 1000, 2}
}

-- 岳家枪法
SkillInfo[200] = {
    {'锁喉枪', 1400, 2},
    {'一夫当关', 1400, 3},
    {'枕戈待旦', 1400, 3},
    {'烽火连城', 1400, 4},
    {'满江红', 1400, 4},
    {'踏破龙城', 1400, 4}
}

-- 寒袖拂穴
SkillInfo[201] = {
    {'春寒乍暖', 1200, 2},
    {'寒泉滞骨', 1200, 3},
    {'独立寒秋', 1200, 3},
    {'寒月笼纱', 1200, 4}
}

-- 白虹掌
SkillInfo[202] = {
    {'隐若白虹起', 1200, 2},
    {'呼气成白虹', 1200, 2},
    {'白虹为贯日', 1200, 3},
    {'薄暮垂虹去', 1200, 3}
}

-- 长生诀
SkillInfo[203] = {
    {'长生诀', 1350, 2}
}

-- 擒龙功
SkillInfo[204] = {
    {'擒龙功', 1250, 2}
}

-- 震天铁掌
SkillInfo[205] = {
    {'震响十里', 800, 1},
    {'隔山打牛', 800, 2},
    {'熔金碎石', 800, 2},
    {'如雷贯耳', 800, 3}
}

-- 呼延十八鞭
SkillInfo[206] = {
    {'毒龙出洞', 400, 1},
    {'行步蹬虎', 400, 2}
}

-- 枯荣禅功
SkillInfo[207] = {
    {'枯荣禅功', 1000, 2}
}

-- 少林心法
SkillInfo[208] = {
    {'少林心法', 500, 2}
}

-- 武当心法
SkillInfo[209] = {
    {'武当心法', 500, 2}
}

-- 全真心法
SkillInfo[210] = {
    {'全真心法', 500, 2}
}

-- 古墓心法
SkillInfo[211] = {
    {'古墓心法', 500, 2}
}

-- 华山心法
SkillInfo[212] = {
    {'华山心法', 500, 2}
}

-- 嵩山心法
SkillInfo[213] = {
    {'嵩山心法', 500, 2}
}

-- 血刀心法
SkillInfo[214] = {
    {'血刀心法', 500, 2}
}

-- 莲花功
SkillInfo[215] = {
    {'莲花功', 500, 2}
}

-- 寒冰真气
SkillInfo[216] = {
    {'寒冰真气', 1000, 2}
}

-- 地火功
SkillInfo[217] = {
    {'地火功', 500, 2}
}

-- 峨眉心法
SkillInfo[218] = {
    {'峨眉心法', 500, 2}
}

-- 小星罗功
SkillInfo[219] = {
    {'小星罗功', 800, 2}
}

-- 五毒神功
SkillInfo[220] = {
    {'五毒神功', 900, 2}
}

-- 阴阳无极功
SkillInfo[221] = {
    {'阴阳无极功', 1200, 2}
}

-- 天道剑势
SkillInfo[222] = {
    {'道亦不变', 1500, 2},
    {'天道恢恢', 1500, 2},
    {'天地无极', 1500, 3},
    {'道不相谋', 1500, 4},
    {'无我无剑', 1500, 4},
    {'八荒归元', 1500, 5}
}

-- 金雁功
SkillInfo[223] = {
    {'金雁功', 1200, 2}
}

-- 蛇行狸翻
SkillInfo[224] = {
    {'蛇行狸翻', 1200, 2}
}

-- 小周天功
SkillInfo[225] = {
    {'小周天功', 900, 2}
}

-- 葵花点穴手
SkillInfo[226] = {
    {'势如疾风', 1200, 2},
    {'快如闪电', 1200, 3},
    {'葵藿倾阳', 1200, 3},
    {'拔葵去织', 1200, 4},
    {'葵花向日', 1200, 5}
}

-- 龟息功
SkillInfo[227] = {
    {'龟息功', 1000, 2}
}

-- 疯魔棍法
SkillInfo[228] = {
    {'托枪上阵', 900, 1},
    {'提膝托棍', 900, 2},
    {'仆步摔棍', 900, 2},
    {'摘心挖眉', 900, 3}
}

-- 金蛇缠丝手
SkillInfo[229] = {
    {'杯弓蛇影', 900, 1},
    {'灵蛇之珠', 900, 2},
    {'引蛇出洞', 900, 2},
    {'龙蛇飞动', 900, 3}
}

-- 八卦掌法
SkillInfo[230] = {
    {'倚马文路', 500, 1},
    {'鸿雁出群', 500, 2},
    {'闭门推月', 500, 3}
}

-- 八卦刀法
SkillInfo[231] = {
    {'叶底藏花', 500, 1},
    {'凤凰回窝', 500, 2},
    {'夹马势按刀', 500, 3}
}

-- 五虎棍法
SkillInfo[232] = {
    {'猛虎下山', 500, 1},
    {'饿虎扑食', 500, 2},
    {'虎啸山林', 500, 2}
}

-- 神足经
SkillInfo[233] = {
    {'神足功', 1200, 2}
}

-- 五行六合掌
SkillInfo[234] = {
    {'利金', 1000, 2},
    {'清水', 1000, 2},
    {'玄木', 1000, 3},
    {'烈火', 1000, 4}
}

-- 八卦心法
SkillInfo[235] = {
    {'八卦心法', 500, 2}
}

-- 神门十三剑
SkillInfo[236] = {
    {'似攻非攻', 1000, 1},
    {'张弛有度', 1000, 2},
    {'剑断长川', 1000, 2},
    {'华光流转', 1000, 3}
}

-- 灵鳌步
SkillInfo[237] = {
    {'灵鳌步', 500, 2}
}

-- 浮游功
SkillInfo[238] = {
    {'浮游功', 1300, 2}
}

-- 扶摇九天
SkillInfo[239] = {
    {'扶摇九天', 500, 2}
}

-- 流云飞袖
SkillInfo[240] = {
    {'流水击石', 1200, 1},
    {'白云出岫', 1200, 2},
    {'云淡风轻', 1200, 2},
    {'流云四散', 1200, 3}
}

-- 武当九阳功
SkillInfo[241] = {
    {'武当九阳功', 900, 2}
}

-- 峨眉九阳功
SkillInfo[242] = {
    {'峨眉九阳功', 900, 2}
}

-- 少林九阳功
SkillInfo[243] = {
    {'少林九阳功', 900, 2}
}

-- 虎爪绝户手
SkillInfo[244] = {
    {'猛虎出涧', 900, 2},
    {'虎头铁尾', 900, 2},
    {'饿虎扑食', 900, 3},
    {'虎啸生风', 900, 3}
}

-- 绕指柔剑
SkillInfo[245] = {
    {'鱼跃龙门', 600, 1},
    {'白猿献果', 600, 2},
    {'柔月穿空', 600, 2}
}

-- 芙蓉金针
SkillInfo[246] = {
    {'芙蓉金针', 0, 0}
}

-- 碧罗掌
SkillInfo[247] = {
    {'碧波里', 500, 1},
    {'瑶天地', 500, 2},
    {'水翠凝', 600, 2}
}

-- 流云掌
SkillInfo[248] = {
    {'南岳支天', 800, 1},
    {'流云落雪', 900, 2},
    {'风云幻变', 900, 2}
}

-- 回风落雁剑
SkillInfo[249] = {
    {'一剑落九雁', 400, 1},
    {'回风破长空', 500, 2},
    {'神风划天翔', 600, 2}
}

-- 衡山五神剑
SkillInfo[250] = {
    {'祝融剑', 800, 1},
    {'紫盖剑', 800, 2},
    {'石禀剑', 900, 2},
    {'天柱剑', 900, 2},
    {'芙蓉剑', 900, 2}
}

-- 镇岳诀
SkillInfo[251] = {
    {'镇岳尚方', 800, 2}
}

-- 无妄神咒
SkillInfo[252] = {
    {'天雷无妄', 700, 2},
    {'无妄而得', 700, 2}
}

-- 神跌鬼倒
SkillInfo[253] = {
    {'莫说狂', 900, 1},
    {'莫笑痴', 900, 2},
    {'莫怕醉', 900, 2}
}

-- 伏魔剑法
SkillInfo[254] = {
    {'韦陀宝杵', 600, 1},
    {'霞光神兽', 600, 2},
    {'神魔辟易', 600, 2}
}

-- 天长掌法
SkillInfo[255] = {
    {'敬捧宝经', 500, 1},
    {'春去秋来', 500, 2},
    {'天长地久', 500, 2}
}

-- 春蚕掌法
SkillInfo[256] = {
    {'春蚕结丝', 900, 1},
    {'春蚕破茧', 900, 2},
    {'千丝万绕', 900, 2}
}

-- 降魔掌
SkillInfo[257] = {
    {'因果报应', 700, 1},
    {'业缘自作', 700, 2},
    {'善恶由心', 700, 2}
}

-- 静心守剑
SkillInfo[258] = {
    {'以静制动', 800, 1},
    {'心静则凉', 800, 2},
    {'静由心生', 800, 2}
}

-- 古针禅功
SkillInfo[259] = {
    {'古针渡劫', 800, 2}
}

-- 五大夫剑
SkillInfo[260] = {
    {'苍翠相掩', 600, 1},
    {'虬枝斜出', 600, 2},
    {'五大夫松', 600, 2}
}

-- 七星落长空
SkillInfo[261] = {
    {'来鹤清泉', 800, 1},
    {'石关回马', 800, 2},
    {'长空星落', 800, 2}
}

-- 磐罡掌
SkillInfo[262] = {
    {'造化神秀', 800, 1},
    {'一览众山', 800, 2},
    {'会当绝顶', 800, 2},
    {'齐鲁青未', 800, 3}
}

-- 开山掌
SkillInfo[263] = {
    {'愚公移山', 500, 1},
    {'泰山压顶', 500, 2},
    {'三山五岳', 500, 2}
}

-- 磐石法诀
SkillInfo[264] = {
    {'不动明王', 700, 1},
    {'八方不倒', 700, 2},
    {'坚若磐石', 700, 2}
}

-- 参合剑气
SkillInfo[265] = {
    {'北斗移辰', 1500, 2},
    {'参商永合', 1500, 3},
    {'陨石星浪', 1500, 3},
    {'天幻星辰', 1500, 4},
    {'日月星光', 1500, 4},
    {'乾坤星阵', 1500, 5}
}

-- 北斗剑法
SkillInfo[266] = {
    {'天枢', 350, 1},
    {'天璇', 350, 2}
}

-- 降魔刀法
SkillInfo[267] = {
    {'戒杀', 800, 1},
    {'破邪', 800, 2},
    {'去妄', 800, 2},
    {'除嗔', 800, 3}
}

-- 回风拂柳刀
SkillInfo[268] = {
    {'回风剑拂柳', 500, 1},
    {'狂风剑破空', 500, 2},
    {'神风剑卷地', 500, 2}
}

-- 八卦游龙掌
SkillInfo[269] = {
    {'猛虎伏桩', 800, 1},
    {'游空探爪', 800, 2},
    {'龙盘八卦', 800, 2}
}

-- 金刚伏虎刀
SkillInfo[270] = {
    {'虎踞龙蟠', 700, 1},
    {'游龙出水', 700, 2},
    {'云起龙骧', 700, 2}
}

-- 周公剑法
SkillInfo[271] = {
    {'天如穹庐', 900, 2},
    {'白雾茫茫', 900, 3},
    {'斜风细雨', 900, 3},
    {'暮短夜长', 900, 3}
}

-- 大嵩阳掌
SkillInfo[272] = {
    {'破山斧', 800, 1},
    {'千掌环', 800, 2},
    {'无影掌', 800, 2},
    {'万丈烈阳', 800, 3}
}

-- 寒冰神掌
SkillInfo[273] = {
    {'冰封千里', 800, 1},
    {'天寒地冻', 800, 2},
    {'连绵冰山', 800, 2}
}

-- 快慢十八路
SkillInfo[274] = {
    {'快剑式', 400, 1},
    {'慢剑式', 400, 2},
    {'拖剑式', 400, 2},
    {'突剑式', 400, 2}
}

-- 子午十二剑
SkillInfo[275] = {
    {'开门见嵩', 900, 1},
    {'千古人龙', 900, 2},
    {'游剑子午', 900, 2}
}

-- 迅雷剑法
SkillInfo[276] = {
    {'一字狂雷', 900, 1},
    {'风雷雨急', 900, 2},
    {'心雷万丈', 900, 2}
}

-- 雨打飞花剑
SkillInfo[277] = {
    {'泛舟听雨', 400, 1},
    {'落雨散花', 400, 2},
    {'乱花覆剑', 400, 2}
}

-- 三阴手
SkillInfo[278] = {
    {'手三阴', 400, 1},
    {'足三阴', 400, 2},
    {'体三阴', 400, 2}
}

-- 落雁掌
SkillInfo[279] = {
    {'雁纵如烟', 400, 1},
    {'雁影若墨', 400, 2},
    {'雁翼似刀', 400, 2}
}

-- 红砂掌
SkillInfo[280] = {
    {'朱笔红砂', 600, 1},
    {'处子红砂', 600, 2},
    {'铸铁红砂', 600, 2}
}

-- 蝎尾钩
SkillInfo[281] = {
    {'蝎尾钩', 0, 0}
}

-- 易水寒诀
SkillInfo[282] = {
    {'易水寒诀', 1300, 2}
}

-- 易筋锻骨篇
SkillInfo[283] = {
    {'易筋锻骨篇', 800, 1}
}

-- 一气化三清
SkillInfo[284] = {
    {'元始', 1000, 1},
    {'灵宝', 1000, 2},
    {'太上', 1000, 2}
}

-- 履霜破冰拳
SkillInfo[285] = {
    {'如履薄冰', 1000, 1},
    {'履霜坚冰', 1000, 2},
    {'破冰而行', 1000, 2}
}

-- 昊天掌
SkillInfo[286] = {
    {'肇化荒宇', 1400, 2},
    {'阴阳相克', 1400, 2},
    {'玄德乾坤', 1400, 3},
    {'其羽可用', 1400, 3},
    {'昊天罔极', 1400, 4},
    {'皇极生玄', 1400, 5}
}

-- 飘雪穿云掌
SkillInfo[287] = {
    {'水拍云崖', 400, 1},
    {'云海明灯', 400, 2},
    {'罡风推云', 400, 2}
}

-- 金顶绵掌
SkillInfo[288] = {
    {'金顶佛光', 500, 1},
    {'逆流捧沙', 500, 2},
    {'一拍金散', 500, 2}
}

-- 四象掌
SkillInfo[289] = {
    {'太极生两仪', 1000, 2},
    {'两仪生四象', 1000, 2},
    {'四象生八卦', 1000, 3}
}

-- 佛光普照
SkillInfo[290] = {
    {'云开月明', 700, 1},
    {'光芒普照', 700, 2},
    {'佛光盛世', 700, 2}
}

-- 金顶九式
SkillInfo[291] = {
    {'金三式', 700, 1},
    {'顶三式', 700, 2},
    {'后三式', 700, 2}
}

-- 截手九式
SkillInfo[292] = {
    {'侧截三式', 800, 1},
    {'反截三式', 800, 2},
    {'正截三式', 800, 2}
}

-- 三分神指
SkillInfo[293] = {
    {'断玉分金', 1700, 2},
    {'三分天下', 1700, 3},
    {'十万火急', 1700, 4},
    {'归元一击', 1700, 5}
}

-- 抽髓掌
SkillInfo[294] = {
    {'抽骨髓', 700, 1},
    {'抽脑髓', 700, 2},
    {'抽血髓', 700, 2}
}

-- 连环腐尸毒
SkillInfo[295] = {
    {'腐尸毒', 1100, 2},
    {'炼心弹', 1100, 2},
    {'碧焰滔天', 1100, 3},
    {'摧枯折腐', 1100, 4}
}

-- 碧磷针
SkillInfo[296] = {
    {'碧磷针', 0, 0}
}

-- 三笑逍遥散
SkillInfo[297] = {
    {'三笑逍遥散', 0, 0}
}

-- 三无三不手
SkillInfo[298] = {
    {'无孔不入', 800, 1},
    {'无所不为', 800, 2},
    {'无处不至', 800, 2}
}

-- 银拂尘功
SkillInfo[299] = {
    {'拂尘扫天', 700, 1},
    {'拂尘扫地', 700, 2},
    {'拂尘扫人', 700, 2}
}

-- 玉蜂针功
SkillInfo[300] = {
    {'玉蜂针功', 0, 0}
}

-- 冰魄银针功
SkillInfo[301] = {
    {'冰魄银针功', 0, 0}
}

-- 宁式一剑
SkillInfo[302] = {
    {'巾帼须眉', 700, 1},
    {'铿锵玫瑰', 700, 2},
    {'无双无对', 700, 2},
    {'宁式一剑', 700, 2}
}

-- 玉女十九式
SkillInfo[303] = {
    {'玉女穿针', 700, 1},
    {'银光飞舞', 700, 2},
    {'青山隐隐', 700, 2}
}

-- 夺命连环三仙剑
SkillInfo[304] = {
    {'苍松迎客', 1100, 2},
    {'有凤来仪', 1100, 3},
    {'白虹贯日', 1100, 3}
}

-- 劈石破玉拳
SkillInfo[305] = {
    {'一叶扁舟', 1000, 2},
    {'天外飞龙', 1000, 3},
    {'劈石破玉', 1000, 3}
}

-- 混元掌
SkillInfo[306] = {
    {'引元归田', 700, 1},
    {'灵元归天', 800, 2},
    {'抱元归一', 900, 2},
    {'元元融金', 900, 2}
}

-- 伏虎拳
SkillInfo[307] = {
    {'倒扭金钟', 600, 1},
    {'深入虎穴', 600, 2},
    {'左伏右击', 600, 2}
}

-- 鹰蛇生死搏
SkillInfo[308] = {
    {'鹰抓', 900, 1},
    {'蛇缠', 900, 2},
    {'鹰叼蛇咬', 900, 2}
}

-- 泼墨披麻剑法
SkillInfo[309] = {
    {'点墨剑式', 400, 1},
    {'泼墨剑式', 400, 2},
    {'沾墨剑式', 400, 2},
    {'游墨剑式', 400, 2}
}

-- 七玹无形剑
SkillInfo[310] = {
    {'七玹无形音', 900, 1},
    {'七玹黄龙闪', 900, 2},
    {'七玹连环诛', 900, 2}
}

-- 丹青破穴
SkillInfo[311] = {
    {'截脉点穴', 600, 1},
    {'凌空打穴', 600, 2},
    {'百击破穴', 600, 2}
}

-- 黑血神针功
SkillInfo[312] = {
    {'黑血神针功', 0, 0}
}

-- 葵花神针功
SkillInfo[313] = {
    {'葵花神针功', 0, 0}
}

-- 段家剑法
SkillInfo[314] = {
    {'大理段氏', 300, 1},
    {'思平皇室', 300, 2},
    {'俭魏南诏', 300, 2}
}

-- 五罗轻烟掌
SkillInfo[315] = {
    {'烟散', 400, 1},
    {'烟起', 400, 2},
    {'烟尽', 400, 2}
}

-- 碧海潮生曲
SkillInfo[316] = {
    {'碧海无量', 800, 1},
    {'滔滔不绝', 800, 2},
    {'潮起潮落', 800, 2}
}

-- 奇门五转
SkillInfo[317] = {
    {'奇门五转', 800, 1}
}

-- 劈空掌
SkillInfo[318] = {
    {'醋手浸空', 500, 1},
    {'歪斜不称', 500, 2},
    {'疏疏落落', 500, 2}
}

-- 碧波掌
SkillInfo[319] = {
    {'掌势如波', 300, 1},
    {'重重递进', 300, 2}
}

-- 落英剑法
SkillInfo[320] = {
    {'催银箭', 500, 1},
    {'玉漏银壶', 500, 2},
    {'铁关金锁', 500, 2}
}

-- 一字电剑
SkillInfo[321] = {
    {'如电', 300, 1},
    {'如雷', 300, 2}
}

-- 十八连环破
SkillInfo[322] = {
    {'青字九打', 400, 1},
    {'城字九破', 400, 2},
    {'打破连环', 400, 2}
}

-- 雷公轰
SkillInfo[323] = {
    {'春雷乍动', 700, 1},
    {'霹雷坠地', 700, 2},
    {'地雷母纲', 700, 2}
}

-- 袖里乾坤
SkillInfo[324] = {
    {'春雷乍动', 700, 1},
    {'霹雷坠地', 700, 2},
    {'地雷母纲', 700, 2}
}

-- 天王补心针
SkillInfo[325] = {
    {'天王补心针', 0, 0}
}

-- 八仙剑法
SkillInfo[326] = {
    {'钟离扇风', 600, 1},
    {'铁拐洞玄', 600, 2},
    {'纯阳舞剑', 600, 3}
}

-- 天遁剑法
SkillInfo[327] = {
    {'一剑相传', 1000, 2},
    {'天地山河', 1000, 3},
    {'六天成尘', 1000, 3},
    {'星辰月遁', 1000, 4}
}

-- 摧心掌
SkillInfo[328] = {
    {'心力交瘁', 1000, 2},
    {'撕心裂肺', 1000, 2},
    {'呕心沥血', 1000, 3}
}

-- 黑沙掌
SkillInfo[329] = {
    {'黑沙式', 300, 1},
    {'黑掌式', 300, 2},
    {'毒沙式', 300, 2}
}

-- 毒龙锥
SkillInfo[330] = {
    {'毒龙锥', 0, 0}
}

-- 毒蟾砂
SkillInfo[331] = {
    {'毒蟾砂', 0, 0}
}

-- 三蜈五蟆烟
SkillInfo[332] = {
    {'血矮栗', 500, 1},
    {'鬼蝙蝠', 500, 2},
    {'赤蝎粉', 500, 2}
}

-- 金蛇锥功
SkillInfo[333] = {
    {'金蛇锥功', 0, 0}
}

-- 千蛛万毒手
SkillInfo[334] = {
    {'百毒侵', 700, 1},
    {'千蛛劫', 700, 2},
    {'万蛊流', 700, 2}
}

-- 天刀九问
SkillInfo[335] = {
    {'上下未形', 1333, 2},
    {'阴阳三合', 1333, 2},
    {'地方九则', 1333, 2},
    {'增城九重', 1333, 3},
    {'焉有蛅龙', 1333, 4},
    {'天命反侧', 1444, 5}
}

-- 上清快剑
SkillInfo[336] = {
    {'无尘剑势', 500, 1},
    {'无影剑势', 500, 2},
    {'无意剑势', 500, 2},
    {'无动剑势', 500, 2}
}

-- 六合刀法
SkillInfo[337] = {
    {'大圣劈卦', 700, 1},
    {'二郎举卦', 700, 2},
    {'周公推卦', 700, 2}
}

-- 雁行刀
SkillInfo[338] = {
    {'云中寄书', 500, 1},
    {'片影相失', 500, 2},
    {'木落南渡', 500, 2}
}

-- 华岳三神峰
SkillInfo[339] = {
    {'粉石碎玉', 900, 1},
    {'混沌一破', 900, 2},
    {'两拳一刀', 900, 2}
}

-- 大九天手
SkillInfo[340] = {
    {'中天手', 700, 1},
    {'从天手', 700, 2},
    {'碎天手', 700, 2}
}

-- 狂风迅雷扇
SkillInfo[341] = {
    {'狂风急雷', 700, 1},
    {'狂风疾速', 700, 2},
    {'狂风迅雨', 700, 2}
}

-- 大伏魔拳
SkillInfo[342] = {
    {'道高一尺', 1200, 2},
    {'魔高一丈', 1200, 2},
    {'群魔乱舞', 1200, 3},
    {'伏魔卫道', 1200, 4}
}

-- 阴阳磨掌
SkillInfo[343] = {
    {'泽地归元', 1000, 2},
    {'坤仑断岳', 1000, 2},
    {'阴阳磨', 1000, 3}
}

-- 飞凤手
SkillInfo[344] = {
    {'龙飞凤舞', 500, 1},
    {'凤凰槃涅', 500, 2},
    {'凤舞九天', 500, 2}
}

-- 千金术
SkillInfo[345] = {
    {'治疗', 500, 1}
}

-- 大慈大悲手
SkillInfo[346] = {
    {'培元固本', 800, 1},
    {'天王托塔', 800, 2},
    {'四象合一', 800, 2}
}

-- 韦陀掌
SkillInfo[347] = {
    {'灵山礼佛', 300, 1},
    {'山门护法', 300, 2},
    {'只为韦陀', 300, 2}
}

-- 大阴阳手
SkillInfo[348] = {
    {'嵩阳大悲赋', 400, 1},
    {'嵩寒大悲赋', 400, 2},
    {'阴阳大悲赋', 400, 2}
}

-- 幻尘身法
SkillInfo[349] = {
    {'诛龙斩', 1000, 2},
    {'灭龙斩', 1000, 3},
    {'屠龙斩', 1000, 3}
}

-- 阿难破戒刀
SkillInfo[350] = {
    {'断清净', 500, 1},
    {'落红尘', 750, 2},
    {'积业力', 1000, 3},
    {'引外魔', 1250, 3},
    {'粘因果', 1500, 4}
}

-- 金龙鞭法
SkillInfo[351] = {
    {'裂石式', 400, 1},
    {'断川式', 400, 2}
}

-- 碧针清掌
SkillInfo[352] = {
    {'松针细叶', 700, 1},
    {'鼓荡松针', 700, 2},
    {'随风而舞', 700, 2}
}

-- 乾元功
SkillInfo[353] = {
    {'昆仑气沌', 500, 1}
}

-- 通幽诀
SkillInfo[354] = {
    {'幽径通幽', 500, 1}
}

-- 抱元诀
SkillInfo[355] = {
    {'抱元八仙', 500, 1}
}

-- 剑华皈壹
SkillInfo[356] = {
    {'剑芒出鞘', 700, 1}
}

-- 释迦掷象功
SkillInfo[357] = {
    {'蛮牛势', 700, 1},
    {'伏虎势', 700, 2},
    {'掷象势', 700, 2}
}

-- 天王刀法
SkillInfo[358] = {
    {'天大地大', 1000, 2},
    {'托塔天王', 1000, 3},
    {'天王老子', 1000, 3},
    {'天无二日', 1000, 4}
}

-- 蓝砂手
SkillInfo[359] = {
    {'蓝砂石', 600, 1},
    {'蓝砂雾', 600, 2},
    {'蓝砂毒', 600, 2}
}

-- 笑傲江湖曲
SkillInfo[360] = {
    {'沧海一声笑', 800, 1},
    {'滔滔两岸潮', 800, 2},
    {'浮沉随浪只记今朝', 800, 2}
}

-- 风神腿
SkillInfo[361] = {
    {'捕风捉影', 1200, 2},
    {'风中劲草', 1200, 3},
    {'暴雨狂风', 1200, 4},
    {'雷厉风行', 1200, 5}
}

-- 灵犀分水功
SkillInfo[362] = {
    {'灵犀分水功', 1200, 1}
}

-- 太乙分光剑
SkillInfo[363] = {
    {'一元复始', 1400, 2},
    {'二曰归藏', 1400, 2},
    {'三曰周易', 1400, 3},
    {'四象连山', 1400, 3},
    {'五行为卦', 1400, 4},
    {'万象天引', 1800, 5}
}

-- 三分归元气
SkillInfo[364] = {
    {'三分归元气', 1400, 2}
}

-- 排云掌
SkillInfo[365] = {
    {'流水行云', 1000, 1},
    {'披云戴月', 1000, 2},
    {'翻云覆雨', 1000, 2},
    {'排山倒海', 1000, 3},
    {'乌云蔽日', 1000, 3},
    {'重云深锁', 1100, 4},
    {'撕天排云', 1200, 5}
}

-- 天霜拳
SkillInfo[366] = {
    {'风霜扑面', 1000, 1},
    {'霜寒抱月', 1000, 2},
    {'霜结中霄', 1000, 2},
    {'霜雪纷飞', 1000, 3},
    {'霜冷长河', 1000, 3},
    {'霜痕累累', 1000, 4}
}

-- 东鳞西爪功
SkillInfo[367] = {
    {'一鳞半爪', 1000, 1},
    {'鳞次栉比', 1000, 2},
    {'鸟集鳞萃', 1000, 2},
    {'鸿爪春泥', 1000, 3}
}

-- 普渡棍法
SkillInfo[368] = {
    {'沙弥拜山', 250, 1},
    {'罗汉睡梦', 250, 2}
}

-- 韦陀棍法
SkillInfo[369] = {
    {'伏虎听风',750,1},
    {'红霞贯日',750,2},
    {'黄石纳履',750,2}
}

-- 北岳神剑水
SkillInfo[370] = {
    {'北岳神剑水', 0, 0}
}

-- 东岳神剑木
SkillInfo[371] = {
    {'东岳神剑木', 0, 0}
}

-- 南岳神剑火
SkillInfo[372] = {
    {'南岳神剑火', 0, 0}
}

-- 中岳神剑土
SkillInfo[373] = {
    {'中岳神剑土', 0, 0}
}

-- 西岳神剑金
SkillInfo[374] = {
    {'西岳神剑金', 0, 0}
}

-- 穿花蝶影手
SkillInfo[375] = {
    {'庄周梦蝶', 800, 1},
    {'花须蝶芒', 800, 2},
    {'镜花水月', 800, 2}
}

-- 昆仑琴剑
SkillInfo[376] = {
    {'琴音伤人', 700, 1},
    {'琴瑟和谐', 700, 2},
    {'琴剑合一', 700, 3}
}

-- 灵枢定玄指
SkillInfo[377] = {
    {'虚怀若无', 1200, 2},
    {'静若处子', 1200, 3},
    {'瞻忽在前', 1200, 3},
    {'微尘不惊', 1200, 3},
    {'瞻忽在后', 1400, 4},
    {'姑射仙人', 1400, 4}
}

-- 玉碎掌
SkillInfo[378] = {
    {'抛砖引玉', 1200, 2},
    {'碎琼乱玉', 1200, 2},
    {'金声玉振', 1200, 3},
    {'鼎铛玉石', 1200, 3},
    {'兰摧玉折', 1400, 4},
    {'玉石俱焚', 1400, 4}
}

-- 十步方
SkillInfo[379] = {
    {'十方步', 1200, 2}
}

-- 天剑
SkillInfo[380] = {
    {'天剑', 1300, 1}
}

-- 武当剑法
SkillInfo[381] = {
    {'松沉自然', 300, 1},
    {'松腰沉跨', 300, 2}
}

-- 屠龙刀法
SkillInfo[382] = {
    {'叶公好龙', 1200, 2},
    {'鱼龙曼衍', 1200, 2},
    {'鳌愤龙愁', 1200, 3},
    {'烹龙炮凤', 1200, 4}
}

-- 奇门遁甲
SkillInfo[383] = {
    {'天遁', 1200, 1},
    {'地遁', 1200, 1},
    {'人遁', 1200, 1},
    {'云遁', 1200, 1},
    {'风遁', 1200, 1},
    {'龙遁', 1200, 1},
    {'虎遁', 1200, 1},
    {'神遁', 1200, 1},
    {'鬼遁', 1200, 1}
}

-- 临济十二庄
SkillInfo[384] = {
    {'碧波里', 1200, 1},
    {'瑶天地', 1200, 1},
    {'水翠凝', 1200, 1}
}

-- 冰火阴阳诀
SkillInfo[385] = {
    {'一阴一阳', 1200, 1},
    {'交融汇通', 1200, 1},
    {'阳升阴降，阴阳交汇', 1200, 1}
}

-- 碧海潮生功
SkillInfo[386] = {
    {'南岳支天', 1200, 1},
    {'流云落雪', 1200, 1}
}

-- 金关玉锁诀
SkillInfo[387] = {
    {'一剑落九雁', 1200, 1},
    {'回风破长空', 1200, 1},
    {'神风划天翔', 1200, 1}
}